patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_AOS_PEVNTORR3_POR11                   (*((volatile unsigned int*)(0x422128ACUL)))
#define bM4_AOS_PEVNTORR3_POR12                   (*((volatile unsigned int*)(0x422128B0UL)))
#define bM4_AOS_PEVNTORR3_POR13                   (*((volatile unsigned int*)(0x422128B4UL)))
#define bM4_AOS_PEVNTORR3_POR14                   (*((volatile unsigned int*)(0x422128B8UL)))
#define bM4_AOS_PEVNTORR3_POR15                   (*((volatile unsigned int*)(0x422128BCUL)))
#define bM4_AOS_PEVNTOSR3_POS00                   (*((volatile unsigned int*)(0x42212900UL)))
#define bM4_AOS_PEVNTOSR3_POS01                   (*((volatile unsigned int*)(0x42212904UL)))
#define bM4_AOS_PEVNTOSR3_POS02                   (*((volatile unsigned int*)(0x42212908UL)))
#define bM4_AOS_PEVNTOSR3_POS03                   (*((volatile unsigned int*)(0x4221290CUL)))
#define bM4_AOS_PEVNTOSR3_POS04                   (*((volatile unsigned int*)(0x42212910UL)))
#define bM4_AOS_PEVNTOSR3_POS05                   (*((volatile unsigned int*)(0x42212914UL)))
#define bM4_AOS_PEVNTOSR3_POS06                   (*((volatile unsigned int*)(0x42212918UL)))
#define bM4_AOS_PEVNTOSR3_POS07                   (*((volatile unsigned int*)(0x4221291CUL)))
#define bM4_AOS_PEVNTOSR3_POS08                   (*((volatile unsigned int*)(0x42212920UL)))
#define bM4_AOS_PEVNTOSR3_POS09                   (*((volatile unsigned int*)(0x42212924UL)))
#define bM4_AOS_PEVNTOSR3_POS10                   (*((volatile unsigned int*)(0x42212928UL)))
#define bM4_AOS_PEVNTOSR3_POS11                   (*((volatile unsigned int*)(0x4221292CUL)))
#define bM4_AOS_PEVNTOSR3_POS12                   (*((volatile unsigned int*)(0x42212930UL)))
#define bM4_AOS_PEVNTOSR3_POS13                   (*((volatile unsigned int*)(0x42212934UL)))
#define bM4_AOS_PEVNTOSR3_POS14                   (*((volatile unsigned int*)(0x42212938UL)))
#define bM4_AOS_PEVNTOSR3_POS15                   (*((volatile unsigned int*)(0x4221293CUL)))
#define bM4_AOS_PEVNTRISR3_RIS00                  (*((volatile unsigned int*)(0x42212980UL)))
#define bM4_AOS_PEVNTRISR3_RIS01                  (*((volatile unsigned int*)(0x42212984UL)))
#define bM4_AOS_PEVNTRISR3_RIS02                  (*((volatile unsigned int*)(0x42212988UL)))
#define bM4_AOS_PEVNTRISR3_RIS03                  (*((volatile unsigned int*)(0x4221298CUL)))
#define bM4_AOS_PEVNTRISR3_RIS04                  (*((volatile unsigned int*)(0x42212990UL)))
#define bM4_AOS_PEVNTRISR3_RIS05                  (*((volatile unsigned int*)(0x42212994UL)))
#define bM4_AOS_PEVNTRISR3_RIS06                  (*((volatile unsigned int*)(0x42212998UL)))
#define bM4_AOS_PEVNTRISR3_RIS07                  (*((volatile unsigned int*)(0x4221299CUL)))
#define bM4_AOS_PEVNTRISR3_RIS08                  (*((volatile unsigned int*)(0x422129A0UL)))
#define bM4_AOS_PEVNTRISR3_RIS09                  (*((volatile unsigned int*)(0x422129A4UL)))
#define bM4_AOS_PEVNTRISR3_RIS10                  (*((volatile unsigned int*)(0x422129A8UL)))
#define bM4_AOS_PEVNTRISR3_RIS11                  (*((volatile unsigned int*)(0x422129ACUL)))
#define bM4_AOS_PEVNTRISR3_RIS12                  (*((volatile unsigned int*)(0x422129B0UL)))
#define bM4_AOS_PEVNTRISR3_RIS13                  (*((volatile unsigned int*)(0x422129B4UL)))
#define bM4_AOS_PEVNTRISR3_RIS14                  (*((volatile unsigned int*)(0x422129B8UL)))
#define bM4_AOS_PEVNTRISR3_RIS15                  (*((volatile unsigned int*)(0x422129BCUL)))
#define bM4_AOS_PEVNTFAL3_FAL00                   (*((volatile unsigned int*)(0x42212A00UL)))
#define bM4_AOS_PEVNTFAL3_FAL01                   (*((volatile unsigned int*)(0x42212A04UL)))
#define bM4_AOS_PEVNTFAL3_FAL02                   (*((volatile unsigned int*)(0x42212A08UL)))
#define bM4_AOS_PEVNTFAL3_FAL03                   (*((volatile unsigned int*)(0x42212A0CUL)))
#define bM4_AOS_PEVNTFAL3_FAL04                   (*((volatile unsigned int*)(0x42212A10UL)))
#define bM4_AOS_PEVNTFAL3_FAL05                   (*((volatile unsigned int*)(0x42212A14UL)))
#define bM4_AOS_PEVNTFAL3_FAL06                   (*((volatile unsigned int*)(0x42212A18UL)))
#define bM4_AOS_PEVNTFAL3_FAL07                   (*((volatile unsigned int*)(0x42212A1CUL)))
#define bM4_AOS_PEVNTFAL3_FAL08                   (*((volatile unsigned int*)(0x42212A20UL)))
#define bM4_AOS_PEVNTFAL3_FAL09                   (*((volatile unsigned int*)(0x42212A24UL)))
#define bM4_AOS_PEVNTFAL3_FAL10                   (*((volatile unsigned int*)(0x42212A28UL)))
#define bM4_AOS_PEVNTFAL3_FAL11                   (*((volatile unsigned int*)(0x42212A2CUL)))
#define bM4_AOS_PEVNTFAL3_FAL12                   (*((volatile unsigned int*)(0x42212A30UL)))
#define bM4_AOS_PEVNTFAL3_FAL13                   (*((volatile unsigned int*)(0x42212A34UL)))
#define bM4_AOS_PEVNTFAL3_FAL14                   (*((volatile unsigned int*)(0x42212A38UL)))
#define bM4_AOS_PEVNTFAL3_FAL15                   (*((volatile unsigned int*)(0x42212A3CUL)))
#define bM4_AOS_PEVNTDIRR4_PDIR00                 (*((volatile unsigned int*)(0x42212A80UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR01                 (*((volatile unsigned int*)(0x42212A84UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR02                 (*((volatile unsigned int*)(0x42212A88UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR03                 (*((volatile unsigned int*)(0x42212A8CUL)))
#define bM4_AOS_PEVNTDIRR4_PDIR04                 (*((volatile unsigned int*)(0x42212A90UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR05                 (*((volatile unsigned int*)(0x42212A94UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR06                 (*((volatile unsigned int*)(0x42212A98UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR07                 (*((volatile unsigned int*)(0x42212A9CUL)))
#define bM4_AOS_PEVNTDIRR4_PDIR08                 (*((volatile unsigned int*)(0x42212AA0UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR09                 (*((volatile unsigned int*)(0x42212AA4UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR10                 (*((volatile unsigned int*)(0x42212AA8UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR11                 (*((volatile unsigned int*)(0x42212AACUL)))
#define bM4_AOS_PEVNTDIRR4_PDIR12                 (*((volatile unsigned int*)(0x42212AB0UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR13                 (*((volatile unsigned int*)(0x42212AB4UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR14                 (*((volatile unsigned int*)(0x42212AB8UL)))
#define bM4_AOS_PEVNTDIRR4_PDIR15                 (*((volatile unsigned int*)(0x42212ABCUL)))
#define bM4_AOS_PEVNTIDR4_PIN00                   (*((volatile unsigned int*)(0x42212B00UL)))
#define bM4_AOS_PEVNTIDR4_PIN01                   (*((volatile unsigned int*)(0x42212B04UL)))
#define bM4_AOS_PEVNTIDR4_PIN02                   (*((volatile unsigned int*)(0x42212B08UL)))
#define bM4_AOS_PEVNTIDR4_PIN03                   (*((volatile unsigned int*)(0x42212B0CUL)))
#define bM4_AOS_PEVNTIDR4_PIN04                   (*((volatile unsigned int*)(0x42212B10UL)))
#define bM4_AOS_PEVNTIDR4_PIN05                   (*((volatile unsigned int*)(0x42212B14UL)))
#define bM4_AOS_PEVNTIDR4_PIN06                   (*((volatile unsigned int*)(0x42212B18UL)))
#define bM4_AOS_PEVNTIDR4_PIN07                   (*((volatile unsigned int*)(0x42212B1CUL)))
#define bM4_AOS_PEVNTIDR4_PIN08                   (*((volatile unsigned int*)(0x42212B20UL)))
#define bM4_AOS_PEVNTIDR4_PIN09                   (*((volatile unsigned int*)(0x42212B24UL)))
#define bM4_AOS_PEVNTIDR4_PIN10                   (*((volatile unsigned int*)(0x42212B28UL)))
#define bM4_AOS_PEVNTIDR4_PIN11                   (*((volatile unsigned int*)(0x42212B2CUL)))
#define bM4_AOS_PEVNTIDR4_PIN12                   (*((volatile unsigned int*)(0x42212B30UL)))
#define bM4_AOS_PEVNTIDR4_PIN13                   (*((volatile unsigned int*)(0x42212B34UL)))
#define bM4_AOS_PEVNTIDR4_PIN14                   (*((volatile unsigned int*)(0x42212B38UL)))
#define bM4_AOS_PEVNTIDR4_PIN15                   (*((volatile unsigned int*)(0x42212B3CUL)))
#define bM4_AOS_PEVNTODR4_POUT00                  (*((volatile unsigned int*)(0x42212B80UL)))
#define bM4_AOS_PEVNTODR4_POUT01                  (*((volatile unsigned int*)(0x42212B84UL)))
#define bM4_AOS_PEVNTODR4_POUT02                  (*((volatile unsigned int*)(0x42212B88UL)))
#define bM4_AOS_PEVNTODR4_POUT03                  (*((volatile unsigned int*)(0x42212B8CUL)))
#define bM4_AOS_PEVNTODR4_POUT04                  (*((volatile unsigned int*)(0x42212B90UL)))
#define bM4_AOS_PEVNTODR4_POUT05                  (*((volatile unsigned int*)(0x42212B94UL)))
#define bM4_AOS_PEVNTODR4_POUT06                  (*((volatile unsigned int*)(0x42212B98UL)))
#define bM4_AOS_PEVNTODR4_POUT07                  (*((volatile unsigned int*)(0x42212B9CUL)))
#define bM4_AOS_PEVNTODR4_POUT08                  (*((volatile unsigned int*)(0x42212BA0UL)))
#define bM4_AOS_PEVNTODR4_POUT09                  (*((volatile unsigned int*)(0x42212BA4UL)))
#define bM4_AOS_PEVNTODR4_POUT10                  (*((volatile unsigned int*)(0x42212BA8UL)))
#define bM4_AOS_PEVNTODR4_POUT11                  (*((volatile unsigned int*)(0x42212BACUL)))
#define bM4_AOS_PEVNTODR4_POUT12                  (*((volatile unsigned int*)(0x42212BB0UL)))
#define bM4_AOS_PEVNTODR4_POUT13                  (*((volatile unsigned int*)(0x42212BB4UL)))
#define bM4_AOS_PEVNTODR4_POUT14                  (*((volatile unsigned int*)(0x42212BB8UL)))
#define bM4_AOS_PEVNTODR4_POUT15                  (*((volatile unsigned int*)(0x42212BBCUL)))
#define bM4_AOS_PEVNTORR4_POR00                   (*((volatile unsigned int*)(0x42212C00UL)))
#define bM4_AOS_PEVNTORR4_POR01                   (*((volatile unsigned int*)(0x42212C04UL)))
#define bM4_AOS_PEVNTORR4_POR02                   (*((volatile unsigned int*)(0x42212C08UL)))
#define bM4_AOS_PEVNTORR4_POR03                   (*((volatile unsigned int*)(0x42212C0CUL)))
#define bM4_AOS_PEVNTORR4_POR04                   (*((volatile unsigned int*)(0x42212C10UL)))
#define bM4_AOS_PEVNTORR4_POR05                   (*((volatile unsigned int*)(0x42212C14UL)))
#define bM4_AOS_PEVNTORR4_POR06                   (*((volatile unsigned int*)(0x42212C18UL)))
#define bM4_AOS_PEVNTORR4_POR07                   (*((volatile unsigned int*)(0x42212C1CUL)))
#define bM4_AOS_PEVNTORR4_POR08                   (*((volatile unsigned int*)(0x42212C20UL)))
#define bM4_AOS_PEVNTORR4_POR09                   (*((volatile unsigned int*)(0x42212C24UL)))
#define bM4_AOS_PEVNTORR4_POR10                   (*((volatile unsigned int*)(0x42212C28UL)))
#define bM4_AOS_PEVNTORR4_POR11                   (*((volatile unsigned int*)(0x42212C2CUL)))
#define bM4_AOS_PEVNTORR4_POR12                   (*((volatile unsigned int*)(0x42212C30UL)))
#define bM4_AOS_PEVNTORR4_POR13                   (*((volatile unsigned int*)(0x42212C34UL)))
#define bM4_AOS_PEVNTORR4_POR14                   (*((volatile unsigned int*)(0x42212C38UL)))
#define bM4_AOS_PEVNTORR4_POR15                   (*((volatile unsigned int*)(0x42212C3CUL)))
#define bM4_AOS_PEVNTOSR4_POS00                   (*((volatile unsigned int*)(0x42212C80UL)))
#define bM4_AOS_PEVNTOSR4_POS01                   (*((volatile unsigned int*)(0x42212C84UL)))
#define bM4_AOS_PEVNTOSR4_POS02                   (*((volatile unsigned int*)(0x42212C88UL)))
#define bM4_AOS_PEVNTOSR4_POS03                   (*((volatile unsigned int*)(0x42212C8CUL)))
#define bM4_AOS_PEVNTOSR4_POS04                   (*((volatile unsigned int*)(0x42212C90UL)))
#define bM4_AOS_PEVNTOSR4_POS05                   (*((volatile unsigned int*)(0x42212C94UL)))
#define bM4_AOS_PEVNTOSR4_POS06                   (*((volatile unsigned int*)(0x42212C98UL)))
#define bM4_AOS_PEVNTOSR4_POS07                   (*((volatile unsigned int*)(0x42212C9CUL)))
#define bM4_AOS_PEVNTOSR4_POS08                   (*((volatile unsigned int*)(0x42212CA0UL)))
#define bM4_AOS_PEVNTOSR4_POS09                   (*((volatile unsigned int*)(0x42212CA4UL)))
#define bM4_AOS_PEVNTOSR4_POS10                   (*((volatile unsigned int*)(0x42212CA8UL)))
#define bM4_AOS_PEVNTOSR4_POS11                   (*((volatile unsigned int*)(0x42212CACUL)))
#define bM4_AOS_PEVNTOSR4_POS12                   (*((volatile unsigned int*)(0x42212CB0UL)))
#define bM4_AOS_PEVNTOSR4_POS13                   (*((volatile unsigned int*)(0x42212CB4UL)))
#define bM4_AOS_PEVNTOSR4_POS14                   (*((volatile unsigned int*)(0x42212CB8UL)))
#define bM4_AOS_PEVNTOSR4_POS15                   (*((volatile unsigned int*)(0x42212CBCUL)))
#define bM4_AOS_PEVNTRISR4_RIS00                  (*((volatile unsigned int*)(0x42212D00UL)))
#define bM4_AOS_PEVNTRISR4_RIS01                  (*((volatile unsigned int*)(0x42212D04UL)))
#define bM4_AOS_PEVNTRISR4_RIS02                  (*((volatile unsigned int*)(0x42212D08UL)))
#define bM4_AOS_PEVNTRISR4_RIS03                  (*((volatile unsigned int*)(0x42212D0CUL)))
#define bM4_AOS_PEVNTRISR4_RIS04                  (*((volatile unsigned int*)(0x42212D10UL)))
#define bM4_AOS_PEVNTRISR4_RIS05                  (*((volatile unsigned int*)(0x42212D14UL)))
#define bM4_AOS_PEVNTRISR4_RIS06                  (*((volatile unsigned int*)(0x42212D18UL)))
#define bM4_AOS_PEVNTRISR4_RIS07                  (*((volatile unsigned int*)(0x42212D1CUL)))
#define bM4_AOS_PEVNTRISR4_RIS08                  (*((volatile unsigned int*)(0x42212D20UL)))
#define bM4_AOS_PEVNTRISR4_RIS09                  (*((volatile unsigned int*)(0x42212D24UL)))
#define bM4_AOS_PEVNTRISR4_RIS10                  (*((volatile unsigned int*)(0x42212D28UL)))
#define bM4_AOS_PEVNTRISR4_RIS11                  (*((volatile unsigned int*)(0x42212D2CUL)))
#define bM4_AOS_PEVNTRISR4_RIS12                  (*((volatile unsigned int*)(0x42212D30UL)))
#define bM4_AOS_PEVNTRISR4_RIS13                  (*((volatile unsigned int*)(0x42212D34UL)))
#define bM4_AOS_PEVNTRISR4_RIS14                  (*((volatile unsigned int*)(0x42212D38UL)))
#define bM4_AOS_PEVNTRISR4_RIS15                  (*((volatile unsigned int*)(0x42212D3CUL)))
#define bM4_AOS_PEVNTFAL4_FAL00                   (*((volatile unsigned int*)(0x42212D80UL)))
#define bM4_AOS_PEVNTFAL4_FAL01                   (*((volatile unsigned int*)(0x42212D84UL)))
#define bM4_AOS_PEVNTFAL4_FAL02                   (*((volatile unsigned int*)(0x42212D88UL)))
#define bM4_AOS_PEVNTFAL4_FAL03                   (*((volatile unsigned int*)(0x42212D8CUL)))
#define bM4_AOS_PEVNTFAL4_FAL04                   (*((volatile unsigned int*)(0x42212D90UL)))
#define bM4_AOS_PEVNTFAL4_FAL05                   (*((volatile unsigned int*)(0x42212D94UL)))
#define bM4_AOS_PEVNTFAL4_FAL06                   (*((volatile unsigned int*)(0x42212D98UL)))
#define bM4_AOS_PEVNTFAL4_FAL07                   (*((volatile unsigned int*)(0x42212D9CUL)))
#define bM4_AOS_PEVNTFAL4_FAL08                   (*((volatile unsigned int*)(0x42212DA0UL)))
#define bM4_AOS_PEVNTFAL4_FAL09                   (*((volatile unsigned int*)(0x42212DA4UL)))
#define bM4_AOS_PEVNTFAL4_FAL10                   (*((volatile unsigned int*)(0x42212DA8UL)))
#define bM4_AOS_PEVNTFAL4_FAL11                   (*((volatile unsigned int*)(0x42212DACUL)))
#define bM4_AOS_PEVNTFAL4_FAL12                   (*((volatile unsigned int*)(0x42212DB0UL)))
#define bM4_AOS_PEVNTFAL4_FAL13                   (*((volatile unsigned int*)(0x42212DB4UL)))
#define bM4_AOS_PEVNTFAL4_FAL14                   (*((volatile unsigned int*)(0x42212DB8UL)))
#define bM4_AOS_PEVNTFAL4_FAL15                   (*((volatile unsigned int*)(0x42212DBCUL)))
#define bM4_AOS_PEVNTNFCR_NFEN1                   (*((volatile unsigned int*)(0x42212E00UL)))
#define bM4_AOS_PEVNTNFCR_DIVS10                  (*((volatile unsigned int*)(0x42212E04UL)))
#define bM4_AOS_PEVNTNFCR_DIVS11                  (*((volatile unsigned int*)(0x42212E08UL)))
#define bM4_AOS_PEVNTNFCR_NFEN2                   (*((volatile unsigned int*)(0x42212E20UL)))
#define bM4_AOS_PEVNTNFCR_DIVS20                  (*((volatile unsigned int*)(0x42212E24UL)))
#define bM4_AOS_PEVNTNFCR_DIVS21                  (*((volatile unsigned int*)(0x42212E28UL)))
#define bM4_AOS_PEVNTNFCR_NFEN3                   (*((volatile unsigned int*)(0x42212E40UL)))
#define bM4_AOS_PEVNTNFCR_DIVS30                  (*((volatile unsigned int*)(0x42212E44UL)))
#define bM4_AOS_PEVNTNFCR_DIVS31                  (*((volatile unsigned int*)(0x42212E48UL)))
#define bM4_AOS_PEVNTNFCR_NFEN4                   (*((volatile unsigned int*)(0x42212E60UL)))
#define bM4_AOS_PEVNTNFCR_DIVS40                  (*((volatile unsigned int*)(0x42212E64UL)))
#define bM4_AOS_PEVNTNFCR_DIVS41                  (*((volatile unsigned int*)(0x42212E68UL)))
#define bM4_CAN_CFG_STAT_BUSOFF                   (*((volatile unsigned int*)(0x42E09400UL)))
#define bM4_CAN_CFG_STAT_TACTIVE                  (*((volatile unsigned int*)(0x42E09404UL)))
#define bM4_CAN_CFG_STAT_RACTIVE                  (*((volatile unsigned int*)(0x42E09408UL)))
#define bM4_CAN_CFG_STAT_TSSS                     (*((volatile unsigned int*)(0x42E0940CUL)))
#define bM4_CAN_CFG_STAT_TPSS                     (*((volatile unsigned int*)(0x42E09410UL)))
#define bM4_CAN_CFG_STAT_LBMI                     (*((volatile unsigned int*)(0x42E09414UL)))
#define bM4_CAN_CFG_STAT_LBME                     (*((volatile unsigned int*)(0x42E09418UL)))
#define bM4_CAN_CFG_STAT_RESET                    (*((volatile unsigned int*)(0x42E0941CUL)))
#define bM4_CAN_TCMD_TSA                          (*((volatile unsigned int*)(0x42E09420UL)))
#define bM4_CAN_TCMD_TSALL                        (*((volatile unsigned int*)(0x42E09424UL)))
#define bM4_CAN_TCMD_TSONE                        (*((volatile unsigned int*)(0x42E09428UL)))
#define bM4_CAN_TCMD_TPA                          (*((volatile unsigned int*)(0x42E0942CUL)))
#define bM4_CAN_TCMD_TPE                          (*((volatile unsigned int*)(0x42E09430UL)))
#define bM4_CAN_TCMD_STBY                         (*((volatile unsigned int*)(0x42E09434UL)))
#define bM4_CAN_TCMD_LOM                          (*((volatile unsigned int*)(0x42E09438UL)))
#define bM4_CAN_TCMD_TBSEL                        (*((volatile unsigned int*)(0x42E0943CUL)))
#define bM4_CAN_TCTRL_TSSTAT0                     (*((volatile unsigned int*)(0x42E09440UL)))
#define bM4_CAN_TCTRL_TSSTAT1                     (*((volatile unsigned int*)(0x42E09444UL)))
#define bM4_CAN_TCTRL_TTBM                        (*((volatile unsigned int*)(0x42E09450UL)))
#define bM4_CAN_TCTRL_TSMODE                      (*((volatile unsigned int*)(0x42E09454UL)))
#define bM4_CAN_TCTRL_TSNEXT                      (*((volatile unsigned int*)(0x42E09458UL)))
#define bM4_CAN_RCTRL_RSSTAT0                     (*((volatile unsigned int*)(0x42E09460UL)))
#define bM4_CAN_RCTRL_RSSTAT1                     (*((volatile unsigned int*)(0x42E09464UL)))
#define bM4_CAN_RCTRL_RBALL                       (*((volatile unsigned int*)(0x42E0946CUL)))
#define bM4_CAN_RCTRL_RREL                        (*((volatile unsigned int*)(0x42E09470UL)))
#define bM4_CAN_RCTRL_ROV                         (*((volatile unsigned int*)(0x42E09474UL)))
#define bM4_CAN_RCTRL_ROM                         (*((volatile unsigned int*)(0x42E09478UL)))
#define bM4_CAN_RCTRL_SACK                        (*((volatile unsigned int*)(0x42E0947CUL)))
#define bM4_CAN_RTIE_TSFF                         (*((volatile unsigned int*)(0x42E09480UL)))
#define bM4_CAN_RTIE_EIE                          (*((volatile unsigned int*)(0x42E09484UL)))
#define bM4_CAN_RTIE_TSIE                         (*((volatile unsigned int*)(0x42E09488UL)))
#define bM4_CAN_RTIE_TPIE                         (*((volatile unsigned int*)(0x42E0948CUL)))
#define bM4_CAN_RTIE_RAFIE                        (*((volatile unsigned int*)(0x42E09490UL)))
#define bM4_CAN_RTIE_RFIE                         (*((volatile unsigned int*)(0x42E09494UL)))
#define bM4_CAN_RTIE_ROIE                         (*((volatile unsigned int*)(0x42E09498UL)))
#define bM4_CAN_RTIE_RIE                          (*((volatile unsigned int*)(0x42E0949CUL)))
#define bM4_CAN_RTIF_AIF                          (*((volatile unsigned int*)(0x42E094A0UL)))
#define bM4_CAN_RTIF_EIF                          (*((volatile unsigned int*)(0x42E094A4UL)))
#define bM4_CAN_RTIF_TSIF                         (*((volatile unsigned int*)(0x42E094A8UL)))
#define bM4_CAN_RTIF_TPIF                         (*((volatile unsigned int*)(0x42E094ACUL)))
#define bM4_CAN_RTIF_RAFIF                        (*((volatile unsigned int*)(0x42E094B0UL)))
#define bM4_CAN_RTIF_RFIF                         (*((volatile unsigned int*)(0x42E094B4UL)))
#define bM4_CAN_RTIF_ROIF                         (*((volatile unsigned int*)(0x42E094B8UL)))
#define bM4_CAN_RTIF_RIF                          (*((volatile unsigned int*)(0x42E094BCUL)))
#define bM4_CAN_ERRINT_BEIF                       (*((volatile unsigned int*)(0x42E094C0UL)))
#define bM4_CAN_ERRINT_BEIE                       (*((volatile unsigned int*)(0x42E094C4UL)))
#define bM4_CAN_ERRINT_ALIF                       (*((volatile unsigned int*)(0x42E094C8UL)))
#define bM4_CAN_ERRINT_ALIE                       (*((volatile unsigned int*)(0x42E094CCUL)))
#define bM4_CAN_ERRINT_EPIF                       (*((volatile unsigned int*)(0x42E094D0UL)))
#define bM4_CAN_ERRINT_EPIE                       (*((volatile unsigned int*)(0x42E094D4UL)))
#define bM4_CAN_ERRINT_EPASS                      (*((volatile unsigned int*)(0x42E094D8UL)))
#define bM4_CAN_ERRINT_EWARN                      (*((volatile unsigned int*)(0x42E094DCUL)))
#define bM4_CAN_LIMIT_EWL0                        (*((volatile unsigned int*)(0x42E094E0UL)))
#define bM4_CAN_LIMIT_EWL1                        (*((volatile unsigned int*)(0x42E094E4UL)))
#define bM4_CAN_LIMIT_EWL2                        (*((volatile unsigned int*)(0x42E094E8UL)))
#define bM4_CAN_LIMIT_EWL3                        (*((volatile unsigned int*)(0x42E094ECUL)))
#define bM4_CAN_LIMIT_AFWL0                       (*((volatile unsigned int*)(0x42E094F0UL)))
#define bM4_CAN_LIMIT_AFWL1                       (*((volatile unsigned int*)(0x42E094F4UL)))
#define bM4_CAN_LIMIT_AFWL2                       (*((volatile unsigned int*)(0x42E094F8UL)))
#define bM4_CAN_LIMIT_AFWL3                       (*((volatile unsigned int*)(0x42E094FCUL)))
#define bM4_CAN_BT_SEG_10                         (*((volatile unsigned int*)(0x42E09500UL)))
#define bM4_CAN_BT_SEG_11                         (*((volatile unsigned int*)(0x42E09504UL)))
#define bM4_CAN_BT_SEG_12                         (*((volatile unsigned int*)(0x42E09508UL)))
#define bM4_CAN_BT_SEG_13                         (*((volatile unsigned int*)(0x42E0950CUL)))
#define bM4_CAN_BT_SEG_14                         (*((volatile unsigned int*)(0x42E09510UL)))
#define bM4_CAN_BT_SEG_15                         (*((volatile unsigned int*)(0x42E09514UL)))
#define bM4_CAN_BT_SEG_16                         (*((volatile unsigned int*)(0x42E09518UL)))
#define bM4_CAN_BT_SEG_17                         (*((volatile unsigned int*)(0x42E0951CUL)))
#define bM4_CAN_BT_SEG_20                         (*((volatile unsigned int*)(0x42E09520UL)))
#define bM4_CAN_BT_SEG_21                         (*((volatile unsigned int*)(0x42E09524UL)))
#define bM4_CAN_BT_SEG_22                         (*((volatile unsigned int*)(0x42E09528UL)))
#define bM4_CAN_BT_SEG_23                         (*((volatile unsigned int*)(0x42E0952CUL)))
#define bM4_CAN_BT_SEG_24                         (*((volatile unsigned int*)(0x42E09530UL)))
#define bM4_CAN_BT_SEG_25                         (*((volatile unsigned int*)(0x42E09534UL)))
#define bM4_CAN_BT_SEG_26                         (*((volatile unsigned int*)(0x42E09538UL)))
#define bM4_CAN_BT_SJW0                           (*((volatile unsigned int*)(0x42E09540UL)))
#define bM4_CAN_BT_SJW1                           (*((volatile unsigned int*)(0x42E09544UL)))
#define bM4_CAN_BT_SJW2                           (*((volatile unsigned int*)(0x42E09548UL)))
