patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_CAN_BT_SJW3                           (*((volatile unsigned int*)(0x42E0954CUL)))
#define bM4_CAN_BT_SJW4                           (*((volatile unsigned int*)(0x42E09550UL)))
#define bM4_CAN_BT_SJW5                           (*((volatile unsigned int*)(0x42E09554UL)))
#define bM4_CAN_BT_SJW6                           (*((volatile unsigned int*)(0x42E09558UL)))
#define bM4_CAN_BT_PRESC0                         (*((volatile unsigned int*)(0x42E09560UL)))
#define bM4_CAN_BT_PRESC1                         (*((volatile unsigned int*)(0x42E09564UL)))
#define bM4_CAN_BT_PRESC2                         (*((volatile unsigned int*)(0x42E09568UL)))
#define bM4_CAN_BT_PRESC3                         (*((volatile unsigned int*)(0x42E0956CUL)))
#define bM4_CAN_BT_PRESC4                         (*((volatile unsigned int*)(0x42E09570UL)))
#define bM4_CAN_BT_PRESC5                         (*((volatile unsigned int*)(0x42E09574UL)))
#define bM4_CAN_BT_PRESC6                         (*((volatile unsigned int*)(0x42E09578UL)))
#define bM4_CAN_BT_PRESC7                         (*((volatile unsigned int*)(0x42E0957CUL)))
#define bM4_CAN_EALCAP_ALC0                       (*((volatile unsigned int*)(0x42E09600UL)))
#define bM4_CAN_EALCAP_ALC1                       (*((volatile unsigned int*)(0x42E09604UL)))
#define bM4_CAN_EALCAP_ALC2                       (*((volatile unsigned int*)(0x42E09608UL)))
#define bM4_CAN_EALCAP_ALC3                       (*((volatile unsigned int*)(0x42E0960CUL)))
#define bM4_CAN_EALCAP_ALC4                       (*((volatile unsigned int*)(0x42E09610UL)))
#define bM4_CAN_EALCAP_KOER0                      (*((volatile unsigned int*)(0x42E09614UL)))
#define bM4_CAN_EALCAP_KOER1                      (*((volatile unsigned int*)(0x42E09618UL)))
#define bM4_CAN_EALCAP_KOER2                      (*((volatile unsigned int*)(0x42E0961CUL)))
#define bM4_CAN_ACFCTRL_ACFADR0                   (*((volatile unsigned int*)(0x42E09680UL)))
#define bM4_CAN_ACFCTRL_ACFADR1                   (*((volatile unsigned int*)(0x42E09684UL)))
#define bM4_CAN_ACFCTRL_ACFADR2                   (*((volatile unsigned int*)(0x42E09688UL)))
#define bM4_CAN_ACFCTRL_ACFADR3                   (*((volatile unsigned int*)(0x42E0968CUL)))
#define bM4_CAN_ACFCTRL_SELMASK                   (*((volatile unsigned int*)(0x42E09694UL)))
#define bM4_CAN_ACFEN_AE_1                        (*((volatile unsigned int*)(0x42E096C0UL)))
#define bM4_CAN_ACFEN_AE_2                        (*((volatile unsigned int*)(0x42E096C4UL)))
#define bM4_CAN_ACFEN_AE_3                        (*((volatile unsigned int*)(0x42E096C8UL)))
#define bM4_CAN_ACFEN_AE_4                        (*((volatile unsigned int*)(0x42E096CCUL)))
#define bM4_CAN_ACFEN_AE_5                        (*((volatile unsigned int*)(0x42E096D0UL)))
#define bM4_CAN_ACFEN_AE_6                        (*((volatile unsigned int*)(0x42E096D4UL)))
#define bM4_CAN_ACFEN_AE_7                        (*((volatile unsigned int*)(0x42E096D8UL)))
#define bM4_CAN_ACFEN_AE_8                        (*((volatile unsigned int*)(0x42E096DCUL)))
#define bM4_CAN_ACF_ACODEORAMASK0                 (*((volatile unsigned int*)(0x42E09700UL)))
#define bM4_CAN_ACF_ACODEORAMASK1                 (*((volatile unsigned int*)(0x42E09704UL)))
#define bM4_CAN_ACF_ACODEORAMASK2                 (*((volatile unsigned int*)(0x42E09708UL)))
#define bM4_CAN_ACF_ACODEORAMASK3                 (*((volatile unsigned int*)(0x42E0970CUL)))
#define bM4_CAN_ACF_ACODEORAMASK4                 (*((volatile unsigned int*)(0x42E09710UL)))
#define bM4_CAN_ACF_ACODEORAMASK5                 (*((volatile unsigned int*)(0x42E09714UL)))
#define bM4_CAN_ACF_ACODEORAMASK6                 (*((volatile unsigned int*)(0x42E09718UL)))
#define bM4_CAN_ACF_ACODEORAMASK7                 (*((volatile unsigned int*)(0x42E0971CUL)))
#define bM4_CAN_ACF_ACODEORAMASK8                 (*((volatile unsigned int*)(0x42E09720UL)))
#define bM4_CAN_ACF_ACODEORAMASK9                 (*((volatile unsigned int*)(0x42E09724UL)))
#define bM4_CAN_ACF_ACODEORAMASK10                (*((volatile unsigned int*)(0x42E09728UL)))
#define bM4_CAN_ACF_ACODEORAMASK11                (*((volatile unsigned int*)(0x42E0972CUL)))
#define bM4_CAN_ACF_ACODEORAMASK12                (*((volatile unsigned int*)(0x42E09730UL)))
#define bM4_CAN_ACF_ACODEORAMASK13                (*((volatile unsigned int*)(0x42E09734UL)))
#define bM4_CAN_ACF_ACODEORAMASK14                (*((volatile unsigned int*)(0x42E09738UL)))
#define bM4_CAN_ACF_ACODEORAMASK15                (*((volatile unsigned int*)(0x42E0973CUL)))
#define bM4_CAN_ACF_ACODEORAMASK16                (*((volatile unsigned int*)(0x42E09740UL)))
#define bM4_CAN_ACF_ACODEORAMASK17                (*((volatile unsigned int*)(0x42E09744UL)))
#define bM4_CAN_ACF_ACODEORAMASK18                (*((volatile unsigned int*)(0x42E09748UL)))
#define bM4_CAN_ACF_ACODEORAMASK19                (*((volatile unsigned int*)(0x42E0974CUL)))
#define bM4_CAN_ACF_ACODEORAMASK20                (*((volatile unsigned int*)(0x42E09750UL)))
#define bM4_CAN_ACF_ACODEORAMASK21                (*((volatile unsigned int*)(0x42E09754UL)))
#define bM4_CAN_ACF_ACODEORAMASK22                (*((volatile unsigned int*)(0x42E09758UL)))
#define bM4_CAN_ACF_ACODEORAMASK23                (*((volatile unsigned int*)(0x42E0975CUL)))
#define bM4_CAN_ACF_ACODEORAMASK24                (*((volatile unsigned int*)(0x42E09760UL)))
#define bM4_CAN_ACF_ACODEORAMASK25                (*((volatile unsigned int*)(0x42E09764UL)))
#define bM4_CAN_ACF_ACODEORAMASK26                (*((volatile unsigned int*)(0x42E09768UL)))
#define bM4_CAN_ACF_ACODEORAMASK27                (*((volatile unsigned int*)(0x42E0976CUL)))
#define bM4_CAN_ACF_ACODEORAMASK28                (*((volatile unsigned int*)(0x42E09770UL)))
#define bM4_CAN_ACF_AIDE                          (*((volatile unsigned int*)(0x42E09774UL)))
#define bM4_CAN_ACF_AIDEE                         (*((volatile unsigned int*)(0x42E09778UL)))
#define bM4_CAN_TBSLOT_TBPTR0                     (*((volatile unsigned int*)(0x42E097C0UL)))
#define bM4_CAN_TBSLOT_TBPTR1                     (*((volatile unsigned int*)(0x42E097C4UL)))
#define bM4_CAN_TBSLOT_TBPTR2                     (*((volatile unsigned int*)(0x42E097C8UL)))
#define bM4_CAN_TBSLOT_TBPTR3                     (*((volatile unsigned int*)(0x42E097CCUL)))
#define bM4_CAN_TBSLOT_TBPTR4                     (*((volatile unsigned int*)(0x42E097D0UL)))
#define bM4_CAN_TBSLOT_TBPTR5                     (*((volatile unsigned int*)(0x42E097D4UL)))
#define bM4_CAN_TBSLOT_TBF                        (*((volatile unsigned int*)(0x42E097D8UL)))
#define bM4_CAN_TBSLOT_TBE                        (*((volatile unsigned int*)(0x42E097DCUL)))
#define bM4_CAN_TTCFG_TTEN                        (*((volatile unsigned int*)(0x42E097E0UL)))
#define bM4_CAN_TTCFG_T_PRESC0                    (*((volatile unsigned int*)(0x42E097E4UL)))
#define bM4_CAN_TTCFG_T_PRESC1                    (*((volatile unsigned int*)(0x42E097E8UL)))
#define bM4_CAN_TTCFG_TTIF                        (*((volatile unsigned int*)(0x42E097ECUL)))
#define bM4_CAN_TTCFG_TTIE                        (*((volatile unsigned int*)(0x42E097F0UL)))
#define bM4_CAN_TTCFG_TEIF                        (*((volatile unsigned int*)(0x42E097F4UL)))
#define bM4_CAN_TTCFG_WTIF                        (*((volatile unsigned int*)(0x42E097F8UL)))
#define bM4_CAN_TTCFG_WTIE                        (*((volatile unsigned int*)(0x42E097FCUL)))
#define bM4_CAN_REF_MSG_REF_ID0                   (*((volatile unsigned int*)(0x42E09800UL)))
#define bM4_CAN_REF_MSG_REF_ID1                   (*((volatile unsigned int*)(0x42E09804UL)))
#define bM4_CAN_REF_MSG_REF_ID2                   (*((volatile unsigned int*)(0x42E09808UL)))
#define bM4_CAN_REF_MSG_REF_ID3                   (*((volatile unsigned int*)(0x42E0980CUL)))
#define bM4_CAN_REF_MSG_REF_ID4                   (*((volatile unsigned int*)(0x42E09810UL)))
#define bM4_CAN_REF_MSG_REF_ID5                   (*((volatile unsigned int*)(0x42E09814UL)))
#define bM4_CAN_REF_MSG_REF_ID6                   (*((volatile unsigned int*)(0x42E09818UL)))
#define bM4_CAN_REF_MSG_REF_ID7                   (*((volatile unsigned int*)(0x42E0981CUL)))
#define bM4_CAN_REF_MSG_REF_ID8                   (*((volatile unsigned int*)(0x42E09820UL)))
#define bM4_CAN_REF_MSG_REF_ID9                   (*((volatile unsigned int*)(0x42E09824UL)))
#define bM4_CAN_REF_MSG_REF_ID10                  (*((volatile unsigned int*)(0x42E09828UL)))
#define bM4_CAN_REF_MSG_REF_ID11                  (*((volatile unsigned int*)(0x42E0982CUL)))
#define bM4_CAN_REF_MSG_REF_ID12                  (*((volatile unsigned int*)(0x42E09830UL)))
#define bM4_CAN_REF_MSG_REF_ID13                  (*((volatile unsigned int*)(0x42E09834UL)))
#define bM4_CAN_REF_MSG_REF_ID14                  (*((volatile unsigned int*)(0x42E09838UL)))
#define bM4_CAN_REF_MSG_REF_ID15                  (*((volatile unsigned int*)(0x42E0983CUL)))
#define bM4_CAN_REF_MSG_REF_ID16                  (*((volatile unsigned int*)(0x42E09840UL)))
#define bM4_CAN_REF_MSG_REF_ID17                  (*((volatile unsigned int*)(0x42E09844UL)))
#define bM4_CAN_REF_MSG_REF_ID18                  (*((volatile unsigned int*)(0x42E09848UL)))
#define bM4_CAN_REF_MSG_REF_ID19                  (*((volatile unsigned int*)(0x42E0984CUL)))
#define bM4_CAN_REF_MSG_REF_ID20                  (*((volatile unsigned int*)(0x42E09850UL)))
#define bM4_CAN_REF_MSG_REF_ID21                  (*((volatile unsigned int*)(0x42E09854UL)))
#define bM4_CAN_REF_MSG_REF_ID22                  (*((volatile unsigned int*)(0x42E09858UL)))
#define bM4_CAN_REF_MSG_REF_ID23                  (*((volatile unsigned int*)(0x42E0985CUL)))
#define bM4_CAN_REF_MSG_REF_ID24                  (*((volatile unsigned int*)(0x42E09860UL)))
#define bM4_CAN_REF_MSG_REF_ID25                  (*((volatile unsigned int*)(0x42E09864UL)))
#define bM4_CAN_REF_MSG_REF_ID26                  (*((volatile unsigned int*)(0x42E09868UL)))
#define bM4_CAN_REF_MSG_REF_ID27                  (*((volatile unsigned int*)(0x42E0986CUL)))
#define bM4_CAN_REF_MSG_REF_ID28                  (*((volatile unsigned int*)(0x42E09870UL)))
#define bM4_CAN_REF_MSG_REF_IDE                   (*((volatile unsigned int*)(0x42E0987CUL)))
#define bM4_CAN_TRG_CFG_TTPTR0                    (*((volatile unsigned int*)(0x42E09880UL)))
#define bM4_CAN_TRG_CFG_TTPTR1                    (*((volatile unsigned int*)(0x42E09884UL)))
#define bM4_CAN_TRG_CFG_TTPTR2                    (*((volatile unsigned int*)(0x42E09888UL)))
#define bM4_CAN_TRG_CFG_TTPTR3                    (*((volatile unsigned int*)(0x42E0988CUL)))
#define bM4_CAN_TRG_CFG_TTPTR4                    (*((volatile unsigned int*)(0x42E09890UL)))
#define bM4_CAN_TRG_CFG_TTPTR5                    (*((volatile unsigned int*)(0x42E09894UL)))
#define bM4_CAN_TRG_CFG_TTYPE0                    (*((volatile unsigned int*)(0x42E098A0UL)))
#define bM4_CAN_TRG_CFG_TTYPE1                    (*((volatile unsigned int*)(0x42E098A4UL)))
#define bM4_CAN_TRG_CFG_TTYPE2                    (*((volatile unsigned int*)(0x42E098A8UL)))
#define bM4_CAN_TRG_CFG_TEW0                      (*((volatile unsigned int*)(0x42E098B0UL)))
#define bM4_CAN_TRG_CFG_TEW1                      (*((volatile unsigned int*)(0x42E098B4UL)))
#define bM4_CAN_TRG_CFG_TEW2                      (*((volatile unsigned int*)(0x42E098B8UL)))
#define bM4_CAN_TRG_CFG_TEW3                      (*((volatile unsigned int*)(0x42E098BCUL)))
#define bM4_CMP1_CTRL_FLTSL0                      (*((volatile unsigned int*)(0x42940000UL)))
#define bM4_CMP1_CTRL_FLTSL1                      (*((volatile unsigned int*)(0x42940004UL)))
#define bM4_CMP1_CTRL_FLTSL2                      (*((volatile unsigned int*)(0x42940008UL)))
#define bM4_CMP1_CTRL_EDGSL0                      (*((volatile unsigned int*)(0x42940014UL)))
#define bM4_CMP1_CTRL_EDGSL1                      (*((volatile unsigned int*)(0x42940018UL)))
#define bM4_CMP1_CTRL_IEN                         (*((volatile unsigned int*)(0x4294001CUL)))
#define bM4_CMP1_CTRL_CVSEN                       (*((volatile unsigned int*)(0x42940020UL)))
#define bM4_CMP1_CTRL_OUTEN                       (*((volatile unsigned int*)(0x42940030UL)))
#define bM4_CMP1_CTRL_INV                         (*((volatile unsigned int*)(0x42940034UL)))
#define bM4_CMP1_CTRL_CMPOE                       (*((volatile unsigned int*)(0x42940038UL)))
#define bM4_CMP1_CTRL_CMPON                       (*((volatile unsigned int*)(0x4294003CUL)))
#define bM4_CMP1_VLTSEL_RVSL0                     (*((volatile unsigned int*)(0x42940040UL)))
#define bM4_CMP1_VLTSEL_RVSL1                     (*((volatile unsigned int*)(0x42940044UL)))
#define bM4_CMP1_VLTSEL_RVSL2                     (*((volatile unsigned int*)(0x42940048UL)))
#define bM4_CMP1_VLTSEL_RVSL3                     (*((volatile unsigned int*)(0x4294004CUL)))
#define bM4_CMP1_VLTSEL_CVSL0                     (*((volatile unsigned int*)(0x42940060UL)))
#define bM4_CMP1_VLTSEL_CVSL1                     (*((volatile unsigned int*)(0x42940064UL)))
#define bM4_CMP1_VLTSEL_CVSL2                     (*((volatile unsigned int*)(0x42940068UL)))
#define bM4_CMP1_VLTSEL_CVSL3                     (*((volatile unsigned int*)(0x4294006CUL)))
#define bM4_CMP1_VLTSEL_C4SL0                     (*((volatile unsigned int*)(0x42940070UL)))
#define bM4_CMP1_VLTSEL_C4SL1                     (*((volatile unsigned int*)(0x42940074UL)))
#define bM4_CMP1_VLTSEL_C4SL2                     (*((volatile unsigned int*)(0x42940078UL)))
#define bM4_CMP1_MON_OMON                         (*((volatile unsigned int*)(0x42940080UL)))
#define bM4_CMP1_MON_CVST0                        (*((volatile unsigned int*)(0x429400A0UL)))
#define bM4_CMP1_MON_CVST1                        (*((volatile unsigned int*)(0x429400A4UL)))
#define bM4_CMP1_MON_CVST2                        (*((volatile unsigned int*)(0x429400A8UL)))
#define bM4_CMP1_MON_CVST3                        (*((volatile unsigned int*)(0x429400ACUL)))
#define bM4_CMP1_CVSSTB_STB0                      (*((volatile unsigned int*)(0x429400C0UL)))
#define bM4_CMP1_CVSSTB_STB1                      (*((volatile unsigned int*)(0x429400C4UL)))
#define bM4_CMP1_CVSSTB_STB2                      (*((volatile unsigned int*)(0x429400C8UL)))
#define bM4_CMP1_CVSSTB_STB3                      (*((volatile unsigned int*)(0x429400CCUL)))
#define bM4_CMP1_CVSPRD_PRD0                      (*((volatile unsigned int*)(0x42940100UL)))
#define bM4_CMP1_CVSPRD_PRD1                      (*((volatile unsigned int*)(0x42940104UL)))
#define bM4_CMP1_CVSPRD_PRD2                      (*((volatile unsigned int*)(0x42940108UL)))
#define bM4_CMP1_CVSPRD_PRD3                      (*((volatile unsigned int*)(0x4294010CUL)))
#define bM4_CMP1_CVSPRD_PRD4                      (*((volatile unsigned int*)(0x42940110UL)))
#define bM4_CMP1_CVSPRD_PRD5                      (*((volatile unsigned int*)(0x42940114UL)))
#define bM4_CMP1_CVSPRD_PRD6                      (*((volatile unsigned int*)(0x42940118UL)))
#define bM4_CMP1_CVSPRD_PRD7                      (*((volatile unsigned int*)(0x4294011CUL)))
#define bM4_CMP2_CTRL_FLTSL0                      (*((volatile unsigned int*)(0x42940200UL)))
#define bM4_CMP2_CTRL_FLTSL1                      (*((volatile unsigned int*)(0x42940204UL)))
#define bM4_CMP2_CTRL_FLTSL2                      (*((volatile unsigned int*)(0x42940208UL)))
#define bM4_CMP2_CTRL_EDGSL0                      (*((volatile unsigned int*)(0x42940214UL)))
#define bM4_CMP2_CTRL_EDGSL1                      (*((volatile unsigned int*)(0x42940218UL)))
#define bM4_CMP2_CTRL_IEN                         (*((volatile unsigned int*)(0x4294021CUL)))
#define bM4_CMP2_CTRL_CVSEN                       (*((volatile unsigned int*)(0x42940220UL)))
#define bM4_CMP2_CTRL_OUTEN                       (*((volatile unsigned int*)(0x42940230UL)))
#define bM4_CMP2_CTRL_INV                         (*((volatile unsigned int*)(0x42940234UL)))
#define bM4_CMP2_CTRL_CMPOE                       (*((volatile unsigned int*)(0x42940238UL)))
#define bM4_CMP2_CTRL_CMPON                       (*((volatile unsigned int*)(0x4294023CUL)))
#define bM4_CMP2_VLTSEL_RVSL0                     (*((volatile unsigned int*)(0x42940240UL)))
#define bM4_CMP2_VLTSEL_RVSL1                     (*((volatile unsigned int*)(0x42940244UL)))
#define bM4_CMP2_VLTSEL_RVSL2                     (*((volatile unsigned int*)(0x42940248UL)))
#define bM4_CMP2_VLTSEL_RVSL3                     (*((volatile unsigned int*)(0x4294024CUL)))
#define bM4_CMP2_VLTSEL_CVSL0                     (*((volatile unsigned int*)(0x42940260UL)))
#define bM4_CMP2_VLTSEL_CVSL1                     (*((volatile unsigned int*)(0x42940264UL)))
#define bM4_CMP2_VLTSEL_CVSL2                     (*((volatile unsigned int*)(0x42940268UL)))
#define bM4_CMP2_VLTSEL_CVSL3                     (*((volatile unsigned int*)(0x4294026CUL)))
#define bM4_CMP2_VLTSEL_C4SL0                     (*((volatile unsigned int*)(0x42940270UL)))
#define bM4_CMP2_VLTSEL_C4SL1                     (*((volatile unsigned int*)(0x42940274UL)))
#define bM4_CMP2_VLTSEL_C4SL2                     (*((volatile unsigned int*)(0x42940278UL)))
#define bM4_CMP2_MON_OMON                         (*((volatile unsigned int*)(0x42940280UL)))
#define bM4_CMP2_MON_CVST0                        (*((volatile unsigned int*)(0x429402A0UL)))
#define bM4_CMP2_MON_CVST1                        (*((volatile unsigned int*)(0x429402A4UL)))
#define bM4_CMP2_MON_CVST2                        (*((volatile unsigned int*)(0x429402A8UL)))
#define bM4_CMP2_MON_CVST3                        (*((volatile unsigned int*)(0x429402ACUL)))
#define bM4_CMP2_CVSSTB_STB0                      (*((volatile unsigned int*)(0x429402C0UL)))
#define bM4_CMP2_CVSSTB_STB1                      (*((volatile unsigned int*)(0x429402C4UL)))
#define bM4_CMP2_CVSSTB_STB2                      (*((volatile unsigned int*)(0x429402C8UL)))
#define bM4_CMP2_CVSSTB_STB3                      (*((volatile unsigned int*)(0x429402CCUL)))
#define bM4_CMP2_CVSPRD_PRD0                      (*((volatile unsigned int*)(0x42940300UL)))
#define bM4_CMP2_CVSPRD_PRD1                      (*((volatile unsigned int*)(0x42940304UL)))
#define bM4_CMP2_CVSPRD_PRD2                      (*((volatile unsigned int*)(0x42940308UL)))
#define bM4_CMP2_CVSPRD_PRD3                      (*((volatile unsigned int*)(0x4294030CUL)))
#define bM4_CMP2_CVSPRD_PRD4                      (*((volatile unsigned int*)(0x42940310UL)))
#define bM4_CMP2_CVSPRD_PRD5                      (*((volatile unsigned int*)(0x42940314UL)))
#define bM4_CMP2_CVSPRD_PRD6                      (*((volatile unsigned int*)(0x42940318UL)))
#define bM4_CMP2_CVSPRD_PRD7                      (*((volatile unsigned int*)(0x4294031CUL)))
#define bM4_CMP3_CTRL_FLTSL0                      (*((volatile unsigned int*)(0x42940400UL)))
#define bM4_CMP3_CTRL_FLTSL1                      (*((volatile unsigned int*)(0x42940404UL)))
#define bM4_CMP3_CTRL_FLTSL2                      (*((volatile unsigned int*)(0x42940408UL)))
#define bM4_CMP3_CTRL_EDGSL0                      (*((volatile unsigned int*)(0x42940414UL)))
#define bM4_CMP3_CTRL_EDGSL1                      (*((volatile unsigned int*)(0x42940418UL)))
#define bM4_CMP3_CTRL_IEN                         (*((volatile unsigned int*)(0x4294041CUL)))
#define bM4_CMP3_CTRL_CVSEN                       (*((volatile unsigned int*)(0x42940420UL)))
#define bM4_CMP3_CTRL_OUTEN                       (*((volatile unsigned int*)(0x42940430UL)))
#define bM4_CMP3_CTRL_INV                         (*((volatile unsigned int*)(0x42940434UL)))
#define bM4_CMP3_CTRL_CMPOE                       (*((volatile unsigned int*)(0x42940438UL)))
#define bM4_CMP3_CTRL_CMPON                       (*((volatile unsigned int*)(0x4294043CUL)))
#define bM4_CMP3_VLTSEL_RVSL0                     (*((volatile unsigned int*)(0x42940440UL)))
#define bM4_CMP3_VLTSEL_RVSL1                     (*((volatile unsigned int*)(0x42940444UL)))
#define bM4_CMP3_VLTSEL_RVSL2                     (*((volatile unsigned int*)(0x42940448UL)))
#define bM4_CMP3_VLTSEL_RVSL3                     (*((volatile unsigned int*)(0x4294044CUL)))
#define bM4_CMP3_VLTSEL_CVSL0                     (*((volatile unsigned int*)(0x42940460UL)))
#define bM4_CMP3_VLTSEL_CVSL1                     (*((volatile unsigned int*)(0x42940464UL)))
#define bM4_CMP3_VLTSEL_CVSL2                     (*((volatile unsigned int*)(0x42940468UL)))
#define bM4_CMP3_VLTSEL_CVSL3                     (*((volatile unsigned int*)(0x4294046CUL)))
#define bM4_CMP3_VLTSEL_C4SL0                     (*((volatile unsigned int*)(0x42940470UL)))
#define bM4_CMP3_VLTSEL_C4SL1                     (*((volatile unsigned int*)(0x42940474UL)))
#define bM4_CMP3_VLTSEL_C4SL2                     (*((volatile unsigned int*)(0x42940478UL)))
#define bM4_CMP3_MON_OMON                         (*((volatile unsigned int*)(0x42940480UL)))
#define bM4_CMP3_MON_CVST0                        (*((volatile unsigned int*)(0x429404A0UL)))
#define bM4_CMP3_MON_CVST1                        (*((volatile unsigned int*)(0x429404A4UL)))
#define bM4_CMP3_MON_CVST2                        (*((volatile unsigned int*)(0x429404A8UL)))
#define bM4_CMP3_MON_CVST3                        (*((volatile unsigned int*)(0x429404ACUL)))
#define bM4_CMP3_CVSSTB_STB0                      (*((volatile unsigned int*)(0x429404C0UL)))
#define bM4_CMP3_CVSSTB_STB1                      (*((volatile unsigned int*)(0x429404C4UL)))
#define bM4_CMP3_CVSSTB_STB2                      (*((volatile unsigned int*)(0x429404C8UL)))
#define bM4_CMP3_CVSSTB_STB3                      (*((volatile unsigned int*)(0x429404CCUL)))
#define bM4_CMP3_CVSPRD_PRD0                      (*((volatile unsigned int*)(0x42940500UL)))
#define bM4_CMP3_CVSPRD_PRD1                      (*((volatile unsigned int*)(0x42940504UL)))
#define bM4_CMP3_CVSPRD_PRD2                      (*((volatile unsigned int*)(0x42940508UL)))
#define bM4_CMP3_CVSPRD_PRD3                      (*((volatile unsigned int*)(0x4294050CUL)))
#define bM4_CMP3_CVSPRD_PRD4                      (*((volatile unsigned int*)(0x42940510UL)))
#define bM4_CMP3_CVSPRD_PRD5                      (*((volatile unsigned int*)(0x42940514UL)))
#define bM4_CMP3_CVSPRD_PRD6                      (*((volatile unsigned int*)(0x42940518UL)))
#define bM4_CMP3_CVSPRD_PRD7                      (*((volatile unsigned int*)(0x4294051CUL)))
#define bM4_CMP_CR_DADR1_DATA0                    (*((volatile unsigned int*)(0x42942000UL)))
#define bM4_CMP_CR_DADR1_DATA1                    (*((volatile unsigned int*)(0x42942004UL)))
#define bM4_CMP_CR_DADR1_DATA2                    (*((volatile unsigned int*)(0x42942008UL)))
#define bM4_CMP_CR_DADR1_DATA3                    (*((volatile unsigned int*)(0x4294200CUL)))
#define bM4_CMP_CR_DADR1_DATA4                    (*((volatile unsigned int*)(0x42942010UL)))
#define bM4_CMP_CR_DADR1_DATA5                    (*((volatile unsigned int*)(0x42942014UL)))
#define bM4_CMP_CR_DADR1_DATA6                    (*((volatile unsigned int*)(0x42942018UL)))
#define bM4_CMP_CR_DADR1_DATA7                    (*((volatile unsigned int*)(0x4294201CUL)))
#define bM4_CMP_CR_DADR2_DATA0                    (*((volatile unsigned int*)(0x42942040UL)))
#define bM4_CMP_CR_DADR2_DATA1                    (*((volatile unsigned int*)(0x42942044UL)))
#define bM4_CMP_CR_DADR2_DATA2                    (*((volatile unsigned int*)(0x42942048UL)))
#define bM4_CMP_CR_DADR2_DATA3                    (*((volatile unsigned int*)(0x4294204CUL)))
#define bM4_CMP_CR_DADR2_DATA4                    (*((volatile unsigned int*)(0x42942050UL)))
#define bM4_CMP_CR_DADR2_DATA5                    (*((volatile unsigned int*)(0x42942054UL)))
#define bM4_CMP_CR_DADR2_DATA6                    (*((volatile unsigned int*)(0x42942058UL)))
