patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_CMP_CR_DADR2_DATA7                    (*((volatile unsigned int*)(0x4294205CUL)))
#define bM4_CMP_CR_DACR_DA1EN                     (*((volatile unsigned int*)(0x42942100UL)))
#define bM4_CMP_CR_DACR_DA2EN                     (*((volatile unsigned int*)(0x42942104UL)))
#define bM4_CMP_CR_RVADC_DA1SW                    (*((volatile unsigned int*)(0x42942180UL)))
#define bM4_CMP_CR_RVADC_DA2SW                    (*((volatile unsigned int*)(0x42942184UL)))
#define bM4_CMP_CR_RVADC_VREFSW                   (*((volatile unsigned int*)(0x42942190UL)))
#define bM4_CMP_CR_RVADC_WPRT0                    (*((volatile unsigned int*)(0x429421A0UL)))
#define bM4_CMP_CR_RVADC_WPRT1                    (*((volatile unsigned int*)(0x429421A4UL)))
#define bM4_CMP_CR_RVADC_WPRT2                    (*((volatile unsigned int*)(0x429421A8UL)))
#define bM4_CMP_CR_RVADC_WPRT3                    (*((volatile unsigned int*)(0x429421ACUL)))
#define bM4_CMP_CR_RVADC_WPRT4                    (*((volatile unsigned int*)(0x429421B0UL)))
#define bM4_CMP_CR_RVADC_WPRT5                    (*((volatile unsigned int*)(0x429421B4UL)))
#define bM4_CMP_CR_RVADC_WPRT6                    (*((volatile unsigned int*)(0x429421B8UL)))
#define bM4_CMP_CR_RVADC_WPRT7                    (*((volatile unsigned int*)(0x429421BCUL)))
#define bM4_CRC_CR_CRC_SEL                        (*((volatile unsigned int*)(0x42118004UL)))
#define bM4_CRC_CR_REFIN                          (*((volatile unsigned int*)(0x42118008UL)))
#define bM4_CRC_CR_REFOUT                         (*((volatile unsigned int*)(0x4211800CUL)))
#define bM4_CRC_CR_XOROUT                         (*((volatile unsigned int*)(0x42118010UL)))
#define bM4_CRC_FLG_FLAG                          (*((volatile unsigned int*)(0x42118180UL)))
#define bM4_DCU1_CTL_MODE0                        (*((volatile unsigned int*)(0x42A40000UL)))
#define bM4_DCU1_CTL_MODE1                        (*((volatile unsigned int*)(0x42A40004UL)))
#define bM4_DCU1_CTL_MODE2                        (*((volatile unsigned int*)(0x42A40008UL)))
#define bM4_DCU1_CTL_DATASIZE0                    (*((volatile unsigned int*)(0x42A4000CUL)))
#define bM4_DCU1_CTL_DATASIZE1                    (*((volatile unsigned int*)(0x42A40010UL)))
#define bM4_DCU1_CTL_COMP_TRG                     (*((volatile unsigned int*)(0x42A40020UL)))
#define bM4_DCU1_CTL_INTEN                        (*((volatile unsigned int*)(0x42A4007CUL)))
#define bM4_DCU1_FLAG_FLAG_OP                     (*((volatile unsigned int*)(0x42A40080UL)))
#define bM4_DCU1_FLAG_FLAG_LS2                    (*((volatile unsigned int*)(0x42A40084UL)))
#define bM4_DCU1_FLAG_FLAG_EQ2                    (*((volatile unsigned int*)(0x42A40088UL)))
#define bM4_DCU1_FLAG_FLAG_GT2                    (*((volatile unsigned int*)(0x42A4008CUL)))
#define bM4_DCU1_FLAG_FLAG_LS1                    (*((volatile unsigned int*)(0x42A40090UL)))
#define bM4_DCU1_FLAG_FLAG_EQ1                    (*((volatile unsigned int*)(0x42A40094UL)))
#define bM4_DCU1_FLAG_FLAG_GT1                    (*((volatile unsigned int*)(0x42A40098UL)))
#define bM4_DCU1_FLAGCLR_CLR_OP                   (*((volatile unsigned int*)(0x42A40280UL)))
#define bM4_DCU1_FLAGCLR_CLR_LS2                  (*((volatile unsigned int*)(0x42A40284UL)))
#define bM4_DCU1_FLAGCLR_CLR_EQ2                  (*((volatile unsigned int*)(0x42A40288UL)))
#define bM4_DCU1_FLAGCLR_CLR_GT2                  (*((volatile unsigned int*)(0x42A4028CUL)))
#define bM4_DCU1_FLAGCLR_CLR_LS1                  (*((volatile unsigned int*)(0x42A40290UL)))
#define bM4_DCU1_FLAGCLR_CLR_EQ1                  (*((volatile unsigned int*)(0x42A40294UL)))
#define bM4_DCU1_FLAGCLR_CLR_GT1                  (*((volatile unsigned int*)(0x42A40298UL)))
#define bM4_DCU1_INTSEL_INT_OP                    (*((volatile unsigned int*)(0x42A40300UL)))
#define bM4_DCU1_INTSEL_INT_LS2                   (*((volatile unsigned int*)(0x42A40304UL)))
#define bM4_DCU1_INTSEL_INT_EQ2                   (*((volatile unsigned int*)(0x42A40308UL)))
#define bM4_DCU1_INTSEL_INT_GT2                   (*((volatile unsigned int*)(0x42A4030CUL)))
#define bM4_DCU1_INTSEL_INT_LS1                   (*((volatile unsigned int*)(0x42A40310UL)))
#define bM4_DCU1_INTSEL_INT_EQ1                   (*((volatile unsigned int*)(0x42A40314UL)))
#define bM4_DCU1_INTSEL_INT_GT1                   (*((volatile unsigned int*)(0x42A40318UL)))
#define bM4_DCU1_INTSEL_INT_WIN0                  (*((volatile unsigned int*)(0x42A4031CUL)))
#define bM4_DCU1_INTSEL_INT_WIN1                  (*((volatile unsigned int*)(0x42A40320UL)))
#define bM4_DCU2_CTL_MODE0                        (*((volatile unsigned int*)(0x42A48000UL)))
#define bM4_DCU2_CTL_MODE1                        (*((volatile unsigned int*)(0x42A48004UL)))
#define bM4_DCU2_CTL_MODE2                        (*((volatile unsigned int*)(0x42A48008UL)))
#define bM4_DCU2_CTL_DATASIZE0                    (*((volatile unsigned int*)(0x42A4800CUL)))
#define bM4_DCU2_CTL_DATASIZE1                    (*((volatile unsigned int*)(0x42A48010UL)))
#define bM4_DCU2_CTL_COMP_TRG                     (*((volatile unsigned int*)(0x42A48020UL)))
#define bM4_DCU2_CTL_INTEN                        (*((volatile unsigned int*)(0x42A4807CUL)))
#define bM4_DCU2_FLAG_FLAG_OP                     (*((volatile unsigned int*)(0x42A48080UL)))
#define bM4_DCU2_FLAG_FLAG_LS2                    (*((volatile unsigned int*)(0x42A48084UL)))
#define bM4_DCU2_FLAG_FLAG_EQ2                    (*((volatile unsigned int*)(0x42A48088UL)))
#define bM4_DCU2_FLAG_FLAG_GT2                    (*((volatile unsigned int*)(0x42A4808CUL)))
#define bM4_DCU2_FLAG_FLAG_LS1                    (*((volatile unsigned int*)(0x42A48090UL)))
#define bM4_DCU2_FLAG_FLAG_EQ1                    (*((volatile unsigned int*)(0x42A48094UL)))
#define bM4_DCU2_FLAG_FLAG_GT1                    (*((volatile unsigned int*)(0x42A48098UL)))
#define bM4_DCU2_FLAGCLR_CLR_OP                   (*((volatile unsigned int*)(0x42A48280UL)))
#define bM4_DCU2_FLAGCLR_CLR_LS2                  (*((volatile unsigned int*)(0x42A48284UL)))
#define bM4_DCU2_FLAGCLR_CLR_EQ2                  (*((volatile unsigned int*)(0x42A48288UL)))
#define bM4_DCU2_FLAGCLR_CLR_GT2                  (*((volatile unsigned int*)(0x42A4828CUL)))
#define bM4_DCU2_FLAGCLR_CLR_LS1                  (*((volatile unsigned int*)(0x42A48290UL)))
#define bM4_DCU2_FLAGCLR_CLR_EQ1                  (*((volatile unsigned int*)(0x42A48294UL)))
#define bM4_DCU2_FLAGCLR_CLR_GT1                  (*((volatile unsigned int*)(0x42A48298UL)))
#define bM4_DCU2_INTSEL_INT_OP                    (*((volatile unsigned int*)(0x42A48300UL)))
#define bM4_DCU2_INTSEL_INT_LS2                   (*((volatile unsigned int*)(0x42A48304UL)))
#define bM4_DCU2_INTSEL_INT_EQ2                   (*((volatile unsigned int*)(0x42A48308UL)))
#define bM4_DCU2_INTSEL_INT_GT2                   (*((volatile unsigned int*)(0x42A4830CUL)))
#define bM4_DCU2_INTSEL_INT_LS1                   (*((volatile unsigned int*)(0x42A48310UL)))
#define bM4_DCU2_INTSEL_INT_EQ1                   (*((volatile unsigned int*)(0x42A48314UL)))
#define bM4_DCU2_INTSEL_INT_GT1                   (*((volatile unsigned int*)(0x42A48318UL)))
#define bM4_DCU2_INTSEL_INT_WIN0                  (*((volatile unsigned int*)(0x42A4831CUL)))
#define bM4_DCU2_INTSEL_INT_WIN1                  (*((volatile unsigned int*)(0x42A48320UL)))
#define bM4_DCU3_CTL_MODE0                        (*((volatile unsigned int*)(0x42A50000UL)))
#define bM4_DCU3_CTL_MODE1                        (*((volatile unsigned int*)(0x42A50004UL)))
#define bM4_DCU3_CTL_MODE2                        (*((volatile unsigned int*)(0x42A50008UL)))
#define bM4_DCU3_CTL_DATASIZE0                    (*((volatile unsigned int*)(0x42A5000CUL)))
#define bM4_DCU3_CTL_DATASIZE1                    (*((volatile unsigned int*)(0x42A50010UL)))
#define bM4_DCU3_CTL_COMP_TRG                     (*((volatile unsigned int*)(0x42A50020UL)))
#define bM4_DCU3_CTL_INTEN                        (*((volatile unsigned int*)(0x42A5007CUL)))
#define bM4_DCU3_FLAG_FLAG_OP                     (*((volatile unsigned int*)(0x42A50080UL)))
#define bM4_DCU3_FLAG_FLAG_LS2                    (*((volatile unsigned int*)(0x42A50084UL)))
#define bM4_DCU3_FLAG_FLAG_EQ2                    (*((volatile unsigned int*)(0x42A50088UL)))
#define bM4_DCU3_FLAG_FLAG_GT2                    (*((volatile unsigned int*)(0x42A5008CUL)))
#define bM4_DCU3_FLAG_FLAG_LS1                    (*((volatile unsigned int*)(0x42A50090UL)))
#define bM4_DCU3_FLAG_FLAG_EQ1                    (*((volatile unsigned int*)(0x42A50094UL)))
#define bM4_DCU3_FLAG_FLAG_GT1                    (*((volatile unsigned int*)(0x42A50098UL)))
#define bM4_DCU3_FLAGCLR_CLR_OP                   (*((volatile unsigned int*)(0x42A50280UL)))
#define bM4_DCU3_FLAGCLR_CLR_LS2                  (*((volatile unsigned int*)(0x42A50284UL)))
#define bM4_DCU3_FLAGCLR_CLR_EQ2                  (*((volatile unsigned int*)(0x42A50288UL)))
#define bM4_DCU3_FLAGCLR_CLR_GT2                  (*((volatile unsigned int*)(0x42A5028CUL)))
#define bM4_DCU3_FLAGCLR_CLR_LS1                  (*((volatile unsigned int*)(0x42A50290UL)))
#define bM4_DCU3_FLAGCLR_CLR_EQ1                  (*((volatile unsigned int*)(0x42A50294UL)))
#define bM4_DCU3_FLAGCLR_CLR_GT1                  (*((volatile unsigned int*)(0x42A50298UL)))
#define bM4_DCU3_INTSEL_INT_OP                    (*((volatile unsigned int*)(0x42A50300UL)))
#define bM4_DCU3_INTSEL_INT_LS2                   (*((volatile unsigned int*)(0x42A50304UL)))
#define bM4_DCU3_INTSEL_INT_EQ2                   (*((volatile unsigned int*)(0x42A50308UL)))
#define bM4_DCU3_INTSEL_INT_GT2                   (*((volatile unsigned int*)(0x42A5030CUL)))
#define bM4_DCU3_INTSEL_INT_LS1                   (*((volatile unsigned int*)(0x42A50310UL)))
#define bM4_DCU3_INTSEL_INT_EQ1                   (*((volatile unsigned int*)(0x42A50314UL)))
#define bM4_DCU3_INTSEL_INT_GT1                   (*((volatile unsigned int*)(0x42A50318UL)))
#define bM4_DCU3_INTSEL_INT_WIN0                  (*((volatile unsigned int*)(0x42A5031CUL)))
#define bM4_DCU3_INTSEL_INT_WIN1                  (*((volatile unsigned int*)(0x42A50320UL)))
#define bM4_DCU4_CTL_MODE0                        (*((volatile unsigned int*)(0x42A58000UL)))
#define bM4_DCU4_CTL_MODE1                        (*((volatile unsigned int*)(0x42A58004UL)))
#define bM4_DCU4_CTL_MODE2                        (*((volatile unsigned int*)(0x42A58008UL)))
#define bM4_DCU4_CTL_DATASIZE0                    (*((volatile unsigned int*)(0x42A5800CUL)))
#define bM4_DCU4_CTL_DATASIZE1                    (*((volatile unsigned int*)(0x42A58010UL)))
#define bM4_DCU4_CTL_COMP_TRG                     (*((volatile unsigned int*)(0x42A58020UL)))
#define bM4_DCU4_CTL_INTEN                        (*((volatile unsigned int*)(0x42A5807CUL)))
#define bM4_DCU4_FLAG_FLAG_OP                     (*((volatile unsigned int*)(0x42A58080UL)))
#define bM4_DCU4_FLAG_FLAG_LS2                    (*((volatile unsigned int*)(0x42A58084UL)))
#define bM4_DCU4_FLAG_FLAG_EQ2                    (*((volatile unsigned int*)(0x42A58088UL)))
#define bM4_DCU4_FLAG_FLAG_GT2                    (*((volatile unsigned int*)(0x42A5808CUL)))
#define bM4_DCU4_FLAG_FLAG_LS1                    (*((volatile unsigned int*)(0x42A58090UL)))
#define bM4_DCU4_FLAG_FLAG_EQ1                    (*((volatile unsigned int*)(0x42A58094UL)))
#define bM4_DCU4_FLAG_FLAG_GT1                    (*((volatile unsigned int*)(0x42A58098UL)))
#define bM4_DCU4_FLAGCLR_CLR_OP                   (*((volatile unsigned int*)(0x42A58280UL)))
#define bM4_DCU4_FLAGCLR_CLR_LS2                  (*((volatile unsigned int*)(0x42A58284UL)))
#define bM4_DCU4_FLAGCLR_CLR_EQ2                  (*((volatile unsigned int*)(0x42A58288UL)))
#define bM4_DCU4_FLAGCLR_CLR_GT2                  (*((volatile unsigned int*)(0x42A5828CUL)))
#define bM4_DCU4_FLAGCLR_CLR_LS1                  (*((volatile unsigned int*)(0x42A58290UL)))
#define bM4_DCU4_FLAGCLR_CLR_EQ1                  (*((volatile unsigned int*)(0x42A58294UL)))
#define bM4_DCU4_FLAGCLR_CLR_GT1                  (*((volatile unsigned int*)(0x42A58298UL)))
#define bM4_DCU4_INTSEL_INT_OP                    (*((volatile unsigned int*)(0x42A58300UL)))
#define bM4_DCU4_INTSEL_INT_LS2                   (*((volatile unsigned int*)(0x42A58304UL)))
#define bM4_DCU4_INTSEL_INT_EQ2                   (*((volatile unsigned int*)(0x42A58308UL)))
#define bM4_DCU4_INTSEL_INT_GT2                   (*((volatile unsigned int*)(0x42A5830CUL)))
#define bM4_DCU4_INTSEL_INT_LS1                   (*((volatile unsigned int*)(0x42A58310UL)))
#define bM4_DCU4_INTSEL_INT_EQ1                   (*((volatile unsigned int*)(0x42A58314UL)))
#define bM4_DCU4_INTSEL_INT_GT1                   (*((volatile unsigned int*)(0x42A58318UL)))
#define bM4_DCU4_INTSEL_INT_WIN0                  (*((volatile unsigned int*)(0x42A5831CUL)))
#define bM4_DCU4_INTSEL_INT_WIN1                  (*((volatile unsigned int*)(0x42A58320UL)))
#define bM4_DMA1_EN_EN                            (*((volatile unsigned int*)(0x42A60000UL)))
#define bM4_DMA1_INTSTAT0_TRNERR0                 (*((volatile unsigned int*)(0x42A60080UL)))
#define bM4_DMA1_INTSTAT0_TRNERR1                 (*((volatile unsigned int*)(0x42A60084UL)))
#define bM4_DMA1_INTSTAT0_TRNERR2                 (*((volatile unsigned int*)(0x42A60088UL)))
#define bM4_DMA1_INTSTAT0_TRNERR3                 (*((volatile unsigned int*)(0x42A6008CUL)))
#define bM4_DMA1_INTSTAT0_REQERR0                 (*((volatile unsigned int*)(0x42A600C0UL)))
#define bM4_DMA1_INTSTAT0_REQERR1                 (*((volatile unsigned int*)(0x42A600C4UL)))
#define bM4_DMA1_INTSTAT0_REQERR2                 (*((volatile unsigned int*)(0x42A600C8UL)))
#define bM4_DMA1_INTSTAT0_REQERR3                 (*((volatile unsigned int*)(0x42A600CCUL)))
#define bM4_DMA1_INTSTAT1_TC0                     (*((volatile unsigned int*)(0x42A60100UL)))
#define bM4_DMA1_INTSTAT1_TC1                     (*((volatile unsigned int*)(0x42A60104UL)))
#define bM4_DMA1_INTSTAT1_TC2                     (*((volatile unsigned int*)(0x42A60108UL)))
#define bM4_DMA1_INTSTAT1_TC3                     (*((volatile unsigned int*)(0x42A6010CUL)))
#define bM4_DMA1_INTSTAT1_BTC0                    (*((volatile unsigned int*)(0x42A60140UL)))
#define bM4_DMA1_INTSTAT1_BTC1                    (*((volatile unsigned int*)(0x42A60144UL)))
#define bM4_DMA1_INTSTAT1_BTC2                    (*((volatile unsigned int*)(0x42A60148UL)))
#define bM4_DMA1_INTSTAT1_BTC3                    (*((volatile unsigned int*)(0x42A6014CUL)))
#define bM4_DMA1_INTMASK0_MSKTRNERR0              (*((volatile unsigned int*)(0x42A60180UL)))
#define bM4_DMA1_INTMASK0_MSKTRNERR1              (*((volatile unsigned int*)(0x42A60184UL)))
#define bM4_DMA1_INTMASK0_MSKTRNERR2              (*((volatile unsigned int*)(0x42A60188UL)))
#define bM4_DMA1_INTMASK0_MSKTRNERR3              (*((volatile unsigned int*)(0x42A6018CUL)))
#define bM4_DMA1_INTMASK0_MSKREQERR0              (*((volatile unsigned int*)(0x42A601C0UL)))
#define bM4_DMA1_INTMASK0_MSKREQERR1              (*((volatile unsigned int*)(0x42A601C4UL)))
#define bM4_DMA1_INTMASK0_MSKREQERR2              (*((volatile unsigned int*)(0x42A601C8UL)))
#define bM4_DMA1_INTMASK0_MSKREQERR3              (*((volatile unsigned int*)(0x42A601CCUL)))
#define bM4_DMA1_INTMASK1_MSKTC0                  (*((volatile unsigned int*)(0x42A60200UL)))
#define bM4_DMA1_INTMASK1_MSKTC1                  (*((volatile unsigned int*)(0x42A60204UL)))
#define bM4_DMA1_INTMASK1_MSKTC2                  (*((volatile unsigned int*)(0x42A60208UL)))
#define bM4_DMA1_INTMASK1_MSKTC3                  (*((volatile unsigned int*)(0x42A6020CUL)))
#define bM4_DMA1_INTMASK1_MSKBTC0                 (*((volatile unsigned int*)(0x42A60240UL)))
#define bM4_DMA1_INTMASK1_MSKBTC1                 (*((volatile unsigned int*)(0x42A60244UL)))
#define bM4_DMA1_INTMASK1_MSKBTC2                 (*((volatile unsigned int*)(0x42A60248UL)))
#define bM4_DMA1_INTMASK1_MSKBTC3                 (*((volatile unsigned int*)(0x42A6024CUL)))
#define bM4_DMA1_INTCLR0_CLRTRNERR0               (*((volatile unsigned int*)(0x42A60280UL)))
#define bM4_DMA1_INTCLR0_CLRTRNERR1               (*((volatile unsigned int*)(0x42A60284UL)))
#define bM4_DMA1_INTCLR0_CLRTRNERR2               (*((volatile unsigned int*)(0x42A60288UL)))
#define bM4_DMA1_INTCLR0_CLRTRNERR3               (*((volatile unsigned int*)(0x42A6028CUL)))
#define bM4_DMA1_INTCLR0_CLRREQERR0               (*((volatile unsigned int*)(0x42A602C0UL)))
#define bM4_DMA1_INTCLR0_CLRREQERR1               (*((volatile unsigned int*)(0x42A602C4UL)))
#define bM4_DMA1_INTCLR0_CLRREQERR2               (*((volatile unsigned int*)(0x42A602C8UL)))
#define bM4_DMA1_INTCLR0_CLRREQERR3               (*((volatile unsigned int*)(0x42A602CCUL)))
#define bM4_DMA1_INTCLR1_CLRTC0                   (*((volatile unsigned int*)(0x42A60300UL)))
#define bM4_DMA1_INTCLR1_CLRTC1                   (*((volatile unsigned int*)(0x42A60304UL)))
#define bM4_DMA1_INTCLR1_CLRTC2                   (*((volatile unsigned int*)(0x42A60308UL)))
#define bM4_DMA1_INTCLR1_CLRTC3                   (*((volatile unsigned int*)(0x42A6030CUL)))
#define bM4_DMA1_INTCLR1_CLRBTC0                  (*((volatile unsigned int*)(0x42A60340UL)))
#define bM4_DMA1_INTCLR1_CLRBTC1                  (*((volatile unsigned int*)(0x42A60344UL)))
#define bM4_DMA1_INTCLR1_CLRBTC2                  (*((volatile unsigned int*)(0x42A60348UL)))
#define bM4_DMA1_INTCLR1_CLRBTC3                  (*((volatile unsigned int*)(0x42A6034CUL)))
#define bM4_DMA1_CHEN_CHEN0                       (*((volatile unsigned int*)(0x42A60380UL)))
#define bM4_DMA1_CHEN_CHEN1                       (*((volatile unsigned int*)(0x42A60384UL)))
#define bM4_DMA1_CHEN_CHEN2                       (*((volatile unsigned int*)(0x42A60388UL)))
#define bM4_DMA1_CHEN_CHEN3                       (*((volatile unsigned int*)(0x42A6038CUL)))
#define bM4_DMA1_CHSTAT_DMAACT                    (*((volatile unsigned int*)(0x42A60480UL)))
#define bM4_DMA1_CHSTAT_RCFGACT                   (*((volatile unsigned int*)(0x42A60484UL)))
#define bM4_DMA1_CHSTAT_CHACT0                    (*((volatile unsigned int*)(0x42A604C0UL)))
#define bM4_DMA1_CHSTAT_CHACT1                    (*((volatile unsigned int*)(0x42A604C4UL)))
#define bM4_DMA1_CHSTAT_CHACT2                    (*((volatile unsigned int*)(0x42A604C8UL)))
#define bM4_DMA1_CHSTAT_CHACT3                    (*((volatile unsigned int*)(0x42A604CCUL)))
#define bM4_DMA1_RCFGCTL_RCFGEN                   (*((volatile unsigned int*)(0x42A60580UL)))
#define bM4_DMA1_RCFGCTL_RCFGLLP                  (*((volatile unsigned int*)(0x42A60584UL)))
#define bM4_DMA1_RCFGCTL_RCFGCHS0                 (*((volatile unsigned int*)(0x42A605A0UL)))
#define bM4_DMA1_RCFGCTL_RCFGCHS1                 (*((volatile unsigned int*)(0x42A605A4UL)))
#define bM4_DMA1_RCFGCTL_RCFGCHS2                 (*((volatile unsigned int*)(0x42A605A8UL)))
#define bM4_DMA1_RCFGCTL_RCFGCHS3                 (*((volatile unsigned int*)(0x42A605ACUL)))
#define bM4_DMA1_RCFGCTL_SARMD0                   (*((volatile unsigned int*)(0x42A605C0UL)))
#define bM4_DMA1_RCFGCTL_SARMD1                   (*((volatile unsigned int*)(0x42A605C4UL)))
#define bM4_DMA1_RCFGCTL_DARMD0                   (*((volatile unsigned int*)(0x42A605C8UL)))
#define bM4_DMA1_RCFGCTL_DARMD1                   (*((volatile unsigned int*)(0x42A605CCUL)))
#define bM4_DMA1_RCFGCTL_CNTMD0                   (*((volatile unsigned int*)(0x42A605D0UL)))
#define bM4_DMA1_RCFGCTL_CNTMD1                   (*((volatile unsigned int*)(0x42A605D4UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE0                  (*((volatile unsigned int*)(0x42A60900UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE1                  (*((volatile unsigned int*)(0x42A60904UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE2                  (*((volatile unsigned int*)(0x42A60908UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE3                  (*((volatile unsigned int*)(0x42A6090CUL)))
#define bM4_DMA1_DTCTL0_BLKSIZE4                  (*((volatile unsigned int*)(0x42A60910UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE5                  (*((volatile unsigned int*)(0x42A60914UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE6                  (*((volatile unsigned int*)(0x42A60918UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE7                  (*((volatile unsigned int*)(0x42A6091CUL)))
#define bM4_DMA1_DTCTL0_BLKSIZE8                  (*((volatile unsigned int*)(0x42A60920UL)))
#define bM4_DMA1_DTCTL0_BLKSIZE9                  (*((volatile unsigned int*)(0x42A60924UL)))
#define bM4_DMA1_DTCTL0_CNT0                      (*((volatile unsigned int*)(0x42A60940UL)))
#define bM4_DMA1_DTCTL0_CNT1                      (*((volatile unsigned int*)(0x42A60944UL)))
#define bM4_DMA1_DTCTL0_CNT2                      (*((volatile unsigned int*)(0x42A60948UL)))
#define bM4_DMA1_DTCTL0_CNT3                      (*((volatile unsigned int*)(0x42A6094CUL)))
#define bM4_DMA1_DTCTL0_CNT4                      (*((volatile unsigned int*)(0x42A60950UL)))
#define bM4_DMA1_DTCTL0_CNT5                      (*((volatile unsigned int*)(0x42A60954UL)))
#define bM4_DMA1_DTCTL0_CNT6                      (*((volatile unsigned int*)(0x42A60958UL)))
#define bM4_DMA1_DTCTL0_CNT7                      (*((volatile unsigned int*)(0x42A6095CUL)))
#define bM4_DMA1_DTCTL0_CNT8                      (*((volatile unsigned int*)(0x42A60960UL)))
#define bM4_DMA1_DTCTL0_CNT9                      (*((volatile unsigned int*)(0x42A60964UL)))
#define bM4_DMA1_DTCTL0_CNT10                     (*((volatile unsigned int*)(0x42A60968UL)))
#define bM4_DMA1_DTCTL0_CNT11                     (*((volatile unsigned int*)(0x42A6096CUL)))
#define bM4_DMA1_DTCTL0_CNT12                     (*((volatile unsigned int*)(0x42A60970UL)))
#define bM4_DMA1_DTCTL0_CNT13                     (*((volatile unsigned int*)(0x42A60974UL)))
#define bM4_DMA1_DTCTL0_CNT14                     (*((volatile unsigned int*)(0x42A60978UL)))
#define bM4_DMA1_DTCTL0_CNT15                     (*((volatile unsigned int*)(0x42A6097CUL)))
#define bM4_DMA1_RPT0_SRPT0                       (*((volatile unsigned int*)(0x42A60980UL)))
#define bM4_DMA1_RPT0_SRPT1                       (*((volatile unsigned int*)(0x42A60984UL)))
#define bM4_DMA1_RPT0_SRPT2                       (*((volatile unsigned int*)(0x42A60988UL)))
#define bM4_DMA1_RPT0_SRPT3                       (*((volatile unsigned int*)(0x42A6098CUL)))
#define bM4_DMA1_RPT0_SRPT4                       (*((volatile unsigned int*)(0x42A60990UL)))
#define bM4_DMA1_RPT0_SRPT5                       (*((volatile unsigned int*)(0x42A60994UL)))
#define bM4_DMA1_RPT0_SRPT6                       (*((volatile unsigned int*)(0x42A60998UL)))
#define bM4_DMA1_RPT0_SRPT7                       (*((volatile unsigned int*)(0x42A6099CUL)))
#define bM4_DMA1_RPT0_SRPT8                       (*((volatile unsigned int*)(0x42A609A0UL)))
#define bM4_DMA1_RPT0_SRPT9                       (*((volatile unsigned int*)(0x42A609A4UL)))
#define bM4_DMA1_RPT0_DRPT0                       (*((volatile unsigned int*)(0x42A609C0UL)))
#define bM4_DMA1_RPT0_DRPT1                       (*((volatile unsigned int*)(0x42A609C4UL)))
#define bM4_DMA1_RPT0_DRPT2                       (*((volatile unsigned int*)(0x42A609C8UL)))
#define bM4_DMA1_RPT0_DRPT3                       (*((volatile unsigned int*)(0x42A609CCUL)))
#define bM4_DMA1_RPT0_DRPT4                       (*((volatile unsigned int*)(0x42A609D0UL)))
#define bM4_DMA1_RPT0_DRPT5                       (*((volatile unsigned int*)(0x42A609D4UL)))
#define bM4_DMA1_RPT0_DRPT6                       (*((volatile unsigned int*)(0x42A609D8UL)))
#define bM4_DMA1_RPT0_DRPT7                       (*((volatile unsigned int*)(0x42A609DCUL)))
#define bM4_DMA1_RPT0_DRPT8                       (*((volatile unsigned int*)(0x42A609E0UL)))
