patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_DMA1_SNSEQCTLB2_SNSDIST18             (*((volatile unsigned int*)(0x42A61A48UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSDIST19             (*((volatile unsigned int*)(0x42A61A4CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB0              (*((volatile unsigned int*)(0x42A61A50UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB1              (*((volatile unsigned int*)(0x42A61A54UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB2              (*((volatile unsigned int*)(0x42A61A58UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB3              (*((volatile unsigned int*)(0x42A61A5CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB4              (*((volatile unsigned int*)(0x42A61A60UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB5              (*((volatile unsigned int*)(0x42A61A64UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB6              (*((volatile unsigned int*)(0x42A61A68UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB7              (*((volatile unsigned int*)(0x42A61A6CUL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB8              (*((volatile unsigned int*)(0x42A61A70UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB9              (*((volatile unsigned int*)(0x42A61A74UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB10             (*((volatile unsigned int*)(0x42A61A78UL)))
#define bM4_DMA1_SNSEQCTLB2_SNSCNTB11             (*((volatile unsigned int*)(0x42A61A7CUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET0               (*((volatile unsigned int*)(0x42A61A80UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET1               (*((volatile unsigned int*)(0x42A61A84UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET2               (*((volatile unsigned int*)(0x42A61A88UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET3               (*((volatile unsigned int*)(0x42A61A8CUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET4               (*((volatile unsigned int*)(0x42A61A90UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET5               (*((volatile unsigned int*)(0x42A61A94UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET6               (*((volatile unsigned int*)(0x42A61A98UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET7               (*((volatile unsigned int*)(0x42A61A9CUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET8               (*((volatile unsigned int*)(0x42A61AA0UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET9               (*((volatile unsigned int*)(0x42A61AA4UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET10              (*((volatile unsigned int*)(0x42A61AA8UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET11              (*((volatile unsigned int*)(0x42A61AACUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET12              (*((volatile unsigned int*)(0x42A61AB0UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET13              (*((volatile unsigned int*)(0x42A61AB4UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET14              (*((volatile unsigned int*)(0x42A61AB8UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET15              (*((volatile unsigned int*)(0x42A61ABCUL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET16              (*((volatile unsigned int*)(0x42A61AC0UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET17              (*((volatile unsigned int*)(0x42A61AC4UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET18              (*((volatile unsigned int*)(0x42A61AC8UL)))
#define bM4_DMA1_DNSEQCTL2_DOFFSET19              (*((volatile unsigned int*)(0x42A61ACCUL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT0                (*((volatile unsigned int*)(0x42A61AD0UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT1                (*((volatile unsigned int*)(0x42A61AD4UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT2                (*((volatile unsigned int*)(0x42A61AD8UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT3                (*((volatile unsigned int*)(0x42A61ADCUL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT4                (*((volatile unsigned int*)(0x42A61AE0UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT5                (*((volatile unsigned int*)(0x42A61AE4UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT6                (*((volatile unsigned int*)(0x42A61AE8UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT7                (*((volatile unsigned int*)(0x42A61AECUL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT8                (*((volatile unsigned int*)(0x42A61AF0UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT9                (*((volatile unsigned int*)(0x42A61AF4UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT10               (*((volatile unsigned int*)(0x42A61AF8UL)))
#define bM4_DMA1_DNSEQCTL2_DNSCNT11               (*((volatile unsigned int*)(0x42A61AFCUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST0              (*((volatile unsigned int*)(0x42A61A80UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST1              (*((volatile unsigned int*)(0x42A61A84UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST2              (*((volatile unsigned int*)(0x42A61A88UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST3              (*((volatile unsigned int*)(0x42A61A8CUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST4              (*((volatile unsigned int*)(0x42A61A90UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST5              (*((volatile unsigned int*)(0x42A61A94UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST6              (*((volatile unsigned int*)(0x42A61A98UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST7              (*((volatile unsigned int*)(0x42A61A9CUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST8              (*((volatile unsigned int*)(0x42A61AA0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST9              (*((volatile unsigned int*)(0x42A61AA4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST10             (*((volatile unsigned int*)(0x42A61AA8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST11             (*((volatile unsigned int*)(0x42A61AACUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST12             (*((volatile unsigned int*)(0x42A61AB0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST13             (*((volatile unsigned int*)(0x42A61AB4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST14             (*((volatile unsigned int*)(0x42A61AB8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST15             (*((volatile unsigned int*)(0x42A61ABCUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST16             (*((volatile unsigned int*)(0x42A61AC0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST17             (*((volatile unsigned int*)(0x42A61AC4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST18             (*((volatile unsigned int*)(0x42A61AC8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSDIST19             (*((volatile unsigned int*)(0x42A61ACCUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB0              (*((volatile unsigned int*)(0x42A61AD0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB1              (*((volatile unsigned int*)(0x42A61AD4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB2              (*((volatile unsigned int*)(0x42A61AD8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB3              (*((volatile unsigned int*)(0x42A61ADCUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB4              (*((volatile unsigned int*)(0x42A61AE0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB5              (*((volatile unsigned int*)(0x42A61AE4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB6              (*((volatile unsigned int*)(0x42A61AE8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB7              (*((volatile unsigned int*)(0x42A61AECUL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB8              (*((volatile unsigned int*)(0x42A61AF0UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB9              (*((volatile unsigned int*)(0x42A61AF4UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB10             (*((volatile unsigned int*)(0x42A61AF8UL)))
#define bM4_DMA1_DNSEQCTLB2_DNSCNTB11             (*((volatile unsigned int*)(0x42A61AFCUL)))
#define bM4_DMA1_LLP2_LLP0                        (*((volatile unsigned int*)(0x42A61B08UL)))
#define bM4_DMA1_LLP2_LLP1                        (*((volatile unsigned int*)(0x42A61B0CUL)))
#define bM4_DMA1_LLP2_LLP2                        (*((volatile unsigned int*)(0x42A61B10UL)))
#define bM4_DMA1_LLP2_LLP3                        (*((volatile unsigned int*)(0x42A61B14UL)))
#define bM4_DMA1_LLP2_LLP4                        (*((volatile unsigned int*)(0x42A61B18UL)))
#define bM4_DMA1_LLP2_LLP5                        (*((volatile unsigned int*)(0x42A61B1CUL)))
#define bM4_DMA1_LLP2_LLP6                        (*((volatile unsigned int*)(0x42A61B20UL)))
#define bM4_DMA1_LLP2_LLP7                        (*((volatile unsigned int*)(0x42A61B24UL)))
#define bM4_DMA1_LLP2_LLP8                        (*((volatile unsigned int*)(0x42A61B28UL)))
#define bM4_DMA1_LLP2_LLP9                        (*((volatile unsigned int*)(0x42A61B2CUL)))
#define bM4_DMA1_LLP2_LLP10                       (*((volatile unsigned int*)(0x42A61B30UL)))
#define bM4_DMA1_LLP2_LLP11                       (*((volatile unsigned int*)(0x42A61B34UL)))
#define bM4_DMA1_LLP2_LLP12                       (*((volatile unsigned int*)(0x42A61B38UL)))
#define bM4_DMA1_LLP2_LLP13                       (*((volatile unsigned int*)(0x42A61B3CUL)))
#define bM4_DMA1_LLP2_LLP14                       (*((volatile unsigned int*)(0x42A61B40UL)))
#define bM4_DMA1_LLP2_LLP15                       (*((volatile unsigned int*)(0x42A61B44UL)))
#define bM4_DMA1_LLP2_LLP16                       (*((volatile unsigned int*)(0x42A61B48UL)))
#define bM4_DMA1_LLP2_LLP17                       (*((volatile unsigned int*)(0x42A61B4CUL)))
#define bM4_DMA1_LLP2_LLP18                       (*((volatile unsigned int*)(0x42A61B50UL)))
#define bM4_DMA1_LLP2_LLP19                       (*((volatile unsigned int*)(0x42A61B54UL)))
#define bM4_DMA1_LLP2_LLP20                       (*((volatile unsigned int*)(0x42A61B58UL)))
#define bM4_DMA1_LLP2_LLP21                       (*((volatile unsigned int*)(0x42A61B5CUL)))
#define bM4_DMA1_LLP2_LLP22                       (*((volatile unsigned int*)(0x42A61B60UL)))
#define bM4_DMA1_LLP2_LLP23                       (*((volatile unsigned int*)(0x42A61B64UL)))
#define bM4_DMA1_LLP2_LLP24                       (*((volatile unsigned int*)(0x42A61B68UL)))
#define bM4_DMA1_LLP2_LLP25                       (*((volatile unsigned int*)(0x42A61B6CUL)))
#define bM4_DMA1_LLP2_LLP26                       (*((volatile unsigned int*)(0x42A61B70UL)))
#define bM4_DMA1_LLP2_LLP27                       (*((volatile unsigned int*)(0x42A61B74UL)))
#define bM4_DMA1_LLP2_LLP28                       (*((volatile unsigned int*)(0x42A61B78UL)))
#define bM4_DMA1_LLP2_LLP29                       (*((volatile unsigned int*)(0x42A61B7CUL)))
#define bM4_DMA1_CH2CTL_SINC0                     (*((volatile unsigned int*)(0x42A61B80UL)))
#define bM4_DMA1_CH2CTL_SINC1                     (*((volatile unsigned int*)(0x42A61B84UL)))
#define bM4_DMA1_CH2CTL_DINC0                     (*((volatile unsigned int*)(0x42A61B88UL)))
#define bM4_DMA1_CH2CTL_DINC1                     (*((volatile unsigned int*)(0x42A61B8CUL)))
#define bM4_DMA1_CH2CTL_SRTPEN                    (*((volatile unsigned int*)(0x42A61B90UL)))
#define bM4_DMA1_CH2CTL_DRPTEN                    (*((volatile unsigned int*)(0x42A61B94UL)))
#define bM4_DMA1_CH2CTL_SNSEQEN                   (*((volatile unsigned int*)(0x42A61B98UL)))
#define bM4_DMA1_CH2CTL_DNSEQEN                   (*((volatile unsigned int*)(0x42A61B9CUL)))
#define bM4_DMA1_CH2CTL_HSIZE0                    (*((volatile unsigned int*)(0x42A61BA0UL)))
#define bM4_DMA1_CH2CTL_HSIZE1                    (*((volatile unsigned int*)(0x42A61BA4UL)))
#define bM4_DMA1_CH2CTL_LLPEN                     (*((volatile unsigned int*)(0x42A61BA8UL)))
#define bM4_DMA1_CH2CTL_LLPRUN                    (*((volatile unsigned int*)(0x42A61BACUL)))
#define bM4_DMA1_CH2CTL_IE                        (*((volatile unsigned int*)(0x42A61BB0UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE0               (*((volatile unsigned int*)(0x42A61D00UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE1               (*((volatile unsigned int*)(0x42A61D04UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE2               (*((volatile unsigned int*)(0x42A61D08UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE3               (*((volatile unsigned int*)(0x42A61D0CUL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE4               (*((volatile unsigned int*)(0x42A61D10UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE5               (*((volatile unsigned int*)(0x42A61D14UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE6               (*((volatile unsigned int*)(0x42A61D18UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE7               (*((volatile unsigned int*)(0x42A61D1CUL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE8               (*((volatile unsigned int*)(0x42A61D20UL)))
#define bM4_DMA1_MONDTCTL2_BLKSIZE9               (*((volatile unsigned int*)(0x42A61D24UL)))
#define bM4_DMA1_MONDTCTL2_CNT0                   (*((volatile unsigned int*)(0x42A61D40UL)))
#define bM4_DMA1_MONDTCTL2_CNT1                   (*((volatile unsigned int*)(0x42A61D44UL)))
#define bM4_DMA1_MONDTCTL2_CNT2                   (*((volatile unsigned int*)(0x42A61D48UL)))
#define bM4_DMA1_MONDTCTL2_CNT3                   (*((volatile unsigned int*)(0x42A61D4CUL)))
#define bM4_DMA1_MONDTCTL2_CNT4                   (*((volatile unsigned int*)(0x42A61D50UL)))
#define bM4_DMA1_MONDTCTL2_CNT5                   (*((volatile unsigned int*)(0x42A61D54UL)))
#define bM4_DMA1_MONDTCTL2_CNT6                   (*((volatile unsigned int*)(0x42A61D58UL)))
#define bM4_DMA1_MONDTCTL2_CNT7                   (*((volatile unsigned int*)(0x42A61D5CUL)))
#define bM4_DMA1_MONDTCTL2_CNT8                   (*((volatile unsigned int*)(0x42A61D60UL)))
#define bM4_DMA1_MONDTCTL2_CNT9                   (*((volatile unsigned int*)(0x42A61D64UL)))
#define bM4_DMA1_MONDTCTL2_CNT10                  (*((volatile unsigned int*)(0x42A61D68UL)))
#define bM4_DMA1_MONDTCTL2_CNT11                  (*((volatile unsigned int*)(0x42A61D6CUL)))
#define bM4_DMA1_MONDTCTL2_CNT12                  (*((volatile unsigned int*)(0x42A61D70UL)))
#define bM4_DMA1_MONDTCTL2_CNT13                  (*((volatile unsigned int*)(0x42A61D74UL)))
#define bM4_DMA1_MONDTCTL2_CNT14                  (*((volatile unsigned int*)(0x42A61D78UL)))
#define bM4_DMA1_MONDTCTL2_CNT15                  (*((volatile unsigned int*)(0x42A61D7CUL)))
#define bM4_DMA1_MONRPT2_SRPT0                    (*((volatile unsigned int*)(0x42A61D80UL)))
#define bM4_DMA1_MONRPT2_SRPT1                    (*((volatile unsigned int*)(0x42A61D84UL)))
#define bM4_DMA1_MONRPT2_SRPT2                    (*((volatile unsigned int*)(0x42A61D88UL)))
#define bM4_DMA1_MONRPT2_SRPT3                    (*((volatile unsigned int*)(0x42A61D8CUL)))
#define bM4_DMA1_MONRPT2_SRPT4                    (*((volatile unsigned int*)(0x42A61D90UL)))
#define bM4_DMA1_MONRPT2_SRPT5                    (*((volatile unsigned int*)(0x42A61D94UL)))
#define bM4_DMA1_MONRPT2_SRPT6                    (*((volatile unsigned int*)(0x42A61D98UL)))
#define bM4_DMA1_MONRPT2_SRPT7                    (*((volatile unsigned int*)(0x42A61D9CUL)))
#define bM4_DMA1_MONRPT2_SRPT8                    (*((volatile unsigned int*)(0x42A61DA0UL)))
#define bM4_DMA1_MONRPT2_SRPT9                    (*((volatile unsigned int*)(0x42A61DA4UL)))
#define bM4_DMA1_MONRPT2_DRPT0                    (*((volatile unsigned int*)(0x42A61DC0UL)))
#define bM4_DMA1_MONRPT2_DRPT1                    (*((volatile unsigned int*)(0x42A61DC4UL)))
#define bM4_DMA1_MONRPT2_DRPT2                    (*((volatile unsigned int*)(0x42A61DC8UL)))
#define bM4_DMA1_MONRPT2_DRPT3                    (*((volatile unsigned int*)(0x42A61DCCUL)))
#define bM4_DMA1_MONRPT2_DRPT4                    (*((volatile unsigned int*)(0x42A61DD0UL)))
#define bM4_DMA1_MONRPT2_DRPT5                    (*((volatile unsigned int*)(0x42A61DD4UL)))
#define bM4_DMA1_MONRPT2_DRPT6                    (*((volatile unsigned int*)(0x42A61DD8UL)))
#define bM4_DMA1_MONRPT2_DRPT7                    (*((volatile unsigned int*)(0x42A61DDCUL)))
#define bM4_DMA1_MONRPT2_DRPT8                    (*((volatile unsigned int*)(0x42A61DE0UL)))
#define bM4_DMA1_MONRPT2_DRPT9                    (*((volatile unsigned int*)(0x42A61DE4UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET0            (*((volatile unsigned int*)(0x42A61E00UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET1            (*((volatile unsigned int*)(0x42A61E04UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET2            (*((volatile unsigned int*)(0x42A61E08UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET3            (*((volatile unsigned int*)(0x42A61E0CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET4            (*((volatile unsigned int*)(0x42A61E10UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET5            (*((volatile unsigned int*)(0x42A61E14UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET6            (*((volatile unsigned int*)(0x42A61E18UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET7            (*((volatile unsigned int*)(0x42A61E1CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET8            (*((volatile unsigned int*)(0x42A61E20UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET9            (*((volatile unsigned int*)(0x42A61E24UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET10           (*((volatile unsigned int*)(0x42A61E28UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET11           (*((volatile unsigned int*)(0x42A61E2CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET12           (*((volatile unsigned int*)(0x42A61E30UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET13           (*((volatile unsigned int*)(0x42A61E34UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET14           (*((volatile unsigned int*)(0x42A61E38UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET15           (*((volatile unsigned int*)(0x42A61E3CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET16           (*((volatile unsigned int*)(0x42A61E40UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET17           (*((volatile unsigned int*)(0x42A61E44UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET18           (*((volatile unsigned int*)(0x42A61E48UL)))
#define bM4_DMA1_MONSNSEQCTL2_SOFFSET19           (*((volatile unsigned int*)(0x42A61E4CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT0             (*((volatile unsigned int*)(0x42A61E50UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT1             (*((volatile unsigned int*)(0x42A61E54UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT2             (*((volatile unsigned int*)(0x42A61E58UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT3             (*((volatile unsigned int*)(0x42A61E5CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT4             (*((volatile unsigned int*)(0x42A61E60UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT5             (*((volatile unsigned int*)(0x42A61E64UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT6             (*((volatile unsigned int*)(0x42A61E68UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT7             (*((volatile unsigned int*)(0x42A61E6CUL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT8             (*((volatile unsigned int*)(0x42A61E70UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT9             (*((volatile unsigned int*)(0x42A61E74UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT10            (*((volatile unsigned int*)(0x42A61E78UL)))
#define bM4_DMA1_MONSNSEQCTL2_SNSCNT11            (*((volatile unsigned int*)(0x42A61E7CUL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET0            (*((volatile unsigned int*)(0x42A61E80UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET1            (*((volatile unsigned int*)(0x42A61E84UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET2            (*((volatile unsigned int*)(0x42A61E88UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET3            (*((volatile unsigned int*)(0x42A61E8CUL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET4            (*((volatile unsigned int*)(0x42A61E90UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET5            (*((volatile unsigned int*)(0x42A61E94UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET6            (*((volatile unsigned int*)(0x42A61E98UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET7            (*((volatile unsigned int*)(0x42A61E9CUL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET8            (*((volatile unsigned int*)(0x42A61EA0UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET9            (*((volatile unsigned int*)(0x42A61EA4UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET10           (*((volatile unsigned int*)(0x42A61EA8UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET11           (*((volatile unsigned int*)(0x42A61EACUL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET12           (*((volatile unsigned int*)(0x42A61EB0UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET13           (*((volatile unsigned int*)(0x42A61EB4UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET14           (*((volatile unsigned int*)(0x42A61EB8UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET15           (*((volatile unsigned int*)(0x42A61EBCUL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET16           (*((volatile unsigned int*)(0x42A61EC0UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET17           (*((volatile unsigned int*)(0x42A61EC4UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET18           (*((volatile unsigned int*)(0x42A61EC8UL)))
#define bM4_DMA1_MONDNSEQCTL2_DOFFSET19           (*((volatile unsigned int*)(0x42A61ECCUL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT0             (*((volatile unsigned int*)(0x42A61ED0UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT1             (*((volatile unsigned int*)(0x42A61ED4UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT2             (*((volatile unsigned int*)(0x42A61ED8UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT3             (*((volatile unsigned int*)(0x42A61EDCUL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT4             (*((volatile unsigned int*)(0x42A61EE0UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT5             (*((volatile unsigned int*)(0x42A61EE4UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT6             (*((volatile unsigned int*)(0x42A61EE8UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT7             (*((volatile unsigned int*)(0x42A61EECUL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT8             (*((volatile unsigned int*)(0x42A61EF0UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT9             (*((volatile unsigned int*)(0x42A61EF4UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT10            (*((volatile unsigned int*)(0x42A61EF8UL)))
#define bM4_DMA1_MONDNSEQCTL2_DNSCNT11            (*((volatile unsigned int*)(0x42A61EFCUL)))
#define bM4_DMA1_DTCTL3_BLKSIZE0                  (*((volatile unsigned int*)(0x42A62100UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE1                  (*((volatile unsigned int*)(0x42A62104UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE2                  (*((volatile unsigned int*)(0x42A62108UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE3                  (*((volatile unsigned int*)(0x42A6210CUL)))
#define bM4_DMA1_DTCTL3_BLKSIZE4                  (*((volatile unsigned int*)(0x42A62110UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE5                  (*((volatile unsigned int*)(0x42A62114UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE6                  (*((volatile unsigned int*)(0x42A62118UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE7                  (*((volatile unsigned int*)(0x42A6211CUL)))
#define bM4_DMA1_DTCTL3_BLKSIZE8                  (*((volatile unsigned int*)(0x42A62120UL)))
#define bM4_DMA1_DTCTL3_BLKSIZE9                  (*((volatile unsigned int*)(0x42A62124UL)))
#define bM4_DMA1_DTCTL3_CNT0                      (*((volatile unsigned int*)(0x42A62140UL)))
#define bM4_DMA1_DTCTL3_CNT1                      (*((volatile unsigned int*)(0x42A62144UL)))
#define bM4_DMA1_DTCTL3_CNT2                      (*((volatile unsigned int*)(0x42A62148UL)))
#define bM4_DMA1_DTCTL3_CNT3                      (*((volatile unsigned int*)(0x42A6214CUL)))
#define bM4_DMA1_DTCTL3_CNT4                      (*((volatile unsigned int*)(0x42A62150UL)))
#define bM4_DMA1_DTCTL3_CNT5                      (*((volatile unsigned int*)(0x42A62154UL)))
#define bM4_DMA1_DTCTL3_CNT6                      (*((volatile unsigned int*)(0x42A62158UL)))
#define bM4_DMA1_DTCTL3_CNT7                      (*((volatile unsigned int*)(0x42A6215CUL)))
#define bM4_DMA1_DTCTL3_CNT8                      (*((volatile unsigned int*)(0x42A62160UL)))
#define bM4_DMA1_DTCTL3_CNT9                      (*((volatile unsigned int*)(0x42A62164UL)))
#define bM4_DMA1_DTCTL3_CNT10                     (*((volatile unsigned int*)(0x42A62168UL)))
#define bM4_DMA1_DTCTL3_CNT11                     (*((volatile unsigned int*)(0x42A6216CUL)))
#define bM4_DMA1_DTCTL3_CNT12                     (*((volatile unsigned int*)(0x42A62170UL)))
#define bM4_DMA1_DTCTL3_CNT13                     (*((volatile unsigned int*)(0x42A62174UL)))
