patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_DMA1_DTCTL3_CNT14                     (*((volatile unsigned int*)(0x42A62178UL)))
#define bM4_DMA1_DTCTL3_CNT15                     (*((volatile unsigned int*)(0x42A6217CUL)))
#define bM4_DMA1_RPT3_SRPT0                       (*((volatile unsigned int*)(0x42A62180UL)))
#define bM4_DMA1_RPT3_SRPT1                       (*((volatile unsigned int*)(0x42A62184UL)))
#define bM4_DMA1_RPT3_SRPT2                       (*((volatile unsigned int*)(0x42A62188UL)))
#define bM4_DMA1_RPT3_SRPT3                       (*((volatile unsigned int*)(0x42A6218CUL)))
#define bM4_DMA1_RPT3_SRPT4                       (*((volatile unsigned int*)(0x42A62190UL)))
#define bM4_DMA1_RPT3_SRPT5                       (*((volatile unsigned int*)(0x42A62194UL)))
#define bM4_DMA1_RPT3_SRPT6                       (*((volatile unsigned int*)(0x42A62198UL)))
#define bM4_DMA1_RPT3_SRPT7                       (*((volatile unsigned int*)(0x42A6219CUL)))
#define bM4_DMA1_RPT3_SRPT8                       (*((volatile unsigned int*)(0x42A621A0UL)))
#define bM4_DMA1_RPT3_SRPT9                       (*((volatile unsigned int*)(0x42A621A4UL)))
#define bM4_DMA1_RPT3_DRPT0                       (*((volatile unsigned int*)(0x42A621C0UL)))
#define bM4_DMA1_RPT3_DRPT1                       (*((volatile unsigned int*)(0x42A621C4UL)))
#define bM4_DMA1_RPT3_DRPT2                       (*((volatile unsigned int*)(0x42A621C8UL)))
#define bM4_DMA1_RPT3_DRPT3                       (*((volatile unsigned int*)(0x42A621CCUL)))
#define bM4_DMA1_RPT3_DRPT4                       (*((volatile unsigned int*)(0x42A621D0UL)))
#define bM4_DMA1_RPT3_DRPT5                       (*((volatile unsigned int*)(0x42A621D4UL)))
#define bM4_DMA1_RPT3_DRPT6                       (*((volatile unsigned int*)(0x42A621D8UL)))
#define bM4_DMA1_RPT3_DRPT7                       (*((volatile unsigned int*)(0x42A621DCUL)))
#define bM4_DMA1_RPT3_DRPT8                       (*((volatile unsigned int*)(0x42A621E0UL)))
#define bM4_DMA1_RPT3_DRPT9                       (*((volatile unsigned int*)(0x42A621E4UL)))
#define bM4_DMA1_RPTB3_SRPTB0                     (*((volatile unsigned int*)(0x42A62180UL)))
#define bM4_DMA1_RPTB3_SRPTB1                     (*((volatile unsigned int*)(0x42A62184UL)))
#define bM4_DMA1_RPTB3_SRPTB2                     (*((volatile unsigned int*)(0x42A62188UL)))
#define bM4_DMA1_RPTB3_SRPTB3                     (*((volatile unsigned int*)(0x42A6218CUL)))
#define bM4_DMA1_RPTB3_SRPTB4                     (*((volatile unsigned int*)(0x42A62190UL)))
#define bM4_DMA1_RPTB3_SRPTB5                     (*((volatile unsigned int*)(0x42A62194UL)))
#define bM4_DMA1_RPTB3_SRPTB6                     (*((volatile unsigned int*)(0x42A62198UL)))
#define bM4_DMA1_RPTB3_SRPTB7                     (*((volatile unsigned int*)(0x42A6219CUL)))
#define bM4_DMA1_RPTB3_SRPTB8                     (*((volatile unsigned int*)(0x42A621A0UL)))
#define bM4_DMA1_RPTB3_SRPTB9                     (*((volatile unsigned int*)(0x42A621A4UL)))
#define bM4_DMA1_RPTB3_DRPTB0                     (*((volatile unsigned int*)(0x42A621C0UL)))
#define bM4_DMA1_RPTB3_DRPTB1                     (*((volatile unsigned int*)(0x42A621C4UL)))
#define bM4_DMA1_RPTB3_DRPTB2                     (*((volatile unsigned int*)(0x42A621C8UL)))
#define bM4_DMA1_RPTB3_DRPTB3                     (*((volatile unsigned int*)(0x42A621CCUL)))
#define bM4_DMA1_RPTB3_DRPTB4                     (*((volatile unsigned int*)(0x42A621D0UL)))
#define bM4_DMA1_RPTB3_DRPTB5                     (*((volatile unsigned int*)(0x42A621D4UL)))
#define bM4_DMA1_RPTB3_DRPTB6                     (*((volatile unsigned int*)(0x42A621D8UL)))
#define bM4_DMA1_RPTB3_DRPTB7                     (*((volatile unsigned int*)(0x42A621DCUL)))
#define bM4_DMA1_RPTB3_DRPTB8                     (*((volatile unsigned int*)(0x42A621E0UL)))
#define bM4_DMA1_RPTB3_DRPTB9                     (*((volatile unsigned int*)(0x42A621E4UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET0               (*((volatile unsigned int*)(0x42A62200UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET1               (*((volatile unsigned int*)(0x42A62204UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET2               (*((volatile unsigned int*)(0x42A62208UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET3               (*((volatile unsigned int*)(0x42A6220CUL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET4               (*((volatile unsigned int*)(0x42A62210UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET5               (*((volatile unsigned int*)(0x42A62214UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET6               (*((volatile unsigned int*)(0x42A62218UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET7               (*((volatile unsigned int*)(0x42A6221CUL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET8               (*((volatile unsigned int*)(0x42A62220UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET9               (*((volatile unsigned int*)(0x42A62224UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET10              (*((volatile unsigned int*)(0x42A62228UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET11              (*((volatile unsigned int*)(0x42A6222CUL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET12              (*((volatile unsigned int*)(0x42A62230UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET13              (*((volatile unsigned int*)(0x42A62234UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET14              (*((volatile unsigned int*)(0x42A62238UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET15              (*((volatile unsigned int*)(0x42A6223CUL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET16              (*((volatile unsigned int*)(0x42A62240UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET17              (*((volatile unsigned int*)(0x42A62244UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET18              (*((volatile unsigned int*)(0x42A62248UL)))
#define bM4_DMA1_SNSEQCTL3_SOFFSET19              (*((volatile unsigned int*)(0x42A6224CUL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT0                (*((volatile unsigned int*)(0x42A62250UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT1                (*((volatile unsigned int*)(0x42A62254UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT2                (*((volatile unsigned int*)(0x42A62258UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT3                (*((volatile unsigned int*)(0x42A6225CUL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT4                (*((volatile unsigned int*)(0x42A62260UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT5                (*((volatile unsigned int*)(0x42A62264UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT6                (*((volatile unsigned int*)(0x42A62268UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT7                (*((volatile unsigned int*)(0x42A6226CUL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT8                (*((volatile unsigned int*)(0x42A62270UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT9                (*((volatile unsigned int*)(0x42A62274UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT10               (*((volatile unsigned int*)(0x42A62278UL)))
#define bM4_DMA1_SNSEQCTL3_SNSCNT11               (*((volatile unsigned int*)(0x42A6227CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST0              (*((volatile unsigned int*)(0x42A62200UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST1              (*((volatile unsigned int*)(0x42A62204UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST2              (*((volatile unsigned int*)(0x42A62208UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST3              (*((volatile unsigned int*)(0x42A6220CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST4              (*((volatile unsigned int*)(0x42A62210UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST5              (*((volatile unsigned int*)(0x42A62214UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST6              (*((volatile unsigned int*)(0x42A62218UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST7              (*((volatile unsigned int*)(0x42A6221CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST8              (*((volatile unsigned int*)(0x42A62220UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST9              (*((volatile unsigned int*)(0x42A62224UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST10             (*((volatile unsigned int*)(0x42A62228UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST11             (*((volatile unsigned int*)(0x42A6222CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST12             (*((volatile unsigned int*)(0x42A62230UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST13             (*((volatile unsigned int*)(0x42A62234UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST14             (*((volatile unsigned int*)(0x42A62238UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST15             (*((volatile unsigned int*)(0x42A6223CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST16             (*((volatile unsigned int*)(0x42A62240UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST17             (*((volatile unsigned int*)(0x42A62244UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST18             (*((volatile unsigned int*)(0x42A62248UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSDIST19             (*((volatile unsigned int*)(0x42A6224CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB0              (*((volatile unsigned int*)(0x42A62250UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB1              (*((volatile unsigned int*)(0x42A62254UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB2              (*((volatile unsigned int*)(0x42A62258UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB3              (*((volatile unsigned int*)(0x42A6225CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB4              (*((volatile unsigned int*)(0x42A62260UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB5              (*((volatile unsigned int*)(0x42A62264UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB6              (*((volatile unsigned int*)(0x42A62268UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB7              (*((volatile unsigned int*)(0x42A6226CUL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB8              (*((volatile unsigned int*)(0x42A62270UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB9              (*((volatile unsigned int*)(0x42A62274UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB10             (*((volatile unsigned int*)(0x42A62278UL)))
#define bM4_DMA1_SNSEQCTLB3_SNSCNTB11             (*((volatile unsigned int*)(0x42A6227CUL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET0               (*((volatile unsigned int*)(0x42A62280UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET1               (*((volatile unsigned int*)(0x42A62284UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET2               (*((volatile unsigned int*)(0x42A62288UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET3               (*((volatile unsigned int*)(0x42A6228CUL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET4               (*((volatile unsigned int*)(0x42A62290UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET5               (*((volatile unsigned int*)(0x42A62294UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET6               (*((volatile unsigned int*)(0x42A62298UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET7               (*((volatile unsigned int*)(0x42A6229CUL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET8               (*((volatile unsigned int*)(0x42A622A0UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET9               (*((volatile unsigned int*)(0x42A622A4UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET10              (*((volatile unsigned int*)(0x42A622A8UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET11              (*((volatile unsigned int*)(0x42A622ACUL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET12              (*((volatile unsigned int*)(0x42A622B0UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET13              (*((volatile unsigned int*)(0x42A622B4UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET14              (*((volatile unsigned int*)(0x42A622B8UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET15              (*((volatile unsigned int*)(0x42A622BCUL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET16              (*((volatile unsigned int*)(0x42A622C0UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET17              (*((volatile unsigned int*)(0x42A622C4UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET18              (*((volatile unsigned int*)(0x42A622C8UL)))
#define bM4_DMA1_DNSEQCTL3_DOFFSET19              (*((volatile unsigned int*)(0x42A622CCUL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT0                (*((volatile unsigned int*)(0x42A622D0UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT1                (*((volatile unsigned int*)(0x42A622D4UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT2                (*((volatile unsigned int*)(0x42A622D8UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT3                (*((volatile unsigned int*)(0x42A622DCUL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT4                (*((volatile unsigned int*)(0x42A622E0UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT5                (*((volatile unsigned int*)(0x42A622E4UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT6                (*((volatile unsigned int*)(0x42A622E8UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT7                (*((volatile unsigned int*)(0x42A622ECUL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT8                (*((volatile unsigned int*)(0x42A622F0UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT9                (*((volatile unsigned int*)(0x42A622F4UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT10               (*((volatile unsigned int*)(0x42A622F8UL)))
#define bM4_DMA1_DNSEQCTL3_DNSCNT11               (*((volatile unsigned int*)(0x42A622FCUL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST0              (*((volatile unsigned int*)(0x42A62280UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST1              (*((volatile unsigned int*)(0x42A62284UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST2              (*((volatile unsigned int*)(0x42A62288UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST3              (*((volatile unsigned int*)(0x42A6228CUL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST4              (*((volatile unsigned int*)(0x42A62290UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST5              (*((volatile unsigned int*)(0x42A62294UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST6              (*((volatile unsigned int*)(0x42A62298UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST7              (*((volatile unsigned int*)(0x42A6229CUL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST8              (*((volatile unsigned int*)(0x42A622A0UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST9              (*((volatile unsigned int*)(0x42A622A4UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST10             (*((volatile unsigned int*)(0x42A622A8UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST11             (*((volatile unsigned int*)(0x42A622ACUL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST12             (*((volatile unsigned int*)(0x42A622B0UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST13             (*((volatile unsigned int*)(0x42A622B4UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST14             (*((volatile unsigned int*)(0x42A622B8UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST15             (*((volatile unsigned int*)(0x42A622BCUL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST16             (*((volatile unsigned int*)(0x42A622C0UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST17             (*((volatile unsigned int*)(0x42A622C4UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST18             (*((volatile unsigned int*)(0x42A622C8UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSDIST19             (*((volatile unsigned int*)(0x42A622CCUL)))
#define bM4_DMA1_DNSEQCTLB3_DNSCNTB0              (*((volatile unsigned int*)(0x42A622D0UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSCNTB1              (*((volatile unsigned int*)(0x42A622D4UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSCNTB2              (*((volatile unsigned int*)(0x42A622D8UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSCNTB3              (*((volatile unsigned int*)(0x42A622DCUL)))
#define bM4_DMA1_DNSEQCTLB3_DNSCNTB4              (*((volatile unsigned int*)(0x42A622E0UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSCNTB5              (*((volatile unsigned int*)(0x42A622E4UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSCNTB6              (*((volatile unsigned int*)(0x42A622E8UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSCNTB7              (*((volatile unsigned int*)(0x42A622ECUL)))
#define bM4_DMA1_DNSEQCTLB3_DNSCNTB8              (*((volatile unsigned int*)(0x42A622F0UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSCNTB9              (*((volatile unsigned int*)(0x42A622F4UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSCNTB10             (*((volatile unsigned int*)(0x42A622F8UL)))
#define bM4_DMA1_DNSEQCTLB3_DNSCNTB11             (*((volatile unsigned int*)(0x42A622FCUL)))
#define bM4_DMA1_LLP3_LLP0                        (*((volatile unsigned int*)(0x42A62308UL)))
#define bM4_DMA1_LLP3_LLP1                        (*((volatile unsigned int*)(0x42A6230CUL)))
#define bM4_DMA1_LLP3_LLP2                        (*((volatile unsigned int*)(0x42A62310UL)))
#define bM4_DMA1_LLP3_LLP3                        (*((volatile unsigned int*)(0x42A62314UL)))
#define bM4_DMA1_LLP3_LLP4                        (*((volatile unsigned int*)(0x42A62318UL)))
#define bM4_DMA1_LLP3_LLP5                        (*((volatile unsigned int*)(0x42A6231CUL)))
#define bM4_DMA1_LLP3_LLP6                        (*((volatile unsigned int*)(0x42A62320UL)))
#define bM4_DMA1_LLP3_LLP7                        (*((volatile unsigned int*)(0x42A62324UL)))
#define bM4_DMA1_LLP3_LLP8                        (*((volatile unsigned int*)(0x42A62328UL)))
#define bM4_DMA1_LLP3_LLP9                        (*((volatile unsigned int*)(0x42A6232CUL)))
#define bM4_DMA1_LLP3_LLP10                       (*((volatile unsigned int*)(0x42A62330UL)))
#define bM4_DMA1_LLP3_LLP11                       (*((volatile unsigned int*)(0x42A62334UL)))
#define bM4_DMA1_LLP3_LLP12                       (*((volatile unsigned int*)(0x42A62338UL)))
#define bM4_DMA1_LLP3_LLP13                       (*((volatile unsigned int*)(0x42A6233CUL)))
#define bM4_DMA1_LLP3_LLP14                       (*((volatile unsigned int*)(0x42A62340UL)))
#define bM4_DMA1_LLP3_LLP15                       (*((volatile unsigned int*)(0x42A62344UL)))
#define bM4_DMA1_LLP3_LLP16                       (*((volatile unsigned int*)(0x42A62348UL)))
#define bM4_DMA1_LLP3_LLP17                       (*((volatile unsigned int*)(0x42A6234CUL)))
#define bM4_DMA1_LLP3_LLP18                       (*((volatile unsigned int*)(0x42A62350UL)))
#define bM4_DMA1_LLP3_LLP19                       (*((volatile unsigned int*)(0x42A62354UL)))
#define bM4_DMA1_LLP3_LLP20                       (*((volatile unsigned int*)(0x42A62358UL)))
#define bM4_DMA1_LLP3_LLP21                       (*((volatile unsigned int*)(0x42A6235CUL)))
#define bM4_DMA1_LLP3_LLP22                       (*((volatile unsigned int*)(0x42A62360UL)))
#define bM4_DMA1_LLP3_LLP23                       (*((volatile unsigned int*)(0x42A62364UL)))
#define bM4_DMA1_LLP3_LLP24                       (*((volatile unsigned int*)(0x42A62368UL)))
#define bM4_DMA1_LLP3_LLP25                       (*((volatile unsigned int*)(0x42A6236CUL)))
#define bM4_DMA1_LLP3_LLP26                       (*((volatile unsigned int*)(0x42A62370UL)))
#define bM4_DMA1_LLP3_LLP27                       (*((volatile unsigned int*)(0x42A62374UL)))
#define bM4_DMA1_LLP3_LLP28                       (*((volatile unsigned int*)(0x42A62378UL)))
#define bM4_DMA1_LLP3_LLP29                       (*((volatile unsigned int*)(0x42A6237CUL)))
#define bM4_DMA1_CH3CTL_SINC0                     (*((volatile unsigned int*)(0x42A62380UL)))
#define bM4_DMA1_CH3CTL_SINC1                     (*((volatile unsigned int*)(0x42A62384UL)))
#define bM4_DMA1_CH3CTL_DINC0                     (*((volatile unsigned int*)(0x42A62388UL)))
#define bM4_DMA1_CH3CTL_DINC1                     (*((volatile unsigned int*)(0x42A6238CUL)))
#define bM4_DMA1_CH3CTL_SRTPEN                    (*((volatile unsigned int*)(0x42A62390UL)))
#define bM4_DMA1_CH3CTL_DRPTEN                    (*((volatile unsigned int*)(0x42A62394UL)))
#define bM4_DMA1_CH3CTL_SNSEQEN                   (*((volatile unsigned int*)(0x42A62398UL)))
#define bM4_DMA1_CH3CTL_DNSEQEN                   (*((volatile unsigned int*)(0x42A6239CUL)))
#define bM4_DMA1_CH3CTL_HSIZE0                    (*((volatile unsigned int*)(0x42A623A0UL)))
#define bM4_DMA1_CH3CTL_HSIZE1                    (*((volatile unsigned int*)(0x42A623A4UL)))
#define bM4_DMA1_CH3CTL_LLPEN                     (*((volatile unsigned int*)(0x42A623A8UL)))
#define bM4_DMA1_CH3CTL_LLPRUN                    (*((volatile unsigned int*)(0x42A623ACUL)))
#define bM4_DMA1_CH3CTL_IE                        (*((volatile unsigned int*)(0x42A623B0UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE0               (*((volatile unsigned int*)(0x42A62500UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE1               (*((volatile unsigned int*)(0x42A62504UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE2               (*((volatile unsigned int*)(0x42A62508UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE3               (*((volatile unsigned int*)(0x42A6250CUL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE4               (*((volatile unsigned int*)(0x42A62510UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE5               (*((volatile unsigned int*)(0x42A62514UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE6               (*((volatile unsigned int*)(0x42A62518UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE7               (*((volatile unsigned int*)(0x42A6251CUL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE8               (*((volatile unsigned int*)(0x42A62520UL)))
#define bM4_DMA1_MONDTCTL3_BLKSIZE9               (*((volatile unsigned int*)(0x42A62524UL)))
#define bM4_DMA1_MONDTCTL3_CNT0                   (*((volatile unsigned int*)(0x42A62540UL)))
#define bM4_DMA1_MONDTCTL3_CNT1                   (*((volatile unsigned int*)(0x42A62544UL)))
#define bM4_DMA1_MONDTCTL3_CNT2                   (*((volatile unsigned int*)(0x42A62548UL)))
#define bM4_DMA1_MONDTCTL3_CNT3                   (*((volatile unsigned int*)(0x42A6254CUL)))
#define bM4_DMA1_MONDTCTL3_CNT4                   (*((volatile unsigned int*)(0x42A62550UL)))
#define bM4_DMA1_MONDTCTL3_CNT5                   (*((volatile unsigned int*)(0x42A62554UL)))
#define bM4_DMA1_MONDTCTL3_CNT6                   (*((volatile unsigned int*)(0x42A62558UL)))
#define bM4_DMA1_MONDTCTL3_CNT7                   (*((volatile unsigned int*)(0x42A6255CUL)))
#define bM4_DMA1_MONDTCTL3_CNT8                   (*((volatile unsigned int*)(0x42A62560UL)))
#define bM4_DMA1_MONDTCTL3_CNT9                   (*((volatile unsigned int*)(0x42A62564UL)))
#define bM4_DMA1_MONDTCTL3_CNT10                  (*((volatile unsigned int*)(0x42A62568UL)))
#define bM4_DMA1_MONDTCTL3_CNT11                  (*((volatile unsigned int*)(0x42A6256CUL)))
#define bM4_DMA1_MONDTCTL3_CNT12                  (*((volatile unsigned int*)(0x42A62570UL)))
#define bM4_DMA1_MONDTCTL3_CNT13                  (*((volatile unsigned int*)(0x42A62574UL)))
#define bM4_DMA1_MONDTCTL3_CNT14                  (*((volatile unsigned int*)(0x42A62578UL)))
#define bM4_DMA1_MONDTCTL3_CNT15                  (*((volatile unsigned int*)(0x42A6257CUL)))
#define bM4_DMA1_MONRPT3_SRPT0                    (*((volatile unsigned int*)(0x42A62580UL)))
#define bM4_DMA1_MONRPT3_SRPT1                    (*((volatile unsigned int*)(0x42A62584UL)))
#define bM4_DMA1_MONRPT3_SRPT2                    (*((volatile unsigned int*)(0x42A62588UL)))
#define bM4_DMA1_MONRPT3_SRPT3                    (*((volatile unsigned int*)(0x42A6258CUL)))
#define bM4_DMA1_MONRPT3_SRPT4                    (*((volatile unsigned int*)(0x42A62590UL)))
#define bM4_DMA1_MONRPT3_SRPT5                    (*((volatile unsigned int*)(0x42A62594UL)))
#define bM4_DMA1_MONRPT3_SRPT6                    (*((volatile unsigned int*)(0x42A62598UL)))
#define bM4_DMA1_MONRPT3_SRPT7                    (*((volatile unsigned int*)(0x42A6259CUL)))
#define bM4_DMA1_MONRPT3_SRPT8                    (*((volatile unsigned int*)(0x42A625A0UL)))
#define bM4_DMA1_MONRPT3_SRPT9                    (*((volatile unsigned int*)(0x42A625A4UL)))
#define bM4_DMA1_MONRPT3_DRPT0                    (*((volatile unsigned int*)(0x42A625C0UL)))
#define bM4_DMA1_MONRPT3_DRPT1                    (*((volatile unsigned int*)(0x42A625C4UL)))
#define bM4_DMA1_MONRPT3_DRPT2                    (*((volatile unsigned int*)(0x42A625C8UL)))
#define bM4_DMA1_MONRPT3_DRPT3                    (*((volatile unsigned int*)(0x42A625CCUL)))
#define bM4_DMA1_MONRPT3_DRPT4                    (*((volatile unsigned int*)(0x42A625D0UL)))
#define bM4_DMA1_MONRPT3_DRPT5                    (*((volatile unsigned int*)(0x42A625D4UL)))
