patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB5              (*((volatile unsigned int*)(0x42A69AE4UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB6              (*((volatile unsigned int*)(0x42A69AE8UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB7              (*((volatile unsigned int*)(0x42A69AECUL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB8              (*((volatile unsigned int*)(0x42A69AF0UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB9              (*((volatile unsigned int*)(0x42A69AF4UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB10             (*((volatile unsigned int*)(0x42A69AF8UL)))
#define bM4_DMA2_DNSEQCTLB2_DNSCNTB11             (*((volatile unsigned int*)(0x42A69AFCUL)))
#define bM4_DMA2_LLP2_LLP0                        (*((volatile unsigned int*)(0x42A69B08UL)))
#define bM4_DMA2_LLP2_LLP1                        (*((volatile unsigned int*)(0x42A69B0CUL)))
#define bM4_DMA2_LLP2_LLP2                        (*((volatile unsigned int*)(0x42A69B10UL)))
#define bM4_DMA2_LLP2_LLP3                        (*((volatile unsigned int*)(0x42A69B14UL)))
#define bM4_DMA2_LLP2_LLP4                        (*((volatile unsigned int*)(0x42A69B18UL)))
#define bM4_DMA2_LLP2_LLP5                        (*((volatile unsigned int*)(0x42A69B1CUL)))
#define bM4_DMA2_LLP2_LLP6                        (*((volatile unsigned int*)(0x42A69B20UL)))
#define bM4_DMA2_LLP2_LLP7                        (*((volatile unsigned int*)(0x42A69B24UL)))
#define bM4_DMA2_LLP2_LLP8                        (*((volatile unsigned int*)(0x42A69B28UL)))
#define bM4_DMA2_LLP2_LLP9                        (*((volatile unsigned int*)(0x42A69B2CUL)))
#define bM4_DMA2_LLP2_LLP10                       (*((volatile unsigned int*)(0x42A69B30UL)))
#define bM4_DMA2_LLP2_LLP11                       (*((volatile unsigned int*)(0x42A69B34UL)))
#define bM4_DMA2_LLP2_LLP12                       (*((volatile unsigned int*)(0x42A69B38UL)))
#define bM4_DMA2_LLP2_LLP13                       (*((volatile unsigned int*)(0x42A69B3CUL)))
#define bM4_DMA2_LLP2_LLP14                       (*((volatile unsigned int*)(0x42A69B40UL)))
#define bM4_DMA2_LLP2_LLP15                       (*((volatile unsigned int*)(0x42A69B44UL)))
#define bM4_DMA2_LLP2_LLP16                       (*((volatile unsigned int*)(0x42A69B48UL)))
#define bM4_DMA2_LLP2_LLP17                       (*((volatile unsigned int*)(0x42A69B4CUL)))
#define bM4_DMA2_LLP2_LLP18                       (*((volatile unsigned int*)(0x42A69B50UL)))
#define bM4_DMA2_LLP2_LLP19                       (*((volatile unsigned int*)(0x42A69B54UL)))
#define bM4_DMA2_LLP2_LLP20                       (*((volatile unsigned int*)(0x42A69B58UL)))
#define bM4_DMA2_LLP2_LLP21                       (*((volatile unsigned int*)(0x42A69B5CUL)))
#define bM4_DMA2_LLP2_LLP22                       (*((volatile unsigned int*)(0x42A69B60UL)))
#define bM4_DMA2_LLP2_LLP23                       (*((volatile unsigned int*)(0x42A69B64UL)))
#define bM4_DMA2_LLP2_LLP24                       (*((volatile unsigned int*)(0x42A69B68UL)))
#define bM4_DMA2_LLP2_LLP25                       (*((volatile unsigned int*)(0x42A69B6CUL)))
#define bM4_DMA2_LLP2_LLP26                       (*((volatile unsigned int*)(0x42A69B70UL)))
#define bM4_DMA2_LLP2_LLP27                       (*((volatile unsigned int*)(0x42A69B74UL)))
#define bM4_DMA2_LLP2_LLP28                       (*((volatile unsigned int*)(0x42A69B78UL)))
#define bM4_DMA2_LLP2_LLP29                       (*((volatile unsigned int*)(0x42A69B7CUL)))
#define bM4_DMA2_CH2CTL_SINC0                     (*((volatile unsigned int*)(0x42A69B80UL)))
#define bM4_DMA2_CH2CTL_SINC1                     (*((volatile unsigned int*)(0x42A69B84UL)))
#define bM4_DMA2_CH2CTL_DINC0                     (*((volatile unsigned int*)(0x42A69B88UL)))
#define bM4_DMA2_CH2CTL_DINC1                     (*((volatile unsigned int*)(0x42A69B8CUL)))
#define bM4_DMA2_CH2CTL_SRTPEN                    (*((volatile unsigned int*)(0x42A69B90UL)))
#define bM4_DMA2_CH2CTL_DRPTEN                    (*((volatile unsigned int*)(0x42A69B94UL)))
#define bM4_DMA2_CH2CTL_SNSEQEN                   (*((volatile unsigned int*)(0x42A69B98UL)))
#define bM4_DMA2_CH2CTL_DNSEQEN                   (*((volatile unsigned int*)(0x42A69B9CUL)))
#define bM4_DMA2_CH2CTL_HSIZE0                    (*((volatile unsigned int*)(0x42A69BA0UL)))
#define bM4_DMA2_CH2CTL_HSIZE1                    (*((volatile unsigned int*)(0x42A69BA4UL)))
#define bM4_DMA2_CH2CTL_LLPEN                     (*((volatile unsigned int*)(0x42A69BA8UL)))
#define bM4_DMA2_CH2CTL_LLPRUN                    (*((volatile unsigned int*)(0x42A69BACUL)))
#define bM4_DMA2_CH2CTL_IE                        (*((volatile unsigned int*)(0x42A69BB0UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE0               (*((volatile unsigned int*)(0x42A69D00UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE1               (*((volatile unsigned int*)(0x42A69D04UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE2               (*((volatile unsigned int*)(0x42A69D08UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE3               (*((volatile unsigned int*)(0x42A69D0CUL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE4               (*((volatile unsigned int*)(0x42A69D10UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE5               (*((volatile unsigned int*)(0x42A69D14UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE6               (*((volatile unsigned int*)(0x42A69D18UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE7               (*((volatile unsigned int*)(0x42A69D1CUL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE8               (*((volatile unsigned int*)(0x42A69D20UL)))
#define bM4_DMA2_MONDTCTL2_BLKSIZE9               (*((volatile unsigned int*)(0x42A69D24UL)))
#define bM4_DMA2_MONDTCTL2_CNT0                   (*((volatile unsigned int*)(0x42A69D40UL)))
#define bM4_DMA2_MONDTCTL2_CNT1                   (*((volatile unsigned int*)(0x42A69D44UL)))
#define bM4_DMA2_MONDTCTL2_CNT2                   (*((volatile unsigned int*)(0x42A69D48UL)))
#define bM4_DMA2_MONDTCTL2_CNT3                   (*((volatile unsigned int*)(0x42A69D4CUL)))
#define bM4_DMA2_MONDTCTL2_CNT4                   (*((volatile unsigned int*)(0x42A69D50UL)))
#define bM4_DMA2_MONDTCTL2_CNT5                   (*((volatile unsigned int*)(0x42A69D54UL)))
#define bM4_DMA2_MONDTCTL2_CNT6                   (*((volatile unsigned int*)(0x42A69D58UL)))
#define bM4_DMA2_MONDTCTL2_CNT7                   (*((volatile unsigned int*)(0x42A69D5CUL)))
#define bM4_DMA2_MONDTCTL2_CNT8                   (*((volatile unsigned int*)(0x42A69D60UL)))
#define bM4_DMA2_MONDTCTL2_CNT9                   (*((volatile unsigned int*)(0x42A69D64UL)))
#define bM4_DMA2_MONDTCTL2_CNT10                  (*((volatile unsigned int*)(0x42A69D68UL)))
#define bM4_DMA2_MONDTCTL2_CNT11                  (*((volatile unsigned int*)(0x42A69D6CUL)))
#define bM4_DMA2_MONDTCTL2_CNT12                  (*((volatile unsigned int*)(0x42A69D70UL)))
#define bM4_DMA2_MONDTCTL2_CNT13                  (*((volatile unsigned int*)(0x42A69D74UL)))
#define bM4_DMA2_MONDTCTL2_CNT14                  (*((volatile unsigned int*)(0x42A69D78UL)))
#define bM4_DMA2_MONDTCTL2_CNT15                  (*((volatile unsigned int*)(0x42A69D7CUL)))
#define bM4_DMA2_MONRPT2_SRPT0                    (*((volatile unsigned int*)(0x42A69D80UL)))
#define bM4_DMA2_MONRPT2_SRPT1                    (*((volatile unsigned int*)(0x42A69D84UL)))
#define bM4_DMA2_MONRPT2_SRPT2                    (*((volatile unsigned int*)(0x42A69D88UL)))
#define bM4_DMA2_MONRPT2_SRPT3                    (*((volatile unsigned int*)(0x42A69D8CUL)))
#define bM4_DMA2_MONRPT2_SRPT4                    (*((volatile unsigned int*)(0x42A69D90UL)))
#define bM4_DMA2_MONRPT2_SRPT5                    (*((volatile unsigned int*)(0x42A69D94UL)))
#define bM4_DMA2_MONRPT2_SRPT6                    (*((volatile unsigned int*)(0x42A69D98UL)))
#define bM4_DMA2_MONRPT2_SRPT7                    (*((volatile unsigned int*)(0x42A69D9CUL)))
#define bM4_DMA2_MONRPT2_SRPT8                    (*((volatile unsigned int*)(0x42A69DA0UL)))
#define bM4_DMA2_MONRPT2_SRPT9                    (*((volatile unsigned int*)(0x42A69DA4UL)))
#define bM4_DMA2_MONRPT2_DRPT0                    (*((volatile unsigned int*)(0x42A69DC0UL)))
#define bM4_DMA2_MONRPT2_DRPT1                    (*((volatile unsigned int*)(0x42A69DC4UL)))
#define bM4_DMA2_MONRPT2_DRPT2                    (*((volatile unsigned int*)(0x42A69DC8UL)))
#define bM4_DMA2_MONRPT2_DRPT3                    (*((volatile unsigned int*)(0x42A69DCCUL)))
#define bM4_DMA2_MONRPT2_DRPT4                    (*((volatile unsigned int*)(0x42A69DD0UL)))
#define bM4_DMA2_MONRPT2_DRPT5                    (*((volatile unsigned int*)(0x42A69DD4UL)))
#define bM4_DMA2_MONRPT2_DRPT6                    (*((volatile unsigned int*)(0x42A69DD8UL)))
#define bM4_DMA2_MONRPT2_DRPT7                    (*((volatile unsigned int*)(0x42A69DDCUL)))
#define bM4_DMA2_MONRPT2_DRPT8                    (*((volatile unsigned int*)(0x42A69DE0UL)))
#define bM4_DMA2_MONRPT2_DRPT9                    (*((volatile unsigned int*)(0x42A69DE4UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET0            (*((volatile unsigned int*)(0x42A69E00UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET1            (*((volatile unsigned int*)(0x42A69E04UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET2            (*((volatile unsigned int*)(0x42A69E08UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET3            (*((volatile unsigned int*)(0x42A69E0CUL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET4            (*((volatile unsigned int*)(0x42A69E10UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET5            (*((volatile unsigned int*)(0x42A69E14UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET6            (*((volatile unsigned int*)(0x42A69E18UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET7            (*((volatile unsigned int*)(0x42A69E1CUL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET8            (*((volatile unsigned int*)(0x42A69E20UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET9            (*((volatile unsigned int*)(0x42A69E24UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET10           (*((volatile unsigned int*)(0x42A69E28UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET11           (*((volatile unsigned int*)(0x42A69E2CUL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET12           (*((volatile unsigned int*)(0x42A69E30UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET13           (*((volatile unsigned int*)(0x42A69E34UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET14           (*((volatile unsigned int*)(0x42A69E38UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET15           (*((volatile unsigned int*)(0x42A69E3CUL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET16           (*((volatile unsigned int*)(0x42A69E40UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET17           (*((volatile unsigned int*)(0x42A69E44UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET18           (*((volatile unsigned int*)(0x42A69E48UL)))
#define bM4_DMA2_MONSNSEQCTL2_SOFFSET19           (*((volatile unsigned int*)(0x42A69E4CUL)))
#define bM4_DMA2_MONSNSEQCTL2_SNSCNT0             (*((volatile unsigned int*)(0x42A69E50UL)))
#define bM4_DMA2_MONSNSEQCTL2_SNSCNT1             (*((volatile unsigned int*)(0x42A69E54UL)))
#define bM4_DMA2_MONSNSEQCTL2_SNSCNT2             (*((volatile unsigned int*)(0x42A69E58UL)))
#define bM4_DMA2_MONSNSEQCTL2_SNSCNT3             (*((volatile unsigned int*)(0x42A69E5CUL)))
#define bM4_DMA2_MONSNSEQCTL2_SNSCNT4             (*((volatile unsigned int*)(0x42A69E60UL)))
#define bM4_DMA2_MONSNSEQCTL2_SNSCNT5             (*((volatile unsigned int*)(0x42A69E64UL)))
#define bM4_DMA2_MONSNSEQCTL2_SNSCNT6             (*((volatile unsigned int*)(0x42A69E68UL)))
#define bM4_DMA2_MONSNSEQCTL2_SNSCNT7             (*((volatile unsigned int*)(0x42A69E6CUL)))
#define bM4_DMA2_MONSNSEQCTL2_SNSCNT8             (*((volatile unsigned int*)(0x42A69E70UL)))
#define bM4_DMA2_MONSNSEQCTL2_SNSCNT9             (*((volatile unsigned int*)(0x42A69E74UL)))
#define bM4_DMA2_MONSNSEQCTL2_SNSCNT10            (*((volatile unsigned int*)(0x42A69E78UL)))
#define bM4_DMA2_MONSNSEQCTL2_SNSCNT11            (*((volatile unsigned int*)(0x42A69E7CUL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET0            (*((volatile unsigned int*)(0x42A69E80UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET1            (*((volatile unsigned int*)(0x42A69E84UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET2            (*((volatile unsigned int*)(0x42A69E88UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET3            (*((volatile unsigned int*)(0x42A69E8CUL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET4            (*((volatile unsigned int*)(0x42A69E90UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET5            (*((volatile unsigned int*)(0x42A69E94UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET6            (*((volatile unsigned int*)(0x42A69E98UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET7            (*((volatile unsigned int*)(0x42A69E9CUL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET8            (*((volatile unsigned int*)(0x42A69EA0UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET9            (*((volatile unsigned int*)(0x42A69EA4UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET10           (*((volatile unsigned int*)(0x42A69EA8UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET11           (*((volatile unsigned int*)(0x42A69EACUL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET12           (*((volatile unsigned int*)(0x42A69EB0UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET13           (*((volatile unsigned int*)(0x42A69EB4UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET14           (*((volatile unsigned int*)(0x42A69EB8UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET15           (*((volatile unsigned int*)(0x42A69EBCUL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET16           (*((volatile unsigned int*)(0x42A69EC0UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET17           (*((volatile unsigned int*)(0x42A69EC4UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET18           (*((volatile unsigned int*)(0x42A69EC8UL)))
#define bM4_DMA2_MONDNSEQCTL2_DOFFSET19           (*((volatile unsigned int*)(0x42A69ECCUL)))
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT0             (*((volatile unsigned int*)(0x42A69ED0UL)))
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT1             (*((volatile unsigned int*)(0x42A69ED4UL)))
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT2             (*((volatile unsigned int*)(0x42A69ED8UL)))
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT3             (*((volatile unsigned int*)(0x42A69EDCUL)))
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT4             (*((volatile unsigned int*)(0x42A69EE0UL)))
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT5             (*((volatile unsigned int*)(0x42A69EE4UL)))
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT6             (*((volatile unsigned int*)(0x42A69EE8UL)))
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT7             (*((volatile unsigned int*)(0x42A69EECUL)))
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT8             (*((volatile unsigned int*)(0x42A69EF0UL)))
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT9             (*((volatile unsigned int*)(0x42A69EF4UL)))
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT10            (*((volatile unsigned int*)(0x42A69EF8UL)))
#define bM4_DMA2_MONDNSEQCTL2_DNSCNT11            (*((volatile unsigned int*)(0x42A69EFCUL)))
#define bM4_DMA2_DTCTL3_BLKSIZE0                  (*((volatile unsigned int*)(0x42A6A100UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE1                  (*((volatile unsigned int*)(0x42A6A104UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE2                  (*((volatile unsigned int*)(0x42A6A108UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE3                  (*((volatile unsigned int*)(0x42A6A10CUL)))
#define bM4_DMA2_DTCTL3_BLKSIZE4                  (*((volatile unsigned int*)(0x42A6A110UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE5                  (*((volatile unsigned int*)(0x42A6A114UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE6                  (*((volatile unsigned int*)(0x42A6A118UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE7                  (*((volatile unsigned int*)(0x42A6A11CUL)))
#define bM4_DMA2_DTCTL3_BLKSIZE8                  (*((volatile unsigned int*)(0x42A6A120UL)))
#define bM4_DMA2_DTCTL3_BLKSIZE9                  (*((volatile unsigned int*)(0x42A6A124UL)))
#define bM4_DMA2_DTCTL3_CNT0                      (*((volatile unsigned int*)(0x42A6A140UL)))
#define bM4_DMA2_DTCTL3_CNT1                      (*((volatile unsigned int*)(0x42A6A144UL)))
#define bM4_DMA2_DTCTL3_CNT2                      (*((volatile unsigned int*)(0x42A6A148UL)))
#define bM4_DMA2_DTCTL3_CNT3                      (*((volatile unsigned int*)(0x42A6A14CUL)))
#define bM4_DMA2_DTCTL3_CNT4                      (*((volatile unsigned int*)(0x42A6A150UL)))
#define bM4_DMA2_DTCTL3_CNT5                      (*((volatile unsigned int*)(0x42A6A154UL)))
#define bM4_DMA2_DTCTL3_CNT6                      (*((volatile unsigned int*)(0x42A6A158UL)))
#define bM4_DMA2_DTCTL3_CNT7                      (*((volatile unsigned int*)(0x42A6A15CUL)))
#define bM4_DMA2_DTCTL3_CNT8                      (*((volatile unsigned int*)(0x42A6A160UL)))
#define bM4_DMA2_DTCTL3_CNT9                      (*((volatile unsigned int*)(0x42A6A164UL)))
#define bM4_DMA2_DTCTL3_CNT10                     (*((volatile unsigned int*)(0x42A6A168UL)))
#define bM4_DMA2_DTCTL3_CNT11                     (*((volatile unsigned int*)(0x42A6A16CUL)))
#define bM4_DMA2_DTCTL3_CNT12                     (*((volatile unsigned int*)(0x42A6A170UL)))
#define bM4_DMA2_DTCTL3_CNT13                     (*((volatile unsigned int*)(0x42A6A174UL)))
#define bM4_DMA2_DTCTL3_CNT14                     (*((volatile unsigned int*)(0x42A6A178UL)))
#define bM4_DMA2_DTCTL3_CNT15                     (*((volatile unsigned int*)(0x42A6A17CUL)))
#define bM4_DMA2_RPT3_SRPT0                       (*((volatile unsigned int*)(0x42A6A180UL)))
#define bM4_DMA2_RPT3_SRPT1                       (*((volatile unsigned int*)(0x42A6A184UL)))
#define bM4_DMA2_RPT3_SRPT2                       (*((volatile unsigned int*)(0x42A6A188UL)))
#define bM4_DMA2_RPT3_SRPT3                       (*((volatile unsigned int*)(0x42A6A18CUL)))
#define bM4_DMA2_RPT3_SRPT4                       (*((volatile unsigned int*)(0x42A6A190UL)))
#define bM4_DMA2_RPT3_SRPT5                       (*((volatile unsigned int*)(0x42A6A194UL)))
#define bM4_DMA2_RPT3_SRPT6                       (*((volatile unsigned int*)(0x42A6A198UL)))
#define bM4_DMA2_RPT3_SRPT7                       (*((volatile unsigned int*)(0x42A6A19CUL)))
#define bM4_DMA2_RPT3_SRPT8                       (*((volatile unsigned int*)(0x42A6A1A0UL)))
#define bM4_DMA2_RPT3_SRPT9                       (*((volatile unsigned int*)(0x42A6A1A4UL)))
#define bM4_DMA2_RPT3_DRPT0                       (*((volatile unsigned int*)(0x42A6A1C0UL)))
#define bM4_DMA2_RPT3_DRPT1                       (*((volatile unsigned int*)(0x42A6A1C4UL)))
#define bM4_DMA2_RPT3_DRPT2                       (*((volatile unsigned int*)(0x42A6A1C8UL)))
#define bM4_DMA2_RPT3_DRPT3                       (*((volatile unsigned int*)(0x42A6A1CCUL)))
#define bM4_DMA2_RPT3_DRPT4                       (*((volatile unsigned int*)(0x42A6A1D0UL)))
#define bM4_DMA2_RPT3_DRPT5                       (*((volatile unsigned int*)(0x42A6A1D4UL)))
#define bM4_DMA2_RPT3_DRPT6                       (*((volatile unsigned int*)(0x42A6A1D8UL)))
#define bM4_DMA2_RPT3_DRPT7                       (*((volatile unsigned int*)(0x42A6A1DCUL)))
#define bM4_DMA2_RPT3_DRPT8                       (*((volatile unsigned int*)(0x42A6A1E0UL)))
#define bM4_DMA2_RPT3_DRPT9                       (*((volatile unsigned int*)(0x42A6A1E4UL)))
#define bM4_DMA2_RPTB3_SRPTB0                     (*((volatile unsigned int*)(0x42A6A180UL)))
#define bM4_DMA2_RPTB3_SRPTB1                     (*((volatile unsigned int*)(0x42A6A184UL)))
#define bM4_DMA2_RPTB3_SRPTB2                     (*((volatile unsigned int*)(0x42A6A188UL)))
#define bM4_DMA2_RPTB3_SRPTB3                     (*((volatile unsigned int*)(0x42A6A18CUL)))
#define bM4_DMA2_RPTB3_SRPTB4                     (*((volatile unsigned int*)(0x42A6A190UL)))
#define bM4_DMA2_RPTB3_SRPTB5                     (*((volatile unsigned int*)(0x42A6A194UL)))
#define bM4_DMA2_RPTB3_SRPTB6                     (*((volatile unsigned int*)(0x42A6A198UL)))
#define bM4_DMA2_RPTB3_SRPTB7                     (*((volatile unsigned int*)(0x42A6A19CUL)))
#define bM4_DMA2_RPTB3_SRPTB8                     (*((volatile unsigned int*)(0x42A6A1A0UL)))
#define bM4_DMA2_RPTB3_SRPTB9                     (*((volatile unsigned int*)(0x42A6A1A4UL)))
#define bM4_DMA2_RPTB3_DRPTB0                     (*((volatile unsigned int*)(0x42A6A1C0UL)))
#define bM4_DMA2_RPTB3_DRPTB1                     (*((volatile unsigned int*)(0x42A6A1C4UL)))
#define bM4_DMA2_RPTB3_DRPTB2                     (*((volatile unsigned int*)(0x42A6A1C8UL)))
#define bM4_DMA2_RPTB3_DRPTB3                     (*((volatile unsigned int*)(0x42A6A1CCUL)))
#define bM4_DMA2_RPTB3_DRPTB4                     (*((volatile unsigned int*)(0x42A6A1D0UL)))
#define bM4_DMA2_RPTB3_DRPTB5                     (*((volatile unsigned int*)(0x42A6A1D4UL)))
#define bM4_DMA2_RPTB3_DRPTB6                     (*((volatile unsigned int*)(0x42A6A1D8UL)))
#define bM4_DMA2_RPTB3_DRPTB7                     (*((volatile unsigned int*)(0x42A6A1DCUL)))
#define bM4_DMA2_RPTB3_DRPTB8                     (*((volatile unsigned int*)(0x42A6A1E0UL)))
#define bM4_DMA2_RPTB3_DRPTB9                     (*((volatile unsigned int*)(0x42A6A1E4UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET0               (*((volatile unsigned int*)(0x42A6A200UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET1               (*((volatile unsigned int*)(0x42A6A204UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET2               (*((volatile unsigned int*)(0x42A6A208UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET3               (*((volatile unsigned int*)(0x42A6A20CUL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET4               (*((volatile unsigned int*)(0x42A6A210UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET5               (*((volatile unsigned int*)(0x42A6A214UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET6               (*((volatile unsigned int*)(0x42A6A218UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET7               (*((volatile unsigned int*)(0x42A6A21CUL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET8               (*((volatile unsigned int*)(0x42A6A220UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET9               (*((volatile unsigned int*)(0x42A6A224UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET10              (*((volatile unsigned int*)(0x42A6A228UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET11              (*((volatile unsigned int*)(0x42A6A22CUL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET12              (*((volatile unsigned int*)(0x42A6A230UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET13              (*((volatile unsigned int*)(0x42A6A234UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET14              (*((volatile unsigned int*)(0x42A6A238UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET15              (*((volatile unsigned int*)(0x42A6A23CUL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET16              (*((volatile unsigned int*)(0x42A6A240UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET17              (*((volatile unsigned int*)(0x42A6A244UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET18              (*((volatile unsigned int*)(0x42A6A248UL)))
#define bM4_DMA2_SNSEQCTL3_SOFFSET19              (*((volatile unsigned int*)(0x42A6A24CUL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT0                (*((volatile unsigned int*)(0x42A6A250UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT1                (*((volatile unsigned int*)(0x42A6A254UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT2                (*((volatile unsigned int*)(0x42A6A258UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT3                (*((volatile unsigned int*)(0x42A6A25CUL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT4                (*((volatile unsigned int*)(0x42A6A260UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT5                (*((volatile unsigned int*)(0x42A6A264UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT6                (*((volatile unsigned int*)(0x42A6A268UL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT7                (*((volatile unsigned int*)(0x42A6A26CUL)))
#define bM4_DMA2_SNSEQCTL3_SNSCNT8                (*((volatile unsigned int*)(0x42A6A270UL)))
