patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_EFM_FAPRT_FAPRT3                      (*((volatile unsigned int*)(0x4220800CUL)))
#define bM4_EFM_FAPRT_FAPRT4                      (*((volatile unsigned int*)(0x42208010UL)))
#define bM4_EFM_FAPRT_FAPRT5                      (*((volatile unsigned int*)(0x42208014UL)))
#define bM4_EFM_FAPRT_FAPRT6                      (*((volatile unsigned int*)(0x42208018UL)))
#define bM4_EFM_FAPRT_FAPRT7                      (*((volatile unsigned int*)(0x4220801CUL)))
#define bM4_EFM_FAPRT_FAPRT8                      (*((volatile unsigned int*)(0x42208020UL)))
#define bM4_EFM_FAPRT_FAPRT9                      (*((volatile unsigned int*)(0x42208024UL)))
#define bM4_EFM_FAPRT_FAPRT10                     (*((volatile unsigned int*)(0x42208028UL)))
#define bM4_EFM_FAPRT_FAPRT11                     (*((volatile unsigned int*)(0x4220802CUL)))
#define bM4_EFM_FAPRT_FAPRT12                     (*((volatile unsigned int*)(0x42208030UL)))
#define bM4_EFM_FAPRT_FAPRT13                     (*((volatile unsigned int*)(0x42208034UL)))
#define bM4_EFM_FAPRT_FAPRT14                     (*((volatile unsigned int*)(0x42208038UL)))
#define bM4_EFM_FAPRT_FAPRT15                     (*((volatile unsigned int*)(0x4220803CUL)))
#define bM4_EFM_FSTP_FSTP                         (*((volatile unsigned int*)(0x42208080UL)))
#define bM4_EFM_FRMC_SLPMD                        (*((volatile unsigned int*)(0x42208100UL)))
#define bM4_EFM_FRMC_FLWT0                        (*((volatile unsigned int*)(0x42208110UL)))
#define bM4_EFM_FRMC_FLWT1                        (*((volatile unsigned int*)(0x42208114UL)))
#define bM4_EFM_FRMC_FLWT2                        (*((volatile unsigned int*)(0x42208118UL)))
#define bM4_EFM_FRMC_FLWT3                        (*((volatile unsigned int*)(0x4220811CUL)))
#define bM4_EFM_FRMC_LVM                          (*((volatile unsigned int*)(0x42208120UL)))
#define bM4_EFM_FRMC_CACHE                        (*((volatile unsigned int*)(0x42208140UL)))
#define bM4_EFM_FRMC_CRST                         (*((volatile unsigned int*)(0x42208160UL)))
#define bM4_EFM_FWMC_PEMODE                       (*((volatile unsigned int*)(0x42208180UL)))
#define bM4_EFM_FWMC_PEMOD0                       (*((volatile unsigned int*)(0x42208190UL)))
#define bM4_EFM_FWMC_PEMOD1                       (*((volatile unsigned int*)(0x42208194UL)))
#define bM4_EFM_FWMC_PEMOD2                       (*((volatile unsigned int*)(0x42208198UL)))
#define bM4_EFM_FWMC_BUSHLDCTL                    (*((volatile unsigned int*)(0x422081A0UL)))
#define bM4_EFM_FSR_PEWERR                        (*((volatile unsigned int*)(0x42208200UL)))
#define bM4_EFM_FSR_PEPRTERR                      (*((volatile unsigned int*)(0x42208204UL)))
#define bM4_EFM_FSR_PGSZERR                       (*((volatile unsigned int*)(0x42208208UL)))
#define bM4_EFM_FSR_PGMISMTCH                     (*((volatile unsigned int*)(0x4220820CUL)))
#define bM4_EFM_FSR_OPTEND                        (*((volatile unsigned int*)(0x42208210UL)))
#define bM4_EFM_FSR_COLERR                        (*((volatile unsigned int*)(0x42208214UL)))
#define bM4_EFM_FSR_RDY                           (*((volatile unsigned int*)(0x42208220UL)))
#define bM4_EFM_FSCLR_PEWERRCLR                   (*((volatile unsigned int*)(0x42208280UL)))
#define bM4_EFM_FSCLR_PEPRTERRCLR                 (*((volatile unsigned int*)(0x42208284UL)))
#define bM4_EFM_FSCLR_PGSZERRCLR                  (*((volatile unsigned int*)(0x42208288UL)))
#define bM4_EFM_FSCLR_PGMISMTCHCLR                (*((volatile unsigned int*)(0x4220828CUL)))
#define bM4_EFM_FSCLR_OPTENDCLR                   (*((volatile unsigned int*)(0x42208290UL)))
#define bM4_EFM_FSCLR_COLERRCLR                   (*((volatile unsigned int*)(0x42208294UL)))
#define bM4_EFM_FITE_PEERRITE                     (*((volatile unsigned int*)(0x42208300UL)))
#define bM4_EFM_FITE_OPTENDITE                    (*((volatile unsigned int*)(0x42208304UL)))
#define bM4_EFM_FITE_COLERRITE                    (*((volatile unsigned int*)(0x42208308UL)))
#define bM4_EFM_FSWP_FSWP                         (*((volatile unsigned int*)(0x42208380UL)))
#define bM4_EFM_FPMTSW_FPMTSW0                    (*((volatile unsigned int*)(0x42208400UL)))
#define bM4_EFM_FPMTSW_FPMTSW1                    (*((volatile unsigned int*)(0x42208404UL)))
#define bM4_EFM_FPMTSW_FPMTSW2                    (*((volatile unsigned int*)(0x42208408UL)))
#define bM4_EFM_FPMTSW_FPMTSW3                    (*((volatile unsigned int*)(0x4220840CUL)))
#define bM4_EFM_FPMTSW_FPMTSW4                    (*((volatile unsigned int*)(0x42208410UL)))
#define bM4_EFM_FPMTSW_FPMTSW5                    (*((volatile unsigned int*)(0x42208414UL)))
#define bM4_EFM_FPMTSW_FPMTSW6                    (*((volatile unsigned int*)(0x42208418UL)))
#define bM4_EFM_FPMTSW_FPMTSW7                    (*((volatile unsigned int*)(0x4220841CUL)))
#define bM4_EFM_FPMTSW_FPMTSW8                    (*((volatile unsigned int*)(0x42208420UL)))
#define bM4_EFM_FPMTSW_FPMTSW9                    (*((volatile unsigned int*)(0x42208424UL)))
#define bM4_EFM_FPMTSW_FPMTSW10                   (*((volatile unsigned int*)(0x42208428UL)))
#define bM4_EFM_FPMTSW_FPMTSW11                   (*((volatile unsigned int*)(0x4220842CUL)))
#define bM4_EFM_FPMTSW_FPMTSW12                   (*((volatile unsigned int*)(0x42208430UL)))
#define bM4_EFM_FPMTSW_FPMTSW13                   (*((volatile unsigned int*)(0x42208434UL)))
#define bM4_EFM_FPMTSW_FPMTSW14                   (*((volatile unsigned int*)(0x42208438UL)))
#define bM4_EFM_FPMTSW_FPMTSW15                   (*((volatile unsigned int*)(0x4220843CUL)))
#define bM4_EFM_FPMTSW_FPMTSW16                   (*((volatile unsigned int*)(0x42208440UL)))
#define bM4_EFM_FPMTSW_FPMTSW17                   (*((volatile unsigned int*)(0x42208444UL)))
#define bM4_EFM_FPMTSW_FPMTSW18                   (*((volatile unsigned int*)(0x42208448UL)))
#define bM4_EFM_FPMTEW_FPMTEW0                    (*((volatile unsigned int*)(0x42208480UL)))
#define bM4_EFM_FPMTEW_FPMTEW1                    (*((volatile unsigned int*)(0x42208484UL)))
#define bM4_EFM_FPMTEW_FPMTEW2                    (*((volatile unsigned int*)(0x42208488UL)))
#define bM4_EFM_FPMTEW_FPMTEW3                    (*((volatile unsigned int*)(0x4220848CUL)))
#define bM4_EFM_FPMTEW_FPMTEW4                    (*((volatile unsigned int*)(0x42208490UL)))
#define bM4_EFM_FPMTEW_FPMTEW5                    (*((volatile unsigned int*)(0x42208494UL)))
#define bM4_EFM_FPMTEW_FPMTEW6                    (*((volatile unsigned int*)(0x42208498UL)))
#define bM4_EFM_FPMTEW_FPMTEW7                    (*((volatile unsigned int*)(0x4220849CUL)))
#define bM4_EFM_FPMTEW_FPMTEW8                    (*((volatile unsigned int*)(0x422084A0UL)))
#define bM4_EFM_FPMTEW_FPMTEW9                    (*((volatile unsigned int*)(0x422084A4UL)))
#define bM4_EFM_FPMTEW_FPMTEW10                   (*((volatile unsigned int*)(0x422084A8UL)))
#define bM4_EFM_FPMTEW_FPMTEW11                   (*((volatile unsigned int*)(0x422084ACUL)))
#define bM4_EFM_FPMTEW_FPMTEW12                   (*((volatile unsigned int*)(0x422084B0UL)))
#define bM4_EFM_FPMTEW_FPMTEW13                   (*((volatile unsigned int*)(0x422084B4UL)))
#define bM4_EFM_FPMTEW_FPMTEW14                   (*((volatile unsigned int*)(0x422084B8UL)))
#define bM4_EFM_FPMTEW_FPMTEW15                   (*((volatile unsigned int*)(0x422084BCUL)))
#define bM4_EFM_FPMTEW_FPMTEW16                   (*((volatile unsigned int*)(0x422084C0UL)))
#define bM4_EFM_FPMTEW_FPMTEW17                   (*((volatile unsigned int*)(0x422084C4UL)))
#define bM4_EFM_FPMTEW_FPMTEW18                   (*((volatile unsigned int*)(0x422084C8UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT0                (*((volatile unsigned int*)(0x4220A000UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT1                (*((volatile unsigned int*)(0x4220A004UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT2                (*((volatile unsigned int*)(0x4220A008UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT3                (*((volatile unsigned int*)(0x4220A00CUL)))
#define bM4_EFM_MMF_REMPRT_REMPRT4                (*((volatile unsigned int*)(0x4220A010UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT5                (*((volatile unsigned int*)(0x4220A014UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT6                (*((volatile unsigned int*)(0x4220A018UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT7                (*((volatile unsigned int*)(0x4220A01CUL)))
#define bM4_EFM_MMF_REMPRT_REMPRT8                (*((volatile unsigned int*)(0x4220A020UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT9                (*((volatile unsigned int*)(0x4220A024UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT10               (*((volatile unsigned int*)(0x4220A028UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT11               (*((volatile unsigned int*)(0x4220A02CUL)))
#define bM4_EFM_MMF_REMPRT_REMPRT12               (*((volatile unsigned int*)(0x4220A030UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT13               (*((volatile unsigned int*)(0x4220A034UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT14               (*((volatile unsigned int*)(0x4220A038UL)))
#define bM4_EFM_MMF_REMPRT_REMPRT15               (*((volatile unsigned int*)(0x4220A03CUL)))
#define bM4_EFM_MMF_REMCR0_RM0SIZE0               (*((volatile unsigned int*)(0x4220A080UL)))
#define bM4_EFM_MMF_REMCR0_RM0SIZE1               (*((volatile unsigned int*)(0x4220A084UL)))
#define bM4_EFM_MMF_REMCR0_RM0SIZE2               (*((volatile unsigned int*)(0x4220A088UL)))
#define bM4_EFM_MMF_REMCR0_RM0SIZE3               (*((volatile unsigned int*)(0x4220A08CUL)))
#define bM4_EFM_MMF_REMCR0_RM0SIZE4               (*((volatile unsigned int*)(0x4220A090UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR0              (*((volatile unsigned int*)(0x4220A0B0UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR1              (*((volatile unsigned int*)(0x4220A0B4UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR2              (*((volatile unsigned int*)(0x4220A0B8UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR3              (*((volatile unsigned int*)(0x4220A0BCUL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR4              (*((volatile unsigned int*)(0x4220A0C0UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR5              (*((volatile unsigned int*)(0x4220A0C4UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR6              (*((volatile unsigned int*)(0x4220A0C8UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR7              (*((volatile unsigned int*)(0x4220A0CCUL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR8              (*((volatile unsigned int*)(0x4220A0D0UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR9              (*((volatile unsigned int*)(0x4220A0D4UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR10             (*((volatile unsigned int*)(0x4220A0D8UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR11             (*((volatile unsigned int*)(0x4220A0DCUL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR12             (*((volatile unsigned int*)(0x4220A0E0UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR13             (*((volatile unsigned int*)(0x4220A0E4UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR14             (*((volatile unsigned int*)(0x4220A0E8UL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR15             (*((volatile unsigned int*)(0x4220A0ECUL)))
#define bM4_EFM_MMF_REMCR0_RM0TADDR16             (*((volatile unsigned int*)(0x4220A0F0UL)))
#define bM4_EFM_MMF_REMCR0_EN0                    (*((volatile unsigned int*)(0x4220A0FCUL)))
#define bM4_EFM_MMF_REMCR1_RM1SIZE0               (*((volatile unsigned int*)(0x4220A100UL)))
#define bM4_EFM_MMF_REMCR1_RM1SIZE1               (*((volatile unsigned int*)(0x4220A104UL)))
#define bM4_EFM_MMF_REMCR1_RM1SIZE2               (*((volatile unsigned int*)(0x4220A108UL)))
#define bM4_EFM_MMF_REMCR1_RM1SIZE3               (*((volatile unsigned int*)(0x4220A10CUL)))
#define bM4_EFM_MMF_REMCR1_RM1SIZE4               (*((volatile unsigned int*)(0x4220A110UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR0              (*((volatile unsigned int*)(0x4220A130UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR1              (*((volatile unsigned int*)(0x4220A134UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR2              (*((volatile unsigned int*)(0x4220A138UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR3              (*((volatile unsigned int*)(0x4220A13CUL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR4              (*((volatile unsigned int*)(0x4220A140UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR5              (*((volatile unsigned int*)(0x4220A144UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR6              (*((volatile unsigned int*)(0x4220A148UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR7              (*((volatile unsigned int*)(0x4220A14CUL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR8              (*((volatile unsigned int*)(0x4220A150UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR9              (*((volatile unsigned int*)(0x4220A154UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR10             (*((volatile unsigned int*)(0x4220A158UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR11             (*((volatile unsigned int*)(0x4220A15CUL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR12             (*((volatile unsigned int*)(0x4220A160UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR13             (*((volatile unsigned int*)(0x4220A164UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR14             (*((volatile unsigned int*)(0x4220A168UL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR15             (*((volatile unsigned int*)(0x4220A16CUL)))
#define bM4_EFM_MMF_REMCR1_RM1TADDR16             (*((volatile unsigned int*)(0x4220A170UL)))
#define bM4_EFM_MMF_REMCR1_EN1                    (*((volatile unsigned int*)(0x4220A17CUL)))
#define bM4_EFM_EFM_FRANDS_FRANDS0                (*((volatile unsigned int*)(0x4220C084UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS1                (*((volatile unsigned int*)(0x4220C088UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS2                (*((volatile unsigned int*)(0x4220C08CUL)))
#define bM4_EFM_EFM_FRANDS_FRANDS3                (*((volatile unsigned int*)(0x4220C090UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS4                (*((volatile unsigned int*)(0x4220C094UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS5                (*((volatile unsigned int*)(0x4220C098UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS6                (*((volatile unsigned int*)(0x4220C09CUL)))
#define bM4_EFM_EFM_FRANDS_FRANDS7                (*((volatile unsigned int*)(0x4220C0A0UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS8                (*((volatile unsigned int*)(0x4220C0A4UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS9                (*((volatile unsigned int*)(0x4220C0A8UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS10               (*((volatile unsigned int*)(0x4220C0ACUL)))
#define bM4_EFM_EFM_FRANDS_FRANDS11               (*((volatile unsigned int*)(0x4220C0B0UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS12               (*((volatile unsigned int*)(0x4220C0B4UL)))
#define bM4_EFM_EFM_FRANDS_FRANDS13               (*((volatile unsigned int*)(0x4220C0B8UL)))
#define bM4_EFM_EFM_FRANDS_FRANDFG                (*((volatile unsigned int*)(0x4220C0C0UL)))
#define bM4_EMB1_CTL_PORTINEN                     (*((volatile unsigned int*)(0x422F8000UL)))
#define bM4_EMB1_CTL_CMPEN0                       (*((volatile unsigned int*)(0x422F8004UL)))
#define bM4_EMB1_CTL_CMPEN1                       (*((volatile unsigned int*)(0x422F8008UL)))
#define bM4_EMB1_CTL_CMPEN2                       (*((volatile unsigned int*)(0x422F800CUL)))
#define bM4_EMB1_CTL_OSCSTPEN                     (*((volatile unsigned int*)(0x422F8014UL)))
#define bM4_EMB1_CTL_PWMSEN0                      (*((volatile unsigned int*)(0x422F8018UL)))
#define bM4_EMB1_CTL_PWMSEN1                      (*((volatile unsigned int*)(0x422F801CUL)))
#define bM4_EMB1_CTL_PWMSEN2                      (*((volatile unsigned int*)(0x422F8020UL)))
#define bM4_EMB1_CTL_NFSEL0                       (*((volatile unsigned int*)(0x422F8070UL)))
#define bM4_EMB1_CTL_NFSEL1                       (*((volatile unsigned int*)(0x422F8074UL)))
#define bM4_EMB1_CTL_NFEN                         (*((volatile unsigned int*)(0x422F8078UL)))
#define bM4_EMB1_CTL_INVSEL                       (*((volatile unsigned int*)(0x422F807CUL)))
#define bM4_EMB1_PWMLV_PWMLV0                     (*((volatile unsigned int*)(0x422F8080UL)))
#define bM4_EMB1_PWMLV_PWMLV1                     (*((volatile unsigned int*)(0x422F8084UL)))
#define bM4_EMB1_PWMLV_PWMLV2                     (*((volatile unsigned int*)(0x422F8088UL)))
#define bM4_EMB1_SOE_SOE                          (*((volatile unsigned int*)(0x422F8100UL)))
#define bM4_EMB1_STAT_PORTINF                     (*((volatile unsigned int*)(0x422F8180UL)))
#define bM4_EMB1_STAT_PWMSF                       (*((volatile unsigned int*)(0x422F8184UL)))
#define bM4_EMB1_STAT_CMPF                        (*((volatile unsigned int*)(0x422F8188UL)))
#define bM4_EMB1_STAT_OSF                         (*((volatile unsigned int*)(0x422F818CUL)))
#define bM4_EMB1_STAT_PORTINST                    (*((volatile unsigned int*)(0x422F8190UL)))
#define bM4_EMB1_STAT_PWMST                       (*((volatile unsigned int*)(0x422F8194UL)))
#define bM4_EMB1_STATCLR_PORTINFCLR               (*((volatile unsigned int*)(0x422F8200UL)))
#define bM4_EMB1_STATCLR_PWMSFCLR                 (*((volatile unsigned int*)(0x422F8204UL)))
#define bM4_EMB1_STATCLR_CMPFCLR                  (*((volatile unsigned int*)(0x422F8208UL)))
#define bM4_EMB1_STATCLR_OSFCLR                   (*((volatile unsigned int*)(0x422F820CUL)))
#define bM4_EMB1_INTEN_PORTINTEN                  (*((volatile unsigned int*)(0x422F8280UL)))
#define bM4_EMB1_INTEN_PWMINTEN                   (*((volatile unsigned int*)(0x422F8284UL)))
#define bM4_EMB1_INTEN_CMPINTEN                   (*((volatile unsigned int*)(0x422F8288UL)))
#define bM4_EMB1_INTEN_OSINTEN                    (*((volatile unsigned int*)(0x422F828CUL)))
#define bM4_EMB2_CTL_PORTINEN                     (*((volatile unsigned int*)(0x422F8400UL)))
#define bM4_EMB2_CTL_CMPEN0                       (*((volatile unsigned int*)(0x422F8404UL)))
#define bM4_EMB2_CTL_CMPEN1                       (*((volatile unsigned int*)(0x422F8408UL)))
#define bM4_EMB2_CTL_CMPEN2                       (*((volatile unsigned int*)(0x422F840CUL)))
#define bM4_EMB2_CTL_OSCSTPEN                     (*((volatile unsigned int*)(0x422F8414UL)))
#define bM4_EMB2_CTL_PWMSEN0                      (*((volatile unsigned int*)(0x422F8418UL)))
#define bM4_EMB2_CTL_PWMSEN1                      (*((volatile unsigned int*)(0x422F841CUL)))
#define bM4_EMB2_CTL_PWMSEN2                      (*((volatile unsigned int*)(0x422F8420UL)))
#define bM4_EMB2_CTL_NFSEL0                       (*((volatile unsigned int*)(0x422F8470UL)))
#define bM4_EMB2_CTL_NFSEL1                       (*((volatile unsigned int*)(0x422F8474UL)))
#define bM4_EMB2_CTL_NFEN                         (*((volatile unsigned int*)(0x422F8478UL)))
#define bM4_EMB2_CTL_INVSEL                       (*((volatile unsigned int*)(0x422F847CUL)))
#define bM4_EMB2_PWMLV_PWMLV0                     (*((volatile unsigned int*)(0x422F8480UL)))
#define bM4_EMB2_PWMLV_PWMLV1                     (*((volatile unsigned int*)(0x422F8484UL)))
#define bM4_EMB2_PWMLV_PWMLV2                     (*((volatile unsigned int*)(0x422F8488UL)))
#define bM4_EMB2_SOE_SOE                          (*((volatile unsigned int*)(0x422F8500UL)))
#define bM4_EMB2_STAT_PORTINF                     (*((volatile unsigned int*)(0x422F8580UL)))
#define bM4_EMB2_STAT_PWMSF                       (*((volatile unsigned int*)(0x422F8584UL)))
#define bM4_EMB2_STAT_CMPF                        (*((volatile unsigned int*)(0x422F8588UL)))
#define bM4_EMB2_STAT_OSF                         (*((volatile unsigned int*)(0x422F858CUL)))
#define bM4_EMB2_STAT_PORTINST                    (*((volatile unsigned int*)(0x422F8590UL)))
#define bM4_EMB2_STAT_PWMST                       (*((volatile unsigned int*)(0x422F8594UL)))
#define bM4_EMB2_STATCLR_PORTINFCLR               (*((volatile unsigned int*)(0x422F8600UL)))
#define bM4_EMB2_STATCLR_PWMSFCLR                 (*((volatile unsigned int*)(0x422F8604UL)))
#define bM4_EMB2_STATCLR_CMPFCLR                  (*((volatile unsigned int*)(0x422F8608UL)))
#define bM4_EMB2_STATCLR_OSFCLR                   (*((volatile unsigned int*)(0x422F860CUL)))
#define bM4_EMB2_INTEN_PORTINTEN                  (*((volatile unsigned int*)(0x422F8680UL)))
#define bM4_EMB2_INTEN_PWMINTEN                   (*((volatile unsigned int*)(0x422F8684UL)))
#define bM4_EMB2_INTEN_CMPINTEN                   (*((volatile unsigned int*)(0x422F8688UL)))
#define bM4_EMB2_INTEN_OSINTEN                    (*((volatile unsigned int*)(0x422F868CUL)))
#define bM4_EMB3_CTL_PORTINEN                     (*((volatile unsigned int*)(0x422F8800UL)))
#define bM4_EMB3_CTL_CMPEN0                       (*((volatile unsigned int*)(0x422F8804UL)))
#define bM4_EMB3_CTL_CMPEN1                       (*((volatile unsigned int*)(0x422F8808UL)))
#define bM4_EMB3_CTL_CMPEN2                       (*((volatile unsigned int*)(0x422F880CUL)))
#define bM4_EMB3_CTL_OSCSTPEN                     (*((volatile unsigned int*)(0x422F8814UL)))
#define bM4_EMB3_CTL_PWMSEN0                      (*((volatile unsigned int*)(0x422F8818UL)))
#define bM4_EMB3_CTL_PWMSEN1                      (*((volatile unsigned int*)(0x422F881CUL)))
#define bM4_EMB3_CTL_PWMSEN2                      (*((volatile unsigned int*)(0x422F8820UL)))
#define bM4_EMB3_CTL_NFSEL0                       (*((volatile unsigned int*)(0x422F8870UL)))
#define bM4_EMB3_CTL_NFSEL1                       (*((volatile unsigned int*)(0x422F8874UL)))
#define bM4_EMB3_CTL_NFEN                         (*((volatile unsigned int*)(0x422F8878UL)))
#define bM4_EMB3_CTL_INVSEL                       (*((volatile unsigned int*)(0x422F887CUL)))
#define bM4_EMB3_PWMLV_PWMLV0                     (*((volatile unsigned int*)(0x422F8880UL)))
#define bM4_EMB3_PWMLV_PWMLV1                     (*((volatile unsigned int*)(0x422F8884UL)))
#define bM4_EMB3_PWMLV_PWMLV2                     (*((volatile unsigned int*)(0x422F8888UL)))
#define bM4_EMB3_SOE_SOE                          (*((volatile unsigned int*)(0x422F8900UL)))
#define bM4_EMB3_STAT_PORTINF                     (*((volatile unsigned int*)(0x422F8980UL)))
#define bM4_EMB3_STAT_PWMSF                       (*((volatile unsigned int*)(0x422F8984UL)))
#define bM4_EMB3_STAT_CMPF                        (*((volatile unsigned int*)(0x422F8988UL)))
#define bM4_EMB3_STAT_OSF                         (*((volatile unsigned int*)(0x422F898CUL)))
#define bM4_EMB3_STAT_PORTINST                    (*((volatile unsigned int*)(0x422F8990UL)))
#define bM4_EMB3_STAT_PWMST                       (*((volatile unsigned int*)(0x422F8994UL)))
#define bM4_EMB3_STATCLR_PORTINFCLR               (*((volatile unsigned int*)(0x422F8A00UL)))
#define bM4_EMB3_STATCLR_PWMSFCLR                 (*((volatile unsigned int*)(0x422F8A04UL)))
#define bM4_EMB3_STATCLR_CMPFCLR                  (*((volatile unsigned int*)(0x422F8A08UL)))
#define bM4_EMB3_STATCLR_OSFCLR                   (*((volatile unsigned int*)(0x422F8A0CUL)))
#define bM4_EMB3_INTEN_PORTINTEN                  (*((volatile unsigned int*)(0x422F8A80UL)))
#define bM4_EMB3_INTEN_PWMINTEN                   (*((volatile unsigned int*)(0x422F8A84UL)))
#define bM4_EMB3_INTEN_CMPINTEN                   (*((volatile unsigned int*)(0x422F8A88UL)))
#define bM4_EMB3_INTEN_OSINTEN                    (*((volatile unsigned int*)(0x422F8A8CUL)))
#define bM4_EMB4_CTL_PORTINEN                     (*((volatile unsigned int*)(0x422F8C00UL)))
#define bM4_EMB4_CTL_CMPEN0                       (*((volatile unsigned int*)(0x422F8C04UL)))
#define bM4_EMB4_CTL_CMPEN1                       (*((volatile unsigned int*)(0x422F8C08UL)))
#define bM4_EMB4_CTL_CMPEN2                       (*((volatile unsigned int*)(0x422F8C0CUL)))
#define bM4_EMB4_CTL_OSCSTPEN                     (*((volatile unsigned int*)(0x422F8C14UL)))
#define bM4_EMB4_CTL_PWMSEN0                      (*((volatile unsigned int*)(0x422F8C18UL)))
