patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_I2C3_CLR_TENDFCLR                     (*((volatile unsigned int*)(0x429D040CUL)))
#define bM4_I2C3_CLR_STOPFCLR                     (*((volatile unsigned int*)(0x429D0410UL)))
#define bM4_I2C3_CLR_RFULLFCLR                    (*((volatile unsigned int*)(0x429D0418UL)))
#define bM4_I2C3_CLR_TEMPTYFCLR                   (*((volatile unsigned int*)(0x429D041CUL)))
#define bM4_I2C3_CLR_ARLOFCLR                     (*((volatile unsigned int*)(0x429D0424UL)))
#define bM4_I2C3_CLR_NACKFCLR                     (*((volatile unsigned int*)(0x429D0430UL)))
#define bM4_I2C3_CLR_TMOUTFCLR                    (*((volatile unsigned int*)(0x429D0438UL)))
#define bM4_I2C3_CLR_GENCALLFCLR                  (*((volatile unsigned int*)(0x429D0450UL)))
#define bM4_I2C3_CLR_SMBDEFAULTFCLR               (*((volatile unsigned int*)(0x429D0454UL)))
#define bM4_I2C3_CLR_SMBHOSTFCLR                  (*((volatile unsigned int*)(0x429D0458UL)))
#define bM4_I2C3_CLR_SMBALRTFCLR                  (*((volatile unsigned int*)(0x429D045CUL)))
#define bM4_I2C3_DTR_DT0                          (*((volatile unsigned int*)(0x429D0480UL)))
#define bM4_I2C3_DTR_DT1                          (*((volatile unsigned int*)(0x429D0484UL)))
#define bM4_I2C3_DTR_DT2                          (*((volatile unsigned int*)(0x429D0488UL)))
#define bM4_I2C3_DTR_DT3                          (*((volatile unsigned int*)(0x429D048CUL)))
#define bM4_I2C3_DTR_DT4                          (*((volatile unsigned int*)(0x429D0490UL)))
#define bM4_I2C3_DTR_DT5                          (*((volatile unsigned int*)(0x429D0494UL)))
#define bM4_I2C3_DTR_DT6                          (*((volatile unsigned int*)(0x429D0498UL)))
#define bM4_I2C3_DTR_DT7                          (*((volatile unsigned int*)(0x429D049CUL)))
#define bM4_I2C3_DRR_DR0                          (*((volatile unsigned int*)(0x429D0500UL)))
#define bM4_I2C3_DRR_DR1                          (*((volatile unsigned int*)(0x429D0504UL)))
#define bM4_I2C3_DRR_DR2                          (*((volatile unsigned int*)(0x429D0508UL)))
#define bM4_I2C3_DRR_DR3                          (*((volatile unsigned int*)(0x429D050CUL)))
#define bM4_I2C3_DRR_DR4                          (*((volatile unsigned int*)(0x429D0510UL)))
#define bM4_I2C3_DRR_DR5                          (*((volatile unsigned int*)(0x429D0514UL)))
#define bM4_I2C3_DRR_DR6                          (*((volatile unsigned int*)(0x429D0518UL)))
#define bM4_I2C3_DRR_DR7                          (*((volatile unsigned int*)(0x429D051CUL)))
#define bM4_I2C3_CCR_SLOWW0                       (*((volatile unsigned int*)(0x429D0580UL)))
#define bM4_I2C3_CCR_SLOWW1                       (*((volatile unsigned int*)(0x429D0584UL)))
#define bM4_I2C3_CCR_SLOWW2                       (*((volatile unsigned int*)(0x429D0588UL)))
#define bM4_I2C3_CCR_SLOWW3                       (*((volatile unsigned int*)(0x429D058CUL)))
#define bM4_I2C3_CCR_SLOWW4                       (*((volatile unsigned int*)(0x429D0590UL)))
#define bM4_I2C3_CCR_SHIGHW0                      (*((volatile unsigned int*)(0x429D05A0UL)))
#define bM4_I2C3_CCR_SHIGHW1                      (*((volatile unsigned int*)(0x429D05A4UL)))
#define bM4_I2C3_CCR_SHIGHW2                      (*((volatile unsigned int*)(0x429D05A8UL)))
#define bM4_I2C3_CCR_SHIGHW3                      (*((volatile unsigned int*)(0x429D05ACUL)))
#define bM4_I2C3_CCR_SHIGHW4                      (*((volatile unsigned int*)(0x429D05B0UL)))
#define bM4_I2C3_CCR_FREQ0                        (*((volatile unsigned int*)(0x429D05C0UL)))
#define bM4_I2C3_CCR_FREQ1                        (*((volatile unsigned int*)(0x429D05C4UL)))
#define bM4_I2C3_CCR_FREQ2                        (*((volatile unsigned int*)(0x429D05C8UL)))
#define bM4_I2C3_FLTR_DNF0                        (*((volatile unsigned int*)(0x429D0600UL)))
#define bM4_I2C3_FLTR_DNF1                        (*((volatile unsigned int*)(0x429D0604UL)))
#define bM4_I2C3_FLTR_DNFEN                       (*((volatile unsigned int*)(0x429D0610UL)))
#define bM4_I2C3_FLTR_ANFEN                       (*((volatile unsigned int*)(0x429D0614UL)))
#define bM4_I2S1_CTRL_TXE                         (*((volatile unsigned int*)(0x423C0000UL)))
#define bM4_I2S1_CTRL_TXIE                        (*((volatile unsigned int*)(0x423C0004UL)))
#define bM4_I2S1_CTRL_RXE                         (*((volatile unsigned int*)(0x423C0008UL)))
#define bM4_I2S1_CTRL_RXIE                        (*((volatile unsigned int*)(0x423C000CUL)))
#define bM4_I2S1_CTRL_EIE                         (*((volatile unsigned int*)(0x423C0010UL)))
#define bM4_I2S1_CTRL_WMS                         (*((volatile unsigned int*)(0x423C0014UL)))
#define bM4_I2S1_CTRL_ODD                         (*((volatile unsigned int*)(0x423C0018UL)))
#define bM4_I2S1_CTRL_MCKOE                       (*((volatile unsigned int*)(0x423C001CUL)))
#define bM4_I2S1_CTRL_TXBIRQWL0                   (*((volatile unsigned int*)(0x423C0020UL)))
#define bM4_I2S1_CTRL_TXBIRQWL1                   (*((volatile unsigned int*)(0x423C0024UL)))
#define bM4_I2S1_CTRL_TXBIRQWL2                   (*((volatile unsigned int*)(0x423C0028UL)))
#define bM4_I2S1_CTRL_RXBIRQWL0                   (*((volatile unsigned int*)(0x423C0030UL)))
#define bM4_I2S1_CTRL_RXBIRQWL1                   (*((volatile unsigned int*)(0x423C0034UL)))
#define bM4_I2S1_CTRL_RXBIRQWL2                   (*((volatile unsigned int*)(0x423C0038UL)))
#define bM4_I2S1_CTRL_FIFOR                       (*((volatile unsigned int*)(0x423C0040UL)))
#define bM4_I2S1_CTRL_CODECRC                     (*((volatile unsigned int*)(0x423C0044UL)))
#define bM4_I2S1_CTRL_I2SPLLSEL                   (*((volatile unsigned int*)(0x423C0048UL)))
#define bM4_I2S1_CTRL_SDOE                        (*((volatile unsigned int*)(0x423C004CUL)))
#define bM4_I2S1_CTRL_LRCKOE                      (*((volatile unsigned int*)(0x423C0050UL)))
#define bM4_I2S1_CTRL_CKOE                        (*((volatile unsigned int*)(0x423C0054UL)))
#define bM4_I2S1_CTRL_DUPLEX                      (*((volatile unsigned int*)(0x423C0058UL)))
#define bM4_I2S1_CTRL_CLKSEL                      (*((volatile unsigned int*)(0x423C005CUL)))
#define bM4_I2S1_SR_TXBA                          (*((volatile unsigned int*)(0x423C0080UL)))
#define bM4_I2S1_SR_RXBA                          (*((volatile unsigned int*)(0x423C0084UL)))
#define bM4_I2S1_SR_TXBE                          (*((volatile unsigned int*)(0x423C0088UL)))
#define bM4_I2S1_SR_TXBF                          (*((volatile unsigned int*)(0x423C008CUL)))
#define bM4_I2S1_SR_RXBE                          (*((volatile unsigned int*)(0x423C0090UL)))
#define bM4_I2S1_SR_RXBF                          (*((volatile unsigned int*)(0x423C0094UL)))
#define bM4_I2S1_ER_TXERR                         (*((volatile unsigned int*)(0x423C0100UL)))
#define bM4_I2S1_ER_RXERR                         (*((volatile unsigned int*)(0x423C0104UL)))
#define bM4_I2S1_CFGR_I2SSTD0                     (*((volatile unsigned int*)(0x423C0180UL)))
#define bM4_I2S1_CFGR_I2SSTD1                     (*((volatile unsigned int*)(0x423C0184UL)))
#define bM4_I2S1_CFGR_DATLEN0                     (*((volatile unsigned int*)(0x423C0188UL)))
#define bM4_I2S1_CFGR_DATLEN1                     (*((volatile unsigned int*)(0x423C018CUL)))
#define bM4_I2S1_CFGR_CHLEN                       (*((volatile unsigned int*)(0x423C0190UL)))
#define bM4_I2S1_CFGR_PCMSYNC                     (*((volatile unsigned int*)(0x423C0194UL)))
#define bM4_I2S1_PR_I2SDIV0                       (*((volatile unsigned int*)(0x423C0300UL)))
#define bM4_I2S1_PR_I2SDIV1                       (*((volatile unsigned int*)(0x423C0304UL)))
#define bM4_I2S1_PR_I2SDIV2                       (*((volatile unsigned int*)(0x423C0308UL)))
#define bM4_I2S1_PR_I2SDIV3                       (*((volatile unsigned int*)(0x423C030CUL)))
#define bM4_I2S1_PR_I2SDIV4                       (*((volatile unsigned int*)(0x423C0310UL)))
#define bM4_I2S1_PR_I2SDIV5                       (*((volatile unsigned int*)(0x423C0314UL)))
#define bM4_I2S1_PR_I2SDIV6                       (*((volatile unsigned int*)(0x423C0318UL)))
#define bM4_I2S1_PR_I2SDIV7                       (*((volatile unsigned int*)(0x423C031CUL)))
#define bM4_I2S2_CTRL_TXE                         (*((volatile unsigned int*)(0x423C8000UL)))
#define bM4_I2S2_CTRL_TXIE                        (*((volatile unsigned int*)(0x423C8004UL)))
#define bM4_I2S2_CTRL_RXE                         (*((volatile unsigned int*)(0x423C8008UL)))
#define bM4_I2S2_CTRL_RXIE                        (*((volatile unsigned int*)(0x423C800CUL)))
#define bM4_I2S2_CTRL_EIE                         (*((volatile unsigned int*)(0x423C8010UL)))
#define bM4_I2S2_CTRL_WMS                         (*((volatile unsigned int*)(0x423C8014UL)))
#define bM4_I2S2_CTRL_ODD                         (*((volatile unsigned int*)(0x423C8018UL)))
#define bM4_I2S2_CTRL_MCKOE                       (*((volatile unsigned int*)(0x423C801CUL)))
#define bM4_I2S2_CTRL_TXBIRQWL0                   (*((volatile unsigned int*)(0x423C8020UL)))
#define bM4_I2S2_CTRL_TXBIRQWL1                   (*((volatile unsigned int*)(0x423C8024UL)))
#define bM4_I2S2_CTRL_TXBIRQWL2                   (*((volatile unsigned int*)(0x423C8028UL)))
#define bM4_I2S2_CTRL_RXBIRQWL0                   (*((volatile unsigned int*)(0x423C8030UL)))
#define bM4_I2S2_CTRL_RXBIRQWL1                   (*((volatile unsigned int*)(0x423C8034UL)))
#define bM4_I2S2_CTRL_RXBIRQWL2                   (*((volatile unsigned int*)(0x423C8038UL)))
#define bM4_I2S2_CTRL_FIFOR                       (*((volatile unsigned int*)(0x423C8040UL)))
#define bM4_I2S2_CTRL_CODECRC                     (*((volatile unsigned int*)(0x423C8044UL)))
#define bM4_I2S2_CTRL_I2SPLLSEL                   (*((volatile unsigned int*)(0x423C8048UL)))
#define bM4_I2S2_CTRL_SDOE                        (*((volatile unsigned int*)(0x423C804CUL)))
#define bM4_I2S2_CTRL_LRCKOE                      (*((volatile unsigned int*)(0x423C8050UL)))
#define bM4_I2S2_CTRL_CKOE                        (*((volatile unsigned int*)(0x423C8054UL)))
#define bM4_I2S2_CTRL_DUPLEX                      (*((volatile unsigned int*)(0x423C8058UL)))
#define bM4_I2S2_CTRL_CLKSEL                      (*((volatile unsigned int*)(0x423C805CUL)))
#define bM4_I2S2_SR_TXBA                          (*((volatile unsigned int*)(0x423C8080UL)))
#define bM4_I2S2_SR_RXBA                          (*((volatile unsigned int*)(0x423C8084UL)))
#define bM4_I2S2_SR_TXBE                          (*((volatile unsigned int*)(0x423C8088UL)))
#define bM4_I2S2_SR_TXBF                          (*((volatile unsigned int*)(0x423C808CUL)))
#define bM4_I2S2_SR_RXBE                          (*((volatile unsigned int*)(0x423C8090UL)))
#define bM4_I2S2_SR_RXBF                          (*((volatile unsigned int*)(0x423C8094UL)))
#define bM4_I2S2_ER_TXERR                         (*((volatile unsigned int*)(0x423C8100UL)))
#define bM4_I2S2_ER_RXERR                         (*((volatile unsigned int*)(0x423C8104UL)))
#define bM4_I2S2_CFGR_I2SSTD0                     (*((volatile unsigned int*)(0x423C8180UL)))
#define bM4_I2S2_CFGR_I2SSTD1                     (*((volatile unsigned int*)(0x423C8184UL)))
#define bM4_I2S2_CFGR_DATLEN0                     (*((volatile unsigned int*)(0x423C8188UL)))
#define bM4_I2S2_CFGR_DATLEN1                     (*((volatile unsigned int*)(0x423C818CUL)))
#define bM4_I2S2_CFGR_CHLEN                       (*((volatile unsigned int*)(0x423C8190UL)))
#define bM4_I2S2_CFGR_PCMSYNC                     (*((volatile unsigned int*)(0x423C8194UL)))
#define bM4_I2S2_PR_I2SDIV0                       (*((volatile unsigned int*)(0x423C8300UL)))
#define bM4_I2S2_PR_I2SDIV1                       (*((volatile unsigned int*)(0x423C8304UL)))
#define bM4_I2S2_PR_I2SDIV2                       (*((volatile unsigned int*)(0x423C8308UL)))
#define bM4_I2S2_PR_I2SDIV3                       (*((volatile unsigned int*)(0x423C830CUL)))
#define bM4_I2S2_PR_I2SDIV4                       (*((volatile unsigned int*)(0x423C8310UL)))
#define bM4_I2S2_PR_I2SDIV5                       (*((volatile unsigned int*)(0x423C8314UL)))
#define bM4_I2S2_PR_I2SDIV6                       (*((volatile unsigned int*)(0x423C8318UL)))
#define bM4_I2S2_PR_I2SDIV7                       (*((volatile unsigned int*)(0x423C831CUL)))
#define bM4_I2S3_CTRL_TXE                         (*((volatile unsigned int*)(0x42440000UL)))
#define bM4_I2S3_CTRL_TXIE                        (*((volatile unsigned int*)(0x42440004UL)))
#define bM4_I2S3_CTRL_RXE                         (*((volatile unsigned int*)(0x42440008UL)))
#define bM4_I2S3_CTRL_RXIE                        (*((volatile unsigned int*)(0x4244000CUL)))
#define bM4_I2S3_CTRL_EIE                         (*((volatile unsigned int*)(0x42440010UL)))
#define bM4_I2S3_CTRL_WMS                         (*((volatile unsigned int*)(0x42440014UL)))
#define bM4_I2S3_CTRL_ODD                         (*((volatile unsigned int*)(0x42440018UL)))
#define bM4_I2S3_CTRL_MCKOE                       (*((volatile unsigned int*)(0x4244001CUL)))
#define bM4_I2S3_CTRL_TXBIRQWL0                   (*((volatile unsigned int*)(0x42440020UL)))
#define bM4_I2S3_CTRL_TXBIRQWL1                   (*((volatile unsigned int*)(0x42440024UL)))
#define bM4_I2S3_CTRL_TXBIRQWL2                   (*((volatile unsigned int*)(0x42440028UL)))
#define bM4_I2S3_CTRL_RXBIRQWL0                   (*((volatile unsigned int*)(0x42440030UL)))
#define bM4_I2S3_CTRL_RXBIRQWL1                   (*((volatile unsigned int*)(0x42440034UL)))
#define bM4_I2S3_CTRL_RXBIRQWL2                   (*((volatile unsigned int*)(0x42440038UL)))
#define bM4_I2S3_CTRL_FIFOR                       (*((volatile unsigned int*)(0x42440040UL)))
#define bM4_I2S3_CTRL_CODECRC                     (*((volatile unsigned int*)(0x42440044UL)))
#define bM4_I2S3_CTRL_I2SPLLSEL                   (*((volatile unsigned int*)(0x42440048UL)))
#define bM4_I2S3_CTRL_SDOE                        (*((volatile unsigned int*)(0x4244004CUL)))
#define bM4_I2S3_CTRL_LRCKOE                      (*((volatile unsigned int*)(0x42440050UL)))
#define bM4_I2S3_CTRL_CKOE                        (*((volatile unsigned int*)(0x42440054UL)))
#define bM4_I2S3_CTRL_DUPLEX                      (*((volatile unsigned int*)(0x42440058UL)))
#define bM4_I2S3_CTRL_CLKSEL                      (*((volatile unsigned int*)(0x4244005CUL)))
#define bM4_I2S3_SR_TXBA                          (*((volatile unsigned int*)(0x42440080UL)))
#define bM4_I2S3_SR_RXBA                          (*((volatile unsigned int*)(0x42440084UL)))
#define bM4_I2S3_SR_TXBE                          (*((volatile unsigned int*)(0x42440088UL)))
#define bM4_I2S3_SR_TXBF                          (*((volatile unsigned int*)(0x4244008CUL)))
#define bM4_I2S3_SR_RXBE                          (*((volatile unsigned int*)(0x42440090UL)))
#define bM4_I2S3_SR_RXBF                          (*((volatile unsigned int*)(0x42440094UL)))
#define bM4_I2S3_ER_TXERR                         (*((volatile unsigned int*)(0x42440100UL)))
#define bM4_I2S3_ER_RXERR                         (*((volatile unsigned int*)(0x42440104UL)))
#define bM4_I2S3_CFGR_I2SSTD0                     (*((volatile unsigned int*)(0x42440180UL)))
#define bM4_I2S3_CFGR_I2SSTD1                     (*((volatile unsigned int*)(0x42440184UL)))
#define bM4_I2S3_CFGR_DATLEN0                     (*((volatile unsigned int*)(0x42440188UL)))
#define bM4_I2S3_CFGR_DATLEN1                     (*((volatile unsigned int*)(0x4244018CUL)))
#define bM4_I2S3_CFGR_CHLEN                       (*((volatile unsigned int*)(0x42440190UL)))
#define bM4_I2S3_CFGR_PCMSYNC                     (*((volatile unsigned int*)(0x42440194UL)))
#define bM4_I2S3_PR_I2SDIV0                       (*((volatile unsigned int*)(0x42440300UL)))
#define bM4_I2S3_PR_I2SDIV1                       (*((volatile unsigned int*)(0x42440304UL)))
#define bM4_I2S3_PR_I2SDIV2                       (*((volatile unsigned int*)(0x42440308UL)))
#define bM4_I2S3_PR_I2SDIV3                       (*((volatile unsigned int*)(0x4244030CUL)))
#define bM4_I2S3_PR_I2SDIV4                       (*((volatile unsigned int*)(0x42440310UL)))
#define bM4_I2S3_PR_I2SDIV5                       (*((volatile unsigned int*)(0x42440314UL)))
#define bM4_I2S3_PR_I2SDIV6                       (*((volatile unsigned int*)(0x42440318UL)))
#define bM4_I2S3_PR_I2SDIV7                       (*((volatile unsigned int*)(0x4244031CUL)))
#define bM4_I2S4_CTRL_TXE                         (*((volatile unsigned int*)(0x42448000UL)))
#define bM4_I2S4_CTRL_TXIE                        (*((volatile unsigned int*)(0x42448004UL)))
#define bM4_I2S4_CTRL_RXE                         (*((volatile unsigned int*)(0x42448008UL)))
#define bM4_I2S4_CTRL_RXIE                        (*((volatile unsigned int*)(0x4244800CUL)))
#define bM4_I2S4_CTRL_EIE                         (*((volatile unsigned int*)(0x42448010UL)))
#define bM4_I2S4_CTRL_WMS                         (*((volatile unsigned int*)(0x42448014UL)))
#define bM4_I2S4_CTRL_ODD                         (*((volatile unsigned int*)(0x42448018UL)))
#define bM4_I2S4_CTRL_MCKOE                       (*((volatile unsigned int*)(0x4244801CUL)))
#define bM4_I2S4_CTRL_TXBIRQWL0                   (*((volatile unsigned int*)(0x42448020UL)))
#define bM4_I2S4_CTRL_TXBIRQWL1                   (*((volatile unsigned int*)(0x42448024UL)))
#define bM4_I2S4_CTRL_TXBIRQWL2                   (*((volatile unsigned int*)(0x42448028UL)))
#define bM4_I2S4_CTRL_RXBIRQWL0                   (*((volatile unsigned int*)(0x42448030UL)))
#define bM4_I2S4_CTRL_RXBIRQWL1                   (*((volatile unsigned int*)(0x42448034UL)))
#define bM4_I2S4_CTRL_RXBIRQWL2                   (*((volatile unsigned int*)(0x42448038UL)))
#define bM4_I2S4_CTRL_FIFOR                       (*((volatile unsigned int*)(0x42448040UL)))
#define bM4_I2S4_CTRL_CODECRC                     (*((volatile unsigned int*)(0x42448044UL)))
#define bM4_I2S4_CTRL_I2SPLLSEL                   (*((volatile unsigned int*)(0x42448048UL)))
#define bM4_I2S4_CTRL_SDOE                        (*((volatile unsigned int*)(0x4244804CUL)))
#define bM4_I2S4_CTRL_LRCKOE                      (*((volatile unsigned int*)(0x42448050UL)))
#define bM4_I2S4_CTRL_CKOE                        (*((volatile unsigned int*)(0x42448054UL)))
#define bM4_I2S4_CTRL_DUPLEX                      (*((volatile unsigned int*)(0x42448058UL)))
#define bM4_I2S4_CTRL_CLKSEL                      (*((volatile unsigned int*)(0x4244805CUL)))
#define bM4_I2S4_SR_TXBA                          (*((volatile unsigned int*)(0x42448080UL)))
#define bM4_I2S4_SR_RXBA                          (*((volatile unsigned int*)(0x42448084UL)))
#define bM4_I2S4_SR_TXBE                          (*((volatile unsigned int*)(0x42448088UL)))
#define bM4_I2S4_SR_TXBF                          (*((volatile unsigned int*)(0x4244808CUL)))
#define bM4_I2S4_SR_RXBE                          (*((volatile unsigned int*)(0x42448090UL)))
#define bM4_I2S4_SR_RXBF                          (*((volatile unsigned int*)(0x42448094UL)))
#define bM4_I2S4_ER_TXERR                         (*((volatile unsigned int*)(0x42448100UL)))
#define bM4_I2S4_ER_RXERR                         (*((volatile unsigned int*)(0x42448104UL)))
#define bM4_I2S4_CFGR_I2SSTD0                     (*((volatile unsigned int*)(0x42448180UL)))
#define bM4_I2S4_CFGR_I2SSTD1                     (*((volatile unsigned int*)(0x42448184UL)))
#define bM4_I2S4_CFGR_DATLEN0                     (*((volatile unsigned int*)(0x42448188UL)))
#define bM4_I2S4_CFGR_DATLEN1                     (*((volatile unsigned int*)(0x4244818CUL)))
#define bM4_I2S4_CFGR_CHLEN                       (*((volatile unsigned int*)(0x42448190UL)))
#define bM4_I2S4_CFGR_PCMSYNC                     (*((volatile unsigned int*)(0x42448194UL)))
#define bM4_I2S4_PR_I2SDIV0                       (*((volatile unsigned int*)(0x42448300UL)))
#define bM4_I2S4_PR_I2SDIV1                       (*((volatile unsigned int*)(0x42448304UL)))
#define bM4_I2S4_PR_I2SDIV2                       (*((volatile unsigned int*)(0x42448308UL)))
#define bM4_I2S4_PR_I2SDIV3                       (*((volatile unsigned int*)(0x4244830CUL)))
#define bM4_I2S4_PR_I2SDIV4                       (*((volatile unsigned int*)(0x42448310UL)))
#define bM4_I2S4_PR_I2SDIV5                       (*((volatile unsigned int*)(0x42448314UL)))
#define bM4_I2S4_PR_I2SDIV6                       (*((volatile unsigned int*)(0x42448318UL)))
#define bM4_I2S4_PR_I2SDIV7                       (*((volatile unsigned int*)(0x4244831CUL)))
#define bM4_INTC_NMICR_NMITRG                     (*((volatile unsigned int*)(0x42A20000UL)))
#define bM4_INTC_NMICR_NSMPCLK0                   (*((volatile unsigned int*)(0x42A20010UL)))
#define bM4_INTC_NMICR_NSMPCLK1                   (*((volatile unsigned int*)(0x42A20014UL)))
#define bM4_INTC_NMICR_NFEN                       (*((volatile unsigned int*)(0x42A2001CUL)))
#define bM4_INTC_NMIENR_NMIENR                    (*((volatile unsigned int*)(0x42A20080UL)))
#define bM4_INTC_NMIENR_SWDTENR                   (*((volatile unsigned int*)(0x42A20084UL)))
#define bM4_INTC_NMIENR_PVD1ENR                   (*((volatile unsigned int*)(0x42A20088UL)))
#define bM4_INTC_NMIENR_PVD2ENR                   (*((volatile unsigned int*)(0x42A2008CUL)))
#define bM4_INTC_NMIENR_XTALSTPENR                (*((volatile unsigned int*)(0x42A20094UL)))
#define bM4_INTC_NMIENR_REPENR                    (*((volatile unsigned int*)(0x42A200A0UL)))
#define bM4_INTC_NMIENR_RECCENR                   (*((volatile unsigned int*)(0x42A200A4UL)))
#define bM4_INTC_NMIENR_BUSMENR                   (*((volatile unsigned int*)(0x42A200A8UL)))
#define bM4_INTC_NMIENR_WDTENR                    (*((volatile unsigned int*)(0x42A200ACUL)))
#define bM4_INTC_NMIFR_NMIFR                      (*((volatile unsigned int*)(0x42A20100UL)))
#define bM4_INTC_NMIFR_SWDTFR                     (*((volatile unsigned int*)(0x42A20104UL)))
#define bM4_INTC_NMIFR_PVD1FR                     (*((volatile unsigned int*)(0x42A20108UL)))
#define bM4_INTC_NMIFR_PVD2FR                     (*((volatile unsigned int*)(0x42A2010CUL)))
#define bM4_INTC_NMIFR_XTALSTPFR                  (*((volatile unsigned int*)(0x42A20114UL)))
#define bM4_INTC_NMIFR_REPFR                      (*((volatile unsigned int*)(0x42A20120UL)))
#define bM4_INTC_NMIFR_RECCFR                     (*((volatile unsigned int*)(0x42A20124UL)))
#define bM4_INTC_NMIFR_BUSMFR                     (*((volatile unsigned int*)(0x42A20128UL)))
#define bM4_INTC_NMIFR_WDTFR                      (*((volatile unsigned int*)(0x42A2012CUL)))
#define bM4_INTC_NMICFR_NMICFR                    (*((volatile unsigned int*)(0x42A20180UL)))
#define bM4_INTC_NMICFR_SWDTCFR                   (*((volatile unsigned int*)(0x42A20184UL)))
#define bM4_INTC_NMICFR_PVD1CFR                   (*((volatile unsigned int*)(0x42A20188UL)))
#define bM4_INTC_NMICFR_PVD2CFR                   (*((volatile unsigned int*)(0x42A2018CUL)))
#define bM4_INTC_NMICFR_XTALSTPCFR                (*((volatile unsigned int*)(0x42A20194UL)))
#define bM4_INTC_NMICFR_REPCFR                    (*((volatile unsigned int*)(0x42A201A0UL)))
#define bM4_INTC_NMICFR_RECCCFR                   (*((volatile unsigned int*)(0x42A201A4UL)))
#define bM4_INTC_NMICFR_BUSMCFR                   (*((volatile unsigned int*)(0x42A201A8UL)))
#define bM4_INTC_NMICFR_WDTCFR                    (*((volatile unsigned int*)(0x42A201ACUL)))
#define bM4_INTC_EIRQCR0_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20200UL)))
#define bM4_INTC_EIRQCR0_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20204UL)))
#define bM4_INTC_EIRQCR0_EISMPCLK0                (*((volatile unsigned int*)(0x42A20210UL)))
#define bM4_INTC_EIRQCR0_EISMPCLK1                (*((volatile unsigned int*)(0x42A20214UL)))
