patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_INTC_EIRQCR0_EFEN                     (*((volatile unsigned int*)(0x42A2021CUL)))
#define bM4_INTC_EIRQCR1_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20280UL)))
#define bM4_INTC_EIRQCR1_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20284UL)))
#define bM4_INTC_EIRQCR1_EISMPCLK0                (*((volatile unsigned int*)(0x42A20290UL)))
#define bM4_INTC_EIRQCR1_EISMPCLK1                (*((volatile unsigned int*)(0x42A20294UL)))
#define bM4_INTC_EIRQCR1_EFEN                     (*((volatile unsigned int*)(0x42A2029CUL)))
#define bM4_INTC_EIRQCR2_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20300UL)))
#define bM4_INTC_EIRQCR2_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20304UL)))
#define bM4_INTC_EIRQCR2_EISMPCLK0                (*((volatile unsigned int*)(0x42A20310UL)))
#define bM4_INTC_EIRQCR2_EISMPCLK1                (*((volatile unsigned int*)(0x42A20314UL)))
#define bM4_INTC_EIRQCR2_EFEN                     (*((volatile unsigned int*)(0x42A2031CUL)))
#define bM4_INTC_EIRQCR3_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20380UL)))
#define bM4_INTC_EIRQCR3_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20384UL)))
#define bM4_INTC_EIRQCR3_EISMPCLK0                (*((volatile unsigned int*)(0x42A20390UL)))
#define bM4_INTC_EIRQCR3_EISMPCLK1                (*((volatile unsigned int*)(0x42A20394UL)))
#define bM4_INTC_EIRQCR3_EFEN                     (*((volatile unsigned int*)(0x42A2039CUL)))
#define bM4_INTC_EIRQCR4_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20400UL)))
#define bM4_INTC_EIRQCR4_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20404UL)))
#define bM4_INTC_EIRQCR4_EISMPCLK0                (*((volatile unsigned int*)(0x42A20410UL)))
#define bM4_INTC_EIRQCR4_EISMPCLK1                (*((volatile unsigned int*)(0x42A20414UL)))
#define bM4_INTC_EIRQCR4_EFEN                     (*((volatile unsigned int*)(0x42A2041CUL)))
#define bM4_INTC_EIRQCR5_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20480UL)))
#define bM4_INTC_EIRQCR5_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20484UL)))
#define bM4_INTC_EIRQCR5_EISMPCLK0                (*((volatile unsigned int*)(0x42A20490UL)))
#define bM4_INTC_EIRQCR5_EISMPCLK1                (*((volatile unsigned int*)(0x42A20494UL)))
#define bM4_INTC_EIRQCR5_EFEN                     (*((volatile unsigned int*)(0x42A2049CUL)))
#define bM4_INTC_EIRQCR6_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20500UL)))
#define bM4_INTC_EIRQCR6_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20504UL)))
#define bM4_INTC_EIRQCR6_EISMPCLK0                (*((volatile unsigned int*)(0x42A20510UL)))
#define bM4_INTC_EIRQCR6_EISMPCLK1                (*((volatile unsigned int*)(0x42A20514UL)))
#define bM4_INTC_EIRQCR6_EFEN                     (*((volatile unsigned int*)(0x42A2051CUL)))
#define bM4_INTC_EIRQCR7_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20580UL)))
#define bM4_INTC_EIRQCR7_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20584UL)))
#define bM4_INTC_EIRQCR7_EISMPCLK0                (*((volatile unsigned int*)(0x42A20590UL)))
#define bM4_INTC_EIRQCR7_EISMPCLK1                (*((volatile unsigned int*)(0x42A20594UL)))
#define bM4_INTC_EIRQCR7_EFEN                     (*((volatile unsigned int*)(0x42A2059CUL)))
#define bM4_INTC_EIRQCR8_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20600UL)))
#define bM4_INTC_EIRQCR8_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20604UL)))
#define bM4_INTC_EIRQCR8_EISMPCLK0                (*((volatile unsigned int*)(0x42A20610UL)))
#define bM4_INTC_EIRQCR8_EISMPCLK1                (*((volatile unsigned int*)(0x42A20614UL)))
#define bM4_INTC_EIRQCR8_EFEN                     (*((volatile unsigned int*)(0x42A2061CUL)))
#define bM4_INTC_EIRQCR9_EIRQTRG0                 (*((volatile unsigned int*)(0x42A20680UL)))
#define bM4_INTC_EIRQCR9_EIRQTRG1                 (*((volatile unsigned int*)(0x42A20684UL)))
#define bM4_INTC_EIRQCR9_EISMPCLK0                (*((volatile unsigned int*)(0x42A20690UL)))
#define bM4_INTC_EIRQCR9_EISMPCLK1                (*((volatile unsigned int*)(0x42A20694UL)))
#define bM4_INTC_EIRQCR9_EFEN                     (*((volatile unsigned int*)(0x42A2069CUL)))
#define bM4_INTC_EIRQCR10_EIRQTRG0                (*((volatile unsigned int*)(0x42A20700UL)))
#define bM4_INTC_EIRQCR10_EIRQTRG1                (*((volatile unsigned int*)(0x42A20704UL)))
#define bM4_INTC_EIRQCR10_EISMPCLK0               (*((volatile unsigned int*)(0x42A20710UL)))
#define bM4_INTC_EIRQCR10_EISMPCLK1               (*((volatile unsigned int*)(0x42A20714UL)))
#define bM4_INTC_EIRQCR10_EFEN                    (*((volatile unsigned int*)(0x42A2071CUL)))
#define bM4_INTC_EIRQCR11_EIRQTRG0                (*((volatile unsigned int*)(0x42A20780UL)))
#define bM4_INTC_EIRQCR11_EIRQTRG1                (*((volatile unsigned int*)(0x42A20784UL)))
#define bM4_INTC_EIRQCR11_EISMPCLK0               (*((volatile unsigned int*)(0x42A20790UL)))
#define bM4_INTC_EIRQCR11_EISMPCLK1               (*((volatile unsigned int*)(0x42A20794UL)))
#define bM4_INTC_EIRQCR11_EFEN                    (*((volatile unsigned int*)(0x42A2079CUL)))
#define bM4_INTC_EIRQCR12_EIRQTRG0                (*((volatile unsigned int*)(0x42A20800UL)))
#define bM4_INTC_EIRQCR12_EIRQTRG1                (*((volatile unsigned int*)(0x42A20804UL)))
#define bM4_INTC_EIRQCR12_EISMPCLK0               (*((volatile unsigned int*)(0x42A20810UL)))
#define bM4_INTC_EIRQCR12_EISMPCLK1               (*((volatile unsigned int*)(0x42A20814UL)))
#define bM4_INTC_EIRQCR12_EFEN                    (*((volatile unsigned int*)(0x42A2081CUL)))
#define bM4_INTC_EIRQCR13_EIRQTRG0                (*((volatile unsigned int*)(0x42A20880UL)))
#define bM4_INTC_EIRQCR13_EIRQTRG1                (*((volatile unsigned int*)(0x42A20884UL)))
#define bM4_INTC_EIRQCR13_EISMPCLK0               (*((volatile unsigned int*)(0x42A20890UL)))
#define bM4_INTC_EIRQCR13_EISMPCLK1               (*((volatile unsigned int*)(0x42A20894UL)))
#define bM4_INTC_EIRQCR13_EFEN                    (*((volatile unsigned int*)(0x42A2089CUL)))
#define bM4_INTC_EIRQCR14_EIRQTRG0                (*((volatile unsigned int*)(0x42A20900UL)))
#define bM4_INTC_EIRQCR14_EIRQTRG1                (*((volatile unsigned int*)(0x42A20904UL)))
#define bM4_INTC_EIRQCR14_EISMPCLK0               (*((volatile unsigned int*)(0x42A20910UL)))
#define bM4_INTC_EIRQCR14_EISMPCLK1               (*((volatile unsigned int*)(0x42A20914UL)))
#define bM4_INTC_EIRQCR14_EFEN                    (*((volatile unsigned int*)(0x42A2091CUL)))
#define bM4_INTC_EIRQCR15_EIRQTRG0                (*((volatile unsigned int*)(0x42A20980UL)))
#define bM4_INTC_EIRQCR15_EIRQTRG1                (*((volatile unsigned int*)(0x42A20984UL)))
#define bM4_INTC_EIRQCR15_EISMPCLK0               (*((volatile unsigned int*)(0x42A20990UL)))
#define bM4_INTC_EIRQCR15_EISMPCLK1               (*((volatile unsigned int*)(0x42A20994UL)))
#define bM4_INTC_EIRQCR15_EFEN                    (*((volatile unsigned int*)(0x42A2099CUL)))
#define bM4_INTC_WUPEN_EIRQWUEN0                  (*((volatile unsigned int*)(0x42A20A00UL)))
#define bM4_INTC_WUPEN_EIRQWUEN1                  (*((volatile unsigned int*)(0x42A20A04UL)))
#define bM4_INTC_WUPEN_EIRQWUEN2                  (*((volatile unsigned int*)(0x42A20A08UL)))
#define bM4_INTC_WUPEN_EIRQWUEN3                  (*((volatile unsigned int*)(0x42A20A0CUL)))
#define bM4_INTC_WUPEN_EIRQWUEN4                  (*((volatile unsigned int*)(0x42A20A10UL)))
#define bM4_INTC_WUPEN_EIRQWUEN5                  (*((volatile unsigned int*)(0x42A20A14UL)))
#define bM4_INTC_WUPEN_EIRQWUEN6                  (*((volatile unsigned int*)(0x42A20A18UL)))
#define bM4_INTC_WUPEN_EIRQWUEN7                  (*((volatile unsigned int*)(0x42A20A1CUL)))
#define bM4_INTC_WUPEN_EIRQWUEN8                  (*((volatile unsigned int*)(0x42A20A20UL)))
#define bM4_INTC_WUPEN_EIRQWUEN9                  (*((volatile unsigned int*)(0x42A20A24UL)))
#define bM4_INTC_WUPEN_EIRQWUEN10                 (*((volatile unsigned int*)(0x42A20A28UL)))
#define bM4_INTC_WUPEN_EIRQWUEN11                 (*((volatile unsigned int*)(0x42A20A2CUL)))
#define bM4_INTC_WUPEN_EIRQWUEN12                 (*((volatile unsigned int*)(0x42A20A30UL)))
#define bM4_INTC_WUPEN_EIRQWUEN13                 (*((volatile unsigned int*)(0x42A20A34UL)))
#define bM4_INTC_WUPEN_EIRQWUEN14                 (*((volatile unsigned int*)(0x42A20A38UL)))
#define bM4_INTC_WUPEN_EIRQWUEN15                 (*((volatile unsigned int*)(0x42A20A3CUL)))
#define bM4_INTC_WUPEN_SWDTWUEN                   (*((volatile unsigned int*)(0x42A20A40UL)))
#define bM4_INTC_WUPEN_PVD1WUEN                   (*((volatile unsigned int*)(0x42A20A44UL)))
#define bM4_INTC_WUPEN_PVD2WUEN                   (*((volatile unsigned int*)(0x42A20A48UL)))
#define bM4_INTC_WUPEN_CMPI0WUEN                  (*((volatile unsigned int*)(0x42A20A4CUL)))
#define bM4_INTC_WUPEN_WKTMWUEN                   (*((volatile unsigned int*)(0x42A20A50UL)))
#define bM4_INTC_WUPEN_RTCALMWUEN                 (*((volatile unsigned int*)(0x42A20A54UL)))
#define bM4_INTC_WUPEN_RTCPRDWUEN                 (*((volatile unsigned int*)(0x42A20A58UL)))
#define bM4_INTC_WUPEN_TMR0WUEN                   (*((volatile unsigned int*)(0x42A20A5CUL)))
#define bM4_INTC_WUPEN_RXWUEN                     (*((volatile unsigned int*)(0x42A20A64UL)))
#define bM4_INTC_EIFR_EIFR0                       (*((volatile unsigned int*)(0x42A20A80UL)))
#define bM4_INTC_EIFR_EIFR1                       (*((volatile unsigned int*)(0x42A20A84UL)))
#define bM4_INTC_EIFR_EIFR2                       (*((volatile unsigned int*)(0x42A20A88UL)))
#define bM4_INTC_EIFR_EIFR3                       (*((volatile unsigned int*)(0x42A20A8CUL)))
#define bM4_INTC_EIFR_EIFR4                       (*((volatile unsigned int*)(0x42A20A90UL)))
#define bM4_INTC_EIFR_EIFR5                       (*((volatile unsigned int*)(0x42A20A94UL)))
#define bM4_INTC_EIFR_EIFR6                       (*((volatile unsigned int*)(0x42A20A98UL)))
#define bM4_INTC_EIFR_EIFR7                       (*((volatile unsigned int*)(0x42A20A9CUL)))
#define bM4_INTC_EIFR_EIFR8                       (*((volatile unsigned int*)(0x42A20AA0UL)))
#define bM4_INTC_EIFR_EIFR9                       (*((volatile unsigned int*)(0x42A20AA4UL)))
#define bM4_INTC_EIFR_EIFR10                      (*((volatile unsigned int*)(0x42A20AA8UL)))
#define bM4_INTC_EIFR_EIFR11                      (*((volatile unsigned int*)(0x42A20AACUL)))
#define bM4_INTC_EIFR_EIFR12                      (*((volatile unsigned int*)(0x42A20AB0UL)))
#define bM4_INTC_EIFR_EIFR13                      (*((volatile unsigned int*)(0x42A20AB4UL)))
#define bM4_INTC_EIFR_EIFR14                      (*((volatile unsigned int*)(0x42A20AB8UL)))
#define bM4_INTC_EIFR_EIFR15                      (*((volatile unsigned int*)(0x42A20ABCUL)))
#define bM4_INTC_EICFR_EICFR0                     (*((volatile unsigned int*)(0x42A20B00UL)))
#define bM4_INTC_EICFR_EICFR1                     (*((volatile unsigned int*)(0x42A20B04UL)))
#define bM4_INTC_EICFR_EICFR2                     (*((volatile unsigned int*)(0x42A20B08UL)))
#define bM4_INTC_EICFR_EICFR3                     (*((volatile unsigned int*)(0x42A20B0CUL)))
#define bM4_INTC_EICFR_EICFR4                     (*((volatile unsigned int*)(0x42A20B10UL)))
#define bM4_INTC_EICFR_EICFR5                     (*((volatile unsigned int*)(0x42A20B14UL)))
#define bM4_INTC_EICFR_EICFR6                     (*((volatile unsigned int*)(0x42A20B18UL)))
#define bM4_INTC_EICFR_EICFR7                     (*((volatile unsigned int*)(0x42A20B1CUL)))
#define bM4_INTC_EICFR_EICFR8                     (*((volatile unsigned int*)(0x42A20B20UL)))
#define bM4_INTC_EICFR_EICFR9                     (*((volatile unsigned int*)(0x42A20B24UL)))
#define bM4_INTC_EICFR_EICFR10                    (*((volatile unsigned int*)(0x42A20B28UL)))
#define bM4_INTC_EICFR_EICFR11                    (*((volatile unsigned int*)(0x42A20B2CUL)))
#define bM4_INTC_EICFR_EICFR12                    (*((volatile unsigned int*)(0x42A20B30UL)))
#define bM4_INTC_EICFR_EICFR13                    (*((volatile unsigned int*)(0x42A20B34UL)))
#define bM4_INTC_EICFR_EICFR14                    (*((volatile unsigned int*)(0x42A20B38UL)))
#define bM4_INTC_EICFR_EICFR15                    (*((volatile unsigned int*)(0x42A20B3CUL)))
#define bM4_INTC_SEL0_INTSEL0                     (*((volatile unsigned int*)(0x42A20B80UL)))
#define bM4_INTC_SEL0_INTSEL1                     (*((volatile unsigned int*)(0x42A20B84UL)))
#define bM4_INTC_SEL0_INTSEL2                     (*((volatile unsigned int*)(0x42A20B88UL)))
#define bM4_INTC_SEL0_INTSEL3                     (*((volatile unsigned int*)(0x42A20B8CUL)))
#define bM4_INTC_SEL0_INTSEL4                     (*((volatile unsigned int*)(0x42A20B90UL)))
#define bM4_INTC_SEL0_INTSEL5                     (*((volatile unsigned int*)(0x42A20B94UL)))
#define bM4_INTC_SEL0_INTSEL6                     (*((volatile unsigned int*)(0x42A20B98UL)))
#define bM4_INTC_SEL0_INTSEL7                     (*((volatile unsigned int*)(0x42A20B9CUL)))
#define bM4_INTC_SEL0_INTSEL8                     (*((volatile unsigned int*)(0x42A20BA0UL)))
#define bM4_INTC_SEL1_INTSEL0                     (*((volatile unsigned int*)(0x42A20C00UL)))
#define bM4_INTC_SEL1_INTSEL1                     (*((volatile unsigned int*)(0x42A20C04UL)))
#define bM4_INTC_SEL1_INTSEL2                     (*((volatile unsigned int*)(0x42A20C08UL)))
#define bM4_INTC_SEL1_INTSEL3                     (*((volatile unsigned int*)(0x42A20C0CUL)))
#define bM4_INTC_SEL1_INTSEL4                     (*((volatile unsigned int*)(0x42A20C10UL)))
#define bM4_INTC_SEL1_INTSEL5                     (*((volatile unsigned int*)(0x42A20C14UL)))
#define bM4_INTC_SEL1_INTSEL6                     (*((volatile unsigned int*)(0x42A20C18UL)))
#define bM4_INTC_SEL1_INTSEL7                     (*((volatile unsigned int*)(0x42A20C1CUL)))
#define bM4_INTC_SEL1_INTSEL8                     (*((volatile unsigned int*)(0x42A20C20UL)))
#define bM4_INTC_SEL2_INTSEL0                     (*((volatile unsigned int*)(0x42A20C80UL)))
#define bM4_INTC_SEL2_INTSEL1                     (*((volatile unsigned int*)(0x42A20C84UL)))
#define bM4_INTC_SEL2_INTSEL2                     (*((volatile unsigned int*)(0x42A20C88UL)))
#define bM4_INTC_SEL2_INTSEL3                     (*((volatile unsigned int*)(0x42A20C8CUL)))
#define bM4_INTC_SEL2_INTSEL4                     (*((volatile unsigned int*)(0x42A20C90UL)))
#define bM4_INTC_SEL2_INTSEL5                     (*((volatile unsigned int*)(0x42A20C94UL)))
#define bM4_INTC_SEL2_INTSEL6                     (*((volatile unsigned int*)(0x42A20C98UL)))
#define bM4_INTC_SEL2_INTSEL7                     (*((volatile unsigned int*)(0x42A20C9CUL)))
#define bM4_INTC_SEL2_INTSEL8                     (*((volatile unsigned int*)(0x42A20CA0UL)))
#define bM4_INTC_SEL3_INTSEL0                     (*((volatile unsigned int*)(0x42A20D00UL)))
#define bM4_INTC_SEL3_INTSEL1                     (*((volatile unsigned int*)(0x42A20D04UL)))
#define bM4_INTC_SEL3_INTSEL2                     (*((volatile unsigned int*)(0x42A20D08UL)))
#define bM4_INTC_SEL3_INTSEL3                     (*((volatile unsigned int*)(0x42A20D0CUL)))
#define bM4_INTC_SEL3_INTSEL4                     (*((volatile unsigned int*)(0x42A20D10UL)))
#define bM4_INTC_SEL3_INTSEL5                     (*((volatile unsigned int*)(0x42A20D14UL)))
#define bM4_INTC_SEL3_INTSEL6                     (*((volatile unsigned int*)(0x42A20D18UL)))
#define bM4_INTC_SEL3_INTSEL7                     (*((volatile unsigned int*)(0x42A20D1CUL)))
#define bM4_INTC_SEL3_INTSEL8                     (*((volatile unsigned int*)(0x42A20D20UL)))
#define bM4_INTC_SEL4_INTSEL0                     (*((volatile unsigned int*)(0x42A20D80UL)))
#define bM4_INTC_SEL4_INTSEL1                     (*((volatile unsigned int*)(0x42A20D84UL)))
#define bM4_INTC_SEL4_INTSEL2                     (*((volatile unsigned int*)(0x42A20D88UL)))
#define bM4_INTC_SEL4_INTSEL3                     (*((volatile unsigned int*)(0x42A20D8CUL)))
#define bM4_INTC_SEL4_INTSEL4                     (*((volatile unsigned int*)(0x42A20D90UL)))
#define bM4_INTC_SEL4_INTSEL5                     (*((volatile unsigned int*)(0x42A20D94UL)))
#define bM4_INTC_SEL4_INTSEL6                     (*((volatile unsigned int*)(0x42A20D98UL)))
#define bM4_INTC_SEL4_INTSEL7                     (*((volatile unsigned int*)(0x42A20D9CUL)))
#define bM4_INTC_SEL4_INTSEL8                     (*((volatile unsigned int*)(0x42A20DA0UL)))
#define bM4_INTC_SEL5_INTSEL0                     (*((volatile unsigned int*)(0x42A20E00UL)))
#define bM4_INTC_SEL5_INTSEL1                     (*((volatile unsigned int*)(0x42A20E04UL)))
#define bM4_INTC_SEL5_INTSEL2                     (*((volatile unsigned int*)(0x42A20E08UL)))
#define bM4_INTC_SEL5_INTSEL3                     (*((volatile unsigned int*)(0x42A20E0CUL)))
#define bM4_INTC_SEL5_INTSEL4                     (*((volatile unsigned int*)(0x42A20E10UL)))
#define bM4_INTC_SEL5_INTSEL5                     (*((volatile unsigned int*)(0x42A20E14UL)))
#define bM4_INTC_SEL5_INTSEL6                     (*((volatile unsigned int*)(0x42A20E18UL)))
#define bM4_INTC_SEL5_INTSEL7                     (*((volatile unsigned int*)(0x42A20E1CUL)))
#define bM4_INTC_SEL5_INTSEL8                     (*((volatile unsigned int*)(0x42A20E20UL)))
#define bM4_INTC_SEL6_INTSEL0                     (*((volatile unsigned int*)(0x42A20E80UL)))
#define bM4_INTC_SEL6_INTSEL1                     (*((volatile unsigned int*)(0x42A20E84UL)))
#define bM4_INTC_SEL6_INTSEL2                     (*((volatile unsigned int*)(0x42A20E88UL)))
#define bM4_INTC_SEL6_INTSEL3                     (*((volatile unsigned int*)(0x42A20E8CUL)))
#define bM4_INTC_SEL6_INTSEL4                     (*((volatile unsigned int*)(0x42A20E90UL)))
#define bM4_INTC_SEL6_INTSEL5                     (*((volatile unsigned int*)(0x42A20E94UL)))
#define bM4_INTC_SEL6_INTSEL6                     (*((volatile unsigned int*)(0x42A20E98UL)))
#define bM4_INTC_SEL6_INTSEL7                     (*((volatile unsigned int*)(0x42A20E9CUL)))
#define bM4_INTC_SEL6_INTSEL8                     (*((volatile unsigned int*)(0x42A20EA0UL)))
#define bM4_INTC_SEL7_INTSEL0                     (*((volatile unsigned int*)(0x42A20F00UL)))
#define bM4_INTC_SEL7_INTSEL1                     (*((volatile unsigned int*)(0x42A20F04UL)))
#define bM4_INTC_SEL7_INTSEL2                     (*((volatile unsigned int*)(0x42A20F08UL)))
#define bM4_INTC_SEL7_INTSEL3                     (*((volatile unsigned int*)(0x42A20F0CUL)))
#define bM4_INTC_SEL7_INTSEL4                     (*((volatile unsigned int*)(0x42A20F10UL)))
#define bM4_INTC_SEL7_INTSEL5                     (*((volatile unsigned int*)(0x42A20F14UL)))
#define bM4_INTC_SEL7_INTSEL6                     (*((volatile unsigned int*)(0x42A20F18UL)))
#define bM4_INTC_SEL7_INTSEL7                     (*((volatile unsigned int*)(0x42A20F1CUL)))
#define bM4_INTC_SEL7_INTSEL8                     (*((volatile unsigned int*)(0x42A20F20UL)))
#define bM4_INTC_SEL8_INTSEL0                     (*((volatile unsigned int*)(0x42A20F80UL)))
#define bM4_INTC_SEL8_INTSEL1                     (*((volatile unsigned int*)(0x42A20F84UL)))
#define bM4_INTC_SEL8_INTSEL2                     (*((volatile unsigned int*)(0x42A20F88UL)))
#define bM4_INTC_SEL8_INTSEL3                     (*((volatile unsigned int*)(0x42A20F8CUL)))
#define bM4_INTC_SEL8_INTSEL4                     (*((volatile unsigned int*)(0x42A20F90UL)))
#define bM4_INTC_SEL8_INTSEL5                     (*((volatile unsigned int*)(0x42A20F94UL)))
#define bM4_INTC_SEL8_INTSEL6                     (*((volatile unsigned int*)(0x42A20F98UL)))
#define bM4_INTC_SEL8_INTSEL7                     (*((volatile unsigned int*)(0x42A20F9CUL)))
#define bM4_INTC_SEL8_INTSEL8                     (*((volatile unsigned int*)(0x42A20FA0UL)))
#define bM4_INTC_SEL9_INTSEL0                     (*((volatile unsigned int*)(0x42A21000UL)))
#define bM4_INTC_SEL9_INTSEL1                     (*((volatile unsigned int*)(0x42A21004UL)))
#define bM4_INTC_SEL9_INTSEL2                     (*((volatile unsigned int*)(0x42A21008UL)))
#define bM4_INTC_SEL9_INTSEL3                     (*((volatile unsigned int*)(0x42A2100CUL)))
#define bM4_INTC_SEL9_INTSEL4                     (*((volatile unsigned int*)(0x42A21010UL)))
#define bM4_INTC_SEL9_INTSEL5                     (*((volatile unsigned int*)(0x42A21014UL)))
#define bM4_INTC_SEL9_INTSEL6                     (*((volatile unsigned int*)(0x42A21018UL)))
#define bM4_INTC_SEL9_INTSEL7                     (*((volatile unsigned int*)(0x42A2101CUL)))
#define bM4_INTC_SEL9_INTSEL8                     (*((volatile unsigned int*)(0x42A21020UL)))
#define bM4_INTC_SEL10_INTSEL0                    (*((volatile unsigned int*)(0x42A21080UL)))
#define bM4_INTC_SEL10_INTSEL1                    (*((volatile unsigned int*)(0x42A21084UL)))
#define bM4_INTC_SEL10_INTSEL2                    (*((volatile unsigned int*)(0x42A21088UL)))
#define bM4_INTC_SEL10_INTSEL3                    (*((volatile unsigned int*)(0x42A2108CUL)))
#define bM4_INTC_SEL10_INTSEL4                    (*((volatile unsigned int*)(0x42A21090UL)))
#define bM4_INTC_SEL10_INTSEL5                    (*((volatile unsigned int*)(0x42A21094UL)))
#define bM4_INTC_SEL10_INTSEL6                    (*((volatile unsigned int*)(0x42A21098UL)))
#define bM4_INTC_SEL10_INTSEL7                    (*((volatile unsigned int*)(0x42A2109CUL)))
#define bM4_INTC_SEL10_INTSEL8                    (*((volatile unsigned int*)(0x42A210A0UL)))
#define bM4_INTC_SEL11_INTSEL0                    (*((volatile unsigned int*)(0x42A21100UL)))
#define bM4_INTC_SEL11_INTSEL1                    (*((volatile unsigned int*)(0x42A21104UL)))
#define bM4_INTC_SEL11_INTSEL2                    (*((volatile unsigned int*)(0x42A21108UL)))
#define bM4_INTC_SEL11_INTSEL3                    (*((volatile unsigned int*)(0x42A2110CUL)))
#define bM4_INTC_SEL11_INTSEL4                    (*((volatile unsigned int*)(0x42A21110UL)))
#define bM4_INTC_SEL11_INTSEL5                    (*((volatile unsigned int*)(0x42A21114UL)))
#define bM4_INTC_SEL11_INTSEL6                    (*((volatile unsigned int*)(0x42A21118UL)))
#define bM4_INTC_SEL11_INTSEL7                    (*((volatile unsigned int*)(0x42A2111CUL)))
#define bM4_INTC_SEL11_INTSEL8                    (*((volatile unsigned int*)(0x42A21120UL)))
#define bM4_INTC_SEL12_INTSEL0                    (*((volatile unsigned int*)(0x42A21180UL)))
#define bM4_INTC_SEL12_INTSEL1                    (*((volatile unsigned int*)(0x42A21184UL)))
#define bM4_INTC_SEL12_INTSEL2                    (*((volatile unsigned int*)(0x42A21188UL)))
#define bM4_INTC_SEL12_INTSEL3                    (*((volatile unsigned int*)(0x42A2118CUL)))
#define bM4_INTC_SEL12_INTSEL4                    (*((volatile unsigned int*)(0x42A21190UL)))
#define bM4_INTC_SEL12_INTSEL5                    (*((volatile unsigned int*)(0x42A21194UL)))
#define bM4_INTC_SEL12_INTSEL6                    (*((volatile unsigned int*)(0x42A21198UL)))
#define bM4_INTC_SEL12_INTSEL7                    (*((volatile unsigned int*)(0x42A2119CUL)))
#define bM4_INTC_SEL12_INTSEL8                    (*((volatile unsigned int*)(0x42A211A0UL)))
#define bM4_INTC_SEL13_INTSEL0                    (*((volatile unsigned int*)(0x42A21200UL)))
#define bM4_INTC_SEL13_INTSEL1                    (*((volatile unsigned int*)(0x42A21204UL)))
#define bM4_INTC_SEL13_INTSEL2                    (*((volatile unsigned int*)(0x42A21208UL)))
#define bM4_INTC_SEL13_INTSEL3                    (*((volatile unsigned int*)(0x42A2120CUL)))
#define bM4_INTC_SEL13_INTSEL4                    (*((volatile unsigned int*)(0x42A21210UL)))
