patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_INTC_VSSEL135_VSEL21                  (*((volatile unsigned int*)(0x42A24F54UL)))
#define bM4_INTC_VSSEL135_VSEL22                  (*((volatile unsigned int*)(0x42A24F58UL)))
#define bM4_INTC_VSSEL135_VSEL23                  (*((volatile unsigned int*)(0x42A24F5CUL)))
#define bM4_INTC_VSSEL135_VSEL24                  (*((volatile unsigned int*)(0x42A24F60UL)))
#define bM4_INTC_VSSEL135_VSEL25                  (*((volatile unsigned int*)(0x42A24F64UL)))
#define bM4_INTC_VSSEL135_VSEL26                  (*((volatile unsigned int*)(0x42A24F68UL)))
#define bM4_INTC_VSSEL135_VSEL27                  (*((volatile unsigned int*)(0x42A24F6CUL)))
#define bM4_INTC_VSSEL135_VSEL28                  (*((volatile unsigned int*)(0x42A24F70UL)))
#define bM4_INTC_VSSEL135_VSEL29                  (*((volatile unsigned int*)(0x42A24F74UL)))
#define bM4_INTC_VSSEL135_VSEL30                  (*((volatile unsigned int*)(0x42A24F78UL)))
#define bM4_INTC_VSSEL135_VSEL31                  (*((volatile unsigned int*)(0x42A24F7CUL)))
#define bM4_INTC_VSSEL136_VSEL0                   (*((volatile unsigned int*)(0x42A24F80UL)))
#define bM4_INTC_VSSEL136_VSEL1                   (*((volatile unsigned int*)(0x42A24F84UL)))
#define bM4_INTC_VSSEL136_VSEL2                   (*((volatile unsigned int*)(0x42A24F88UL)))
#define bM4_INTC_VSSEL136_VSEL3                   (*((volatile unsigned int*)(0x42A24F8CUL)))
#define bM4_INTC_VSSEL136_VSEL4                   (*((volatile unsigned int*)(0x42A24F90UL)))
#define bM4_INTC_VSSEL136_VSEL5                   (*((volatile unsigned int*)(0x42A24F94UL)))
#define bM4_INTC_VSSEL136_VSEL6                   (*((volatile unsigned int*)(0x42A24F98UL)))
#define bM4_INTC_VSSEL136_VSEL7                   (*((volatile unsigned int*)(0x42A24F9CUL)))
#define bM4_INTC_VSSEL136_VSEL8                   (*((volatile unsigned int*)(0x42A24FA0UL)))
#define bM4_INTC_VSSEL136_VSEL9                   (*((volatile unsigned int*)(0x42A24FA4UL)))
#define bM4_INTC_VSSEL136_VSEL10                  (*((volatile unsigned int*)(0x42A24FA8UL)))
#define bM4_INTC_VSSEL136_VSEL11                  (*((volatile unsigned int*)(0x42A24FACUL)))
#define bM4_INTC_VSSEL136_VSEL12                  (*((volatile unsigned int*)(0x42A24FB0UL)))
#define bM4_INTC_VSSEL136_VSEL13                  (*((volatile unsigned int*)(0x42A24FB4UL)))
#define bM4_INTC_VSSEL136_VSEL14                  (*((volatile unsigned int*)(0x42A24FB8UL)))
#define bM4_INTC_VSSEL136_VSEL15                  (*((volatile unsigned int*)(0x42A24FBCUL)))
#define bM4_INTC_VSSEL136_VSEL16                  (*((volatile unsigned int*)(0x42A24FC0UL)))
#define bM4_INTC_VSSEL136_VSEL17                  (*((volatile unsigned int*)(0x42A24FC4UL)))
#define bM4_INTC_VSSEL136_VSEL18                  (*((volatile unsigned int*)(0x42A24FC8UL)))
#define bM4_INTC_VSSEL136_VSEL19                  (*((volatile unsigned int*)(0x42A24FCCUL)))
#define bM4_INTC_VSSEL136_VSEL20                  (*((volatile unsigned int*)(0x42A24FD0UL)))
#define bM4_INTC_VSSEL136_VSEL21                  (*((volatile unsigned int*)(0x42A24FD4UL)))
#define bM4_INTC_VSSEL136_VSEL22                  (*((volatile unsigned int*)(0x42A24FD8UL)))
#define bM4_INTC_VSSEL136_VSEL23                  (*((volatile unsigned int*)(0x42A24FDCUL)))
#define bM4_INTC_VSSEL136_VSEL24                  (*((volatile unsigned int*)(0x42A24FE0UL)))
#define bM4_INTC_VSSEL136_VSEL25                  (*((volatile unsigned int*)(0x42A24FE4UL)))
#define bM4_INTC_VSSEL136_VSEL26                  (*((volatile unsigned int*)(0x42A24FE8UL)))
#define bM4_INTC_VSSEL136_VSEL27                  (*((volatile unsigned int*)(0x42A24FECUL)))
#define bM4_INTC_VSSEL136_VSEL28                  (*((volatile unsigned int*)(0x42A24FF0UL)))
#define bM4_INTC_VSSEL136_VSEL29                  (*((volatile unsigned int*)(0x42A24FF4UL)))
#define bM4_INTC_VSSEL136_VSEL30                  (*((volatile unsigned int*)(0x42A24FF8UL)))
#define bM4_INTC_VSSEL136_VSEL31                  (*((volatile unsigned int*)(0x42A24FFCUL)))
#define bM4_INTC_VSSEL137_VSEL0                   (*((volatile unsigned int*)(0x42A25000UL)))
#define bM4_INTC_VSSEL137_VSEL1                   (*((volatile unsigned int*)(0x42A25004UL)))
#define bM4_INTC_VSSEL137_VSEL2                   (*((volatile unsigned int*)(0x42A25008UL)))
#define bM4_INTC_VSSEL137_VSEL3                   (*((volatile unsigned int*)(0x42A2500CUL)))
#define bM4_INTC_VSSEL137_VSEL4                   (*((volatile unsigned int*)(0x42A25010UL)))
#define bM4_INTC_VSSEL137_VSEL5                   (*((volatile unsigned int*)(0x42A25014UL)))
#define bM4_INTC_VSSEL137_VSEL6                   (*((volatile unsigned int*)(0x42A25018UL)))
#define bM4_INTC_VSSEL137_VSEL7                   (*((volatile unsigned int*)(0x42A2501CUL)))
#define bM4_INTC_VSSEL137_VSEL8                   (*((volatile unsigned int*)(0x42A25020UL)))
#define bM4_INTC_VSSEL137_VSEL9                   (*((volatile unsigned int*)(0x42A25024UL)))
#define bM4_INTC_VSSEL137_VSEL10                  (*((volatile unsigned int*)(0x42A25028UL)))
#define bM4_INTC_VSSEL137_VSEL11                  (*((volatile unsigned int*)(0x42A2502CUL)))
#define bM4_INTC_VSSEL137_VSEL12                  (*((volatile unsigned int*)(0x42A25030UL)))
#define bM4_INTC_VSSEL137_VSEL13                  (*((volatile unsigned int*)(0x42A25034UL)))
#define bM4_INTC_VSSEL137_VSEL14                  (*((volatile unsigned int*)(0x42A25038UL)))
#define bM4_INTC_VSSEL137_VSEL15                  (*((volatile unsigned int*)(0x42A2503CUL)))
#define bM4_INTC_VSSEL137_VSEL16                  (*((volatile unsigned int*)(0x42A25040UL)))
#define bM4_INTC_VSSEL137_VSEL17                  (*((volatile unsigned int*)(0x42A25044UL)))
#define bM4_INTC_VSSEL137_VSEL18                  (*((volatile unsigned int*)(0x42A25048UL)))
#define bM4_INTC_VSSEL137_VSEL19                  (*((volatile unsigned int*)(0x42A2504CUL)))
#define bM4_INTC_VSSEL137_VSEL20                  (*((volatile unsigned int*)(0x42A25050UL)))
#define bM4_INTC_VSSEL137_VSEL21                  (*((volatile unsigned int*)(0x42A25054UL)))
#define bM4_INTC_VSSEL137_VSEL22                  (*((volatile unsigned int*)(0x42A25058UL)))
#define bM4_INTC_VSSEL137_VSEL23                  (*((volatile unsigned int*)(0x42A2505CUL)))
#define bM4_INTC_VSSEL137_VSEL24                  (*((volatile unsigned int*)(0x42A25060UL)))
#define bM4_INTC_VSSEL137_VSEL25                  (*((volatile unsigned int*)(0x42A25064UL)))
#define bM4_INTC_VSSEL137_VSEL26                  (*((volatile unsigned int*)(0x42A25068UL)))
#define bM4_INTC_VSSEL137_VSEL27                  (*((volatile unsigned int*)(0x42A2506CUL)))
#define bM4_INTC_VSSEL137_VSEL28                  (*((volatile unsigned int*)(0x42A25070UL)))
#define bM4_INTC_VSSEL137_VSEL29                  (*((volatile unsigned int*)(0x42A25074UL)))
#define bM4_INTC_VSSEL137_VSEL30                  (*((volatile unsigned int*)(0x42A25078UL)))
#define bM4_INTC_VSSEL137_VSEL31                  (*((volatile unsigned int*)(0x42A2507CUL)))
#define bM4_INTC_VSSEL138_VSEL0                   (*((volatile unsigned int*)(0x42A25080UL)))
#define bM4_INTC_VSSEL138_VSEL1                   (*((volatile unsigned int*)(0x42A25084UL)))
#define bM4_INTC_VSSEL138_VSEL2                   (*((volatile unsigned int*)(0x42A25088UL)))
#define bM4_INTC_VSSEL138_VSEL3                   (*((volatile unsigned int*)(0x42A2508CUL)))
#define bM4_INTC_VSSEL138_VSEL4                   (*((volatile unsigned int*)(0x42A25090UL)))
#define bM4_INTC_VSSEL138_VSEL5                   (*((volatile unsigned int*)(0x42A25094UL)))
#define bM4_INTC_VSSEL138_VSEL6                   (*((volatile unsigned int*)(0x42A25098UL)))
#define bM4_INTC_VSSEL138_VSEL7                   (*((volatile unsigned int*)(0x42A2509CUL)))
#define bM4_INTC_VSSEL138_VSEL8                   (*((volatile unsigned int*)(0x42A250A0UL)))
#define bM4_INTC_VSSEL138_VSEL9                   (*((volatile unsigned int*)(0x42A250A4UL)))
#define bM4_INTC_VSSEL138_VSEL10                  (*((volatile unsigned int*)(0x42A250A8UL)))
#define bM4_INTC_VSSEL138_VSEL11                  (*((volatile unsigned int*)(0x42A250ACUL)))
#define bM4_INTC_VSSEL138_VSEL12                  (*((volatile unsigned int*)(0x42A250B0UL)))
#define bM4_INTC_VSSEL138_VSEL13                  (*((volatile unsigned int*)(0x42A250B4UL)))
#define bM4_INTC_VSSEL138_VSEL14                  (*((volatile unsigned int*)(0x42A250B8UL)))
#define bM4_INTC_VSSEL138_VSEL15                  (*((volatile unsigned int*)(0x42A250BCUL)))
#define bM4_INTC_VSSEL138_VSEL16                  (*((volatile unsigned int*)(0x42A250C0UL)))
#define bM4_INTC_VSSEL138_VSEL17                  (*((volatile unsigned int*)(0x42A250C4UL)))
#define bM4_INTC_VSSEL138_VSEL18                  (*((volatile unsigned int*)(0x42A250C8UL)))
#define bM4_INTC_VSSEL138_VSEL19                  (*((volatile unsigned int*)(0x42A250CCUL)))
#define bM4_INTC_VSSEL138_VSEL20                  (*((volatile unsigned int*)(0x42A250D0UL)))
#define bM4_INTC_VSSEL138_VSEL21                  (*((volatile unsigned int*)(0x42A250D4UL)))
#define bM4_INTC_VSSEL138_VSEL22                  (*((volatile unsigned int*)(0x42A250D8UL)))
#define bM4_INTC_VSSEL138_VSEL23                  (*((volatile unsigned int*)(0x42A250DCUL)))
#define bM4_INTC_VSSEL138_VSEL24                  (*((volatile unsigned int*)(0x42A250E0UL)))
#define bM4_INTC_VSSEL138_VSEL25                  (*((volatile unsigned int*)(0x42A250E4UL)))
#define bM4_INTC_VSSEL138_VSEL26                  (*((volatile unsigned int*)(0x42A250E8UL)))
#define bM4_INTC_VSSEL138_VSEL27                  (*((volatile unsigned int*)(0x42A250ECUL)))
#define bM4_INTC_VSSEL138_VSEL28                  (*((volatile unsigned int*)(0x42A250F0UL)))
#define bM4_INTC_VSSEL138_VSEL29                  (*((volatile unsigned int*)(0x42A250F4UL)))
#define bM4_INTC_VSSEL138_VSEL30                  (*((volatile unsigned int*)(0x42A250F8UL)))
#define bM4_INTC_VSSEL138_VSEL31                  (*((volatile unsigned int*)(0x42A250FCUL)))
#define bM4_INTC_VSSEL139_VSEL0                   (*((volatile unsigned int*)(0x42A25100UL)))
#define bM4_INTC_VSSEL139_VSEL1                   (*((volatile unsigned int*)(0x42A25104UL)))
#define bM4_INTC_VSSEL139_VSEL2                   (*((volatile unsigned int*)(0x42A25108UL)))
#define bM4_INTC_VSSEL139_VSEL3                   (*((volatile unsigned int*)(0x42A2510CUL)))
#define bM4_INTC_VSSEL139_VSEL4                   (*((volatile unsigned int*)(0x42A25110UL)))
#define bM4_INTC_VSSEL139_VSEL5                   (*((volatile unsigned int*)(0x42A25114UL)))
#define bM4_INTC_VSSEL139_VSEL6                   (*((volatile unsigned int*)(0x42A25118UL)))
#define bM4_INTC_VSSEL139_VSEL7                   (*((volatile unsigned int*)(0x42A2511CUL)))
#define bM4_INTC_VSSEL139_VSEL8                   (*((volatile unsigned int*)(0x42A25120UL)))
#define bM4_INTC_VSSEL139_VSEL9                   (*((volatile unsigned int*)(0x42A25124UL)))
#define bM4_INTC_VSSEL139_VSEL10                  (*((volatile unsigned int*)(0x42A25128UL)))
#define bM4_INTC_VSSEL139_VSEL11                  (*((volatile unsigned int*)(0x42A2512CUL)))
#define bM4_INTC_VSSEL139_VSEL12                  (*((volatile unsigned int*)(0x42A25130UL)))
#define bM4_INTC_VSSEL139_VSEL13                  (*((volatile unsigned int*)(0x42A25134UL)))
#define bM4_INTC_VSSEL139_VSEL14                  (*((volatile unsigned int*)(0x42A25138UL)))
#define bM4_INTC_VSSEL139_VSEL15                  (*((volatile unsigned int*)(0x42A2513CUL)))
#define bM4_INTC_VSSEL139_VSEL16                  (*((volatile unsigned int*)(0x42A25140UL)))
#define bM4_INTC_VSSEL139_VSEL17                  (*((volatile unsigned int*)(0x42A25144UL)))
#define bM4_INTC_VSSEL139_VSEL18                  (*((volatile unsigned int*)(0x42A25148UL)))
#define bM4_INTC_VSSEL139_VSEL19                  (*((volatile unsigned int*)(0x42A2514CUL)))
#define bM4_INTC_VSSEL139_VSEL20                  (*((volatile unsigned int*)(0x42A25150UL)))
#define bM4_INTC_VSSEL139_VSEL21                  (*((volatile unsigned int*)(0x42A25154UL)))
#define bM4_INTC_VSSEL139_VSEL22                  (*((volatile unsigned int*)(0x42A25158UL)))
#define bM4_INTC_VSSEL139_VSEL23                  (*((volatile unsigned int*)(0x42A2515CUL)))
#define bM4_INTC_VSSEL139_VSEL24                  (*((volatile unsigned int*)(0x42A25160UL)))
#define bM4_INTC_VSSEL139_VSEL25                  (*((volatile unsigned int*)(0x42A25164UL)))
#define bM4_INTC_VSSEL139_VSEL26                  (*((volatile unsigned int*)(0x42A25168UL)))
#define bM4_INTC_VSSEL139_VSEL27                  (*((volatile unsigned int*)(0x42A2516CUL)))
#define bM4_INTC_VSSEL139_VSEL28                  (*((volatile unsigned int*)(0x42A25170UL)))
#define bM4_INTC_VSSEL139_VSEL29                  (*((volatile unsigned int*)(0x42A25174UL)))
#define bM4_INTC_VSSEL139_VSEL30                  (*((volatile unsigned int*)(0x42A25178UL)))
#define bM4_INTC_VSSEL139_VSEL31                  (*((volatile unsigned int*)(0x42A2517CUL)))
#define bM4_INTC_VSSEL140_VSEL0                   (*((volatile unsigned int*)(0x42A25180UL)))
#define bM4_INTC_VSSEL140_VSEL1                   (*((volatile unsigned int*)(0x42A25184UL)))
#define bM4_INTC_VSSEL140_VSEL2                   (*((volatile unsigned int*)(0x42A25188UL)))
#define bM4_INTC_VSSEL140_VSEL3                   (*((volatile unsigned int*)(0x42A2518CUL)))
#define bM4_INTC_VSSEL140_VSEL4                   (*((volatile unsigned int*)(0x42A25190UL)))
#define bM4_INTC_VSSEL140_VSEL5                   (*((volatile unsigned int*)(0x42A25194UL)))
#define bM4_INTC_VSSEL140_VSEL6                   (*((volatile unsigned int*)(0x42A25198UL)))
#define bM4_INTC_VSSEL140_VSEL7                   (*((volatile unsigned int*)(0x42A2519CUL)))
#define bM4_INTC_VSSEL140_VSEL8                   (*((volatile unsigned int*)(0x42A251A0UL)))
#define bM4_INTC_VSSEL140_VSEL9                   (*((volatile unsigned int*)(0x42A251A4UL)))
#define bM4_INTC_VSSEL140_VSEL10                  (*((volatile unsigned int*)(0x42A251A8UL)))
#define bM4_INTC_VSSEL140_VSEL11                  (*((volatile unsigned int*)(0x42A251ACUL)))
#define bM4_INTC_VSSEL140_VSEL12                  (*((volatile unsigned int*)(0x42A251B0UL)))
#define bM4_INTC_VSSEL140_VSEL13                  (*((volatile unsigned int*)(0x42A251B4UL)))
#define bM4_INTC_VSSEL140_VSEL14                  (*((volatile unsigned int*)(0x42A251B8UL)))
#define bM4_INTC_VSSEL140_VSEL15                  (*((volatile unsigned int*)(0x42A251BCUL)))
#define bM4_INTC_VSSEL140_VSEL16                  (*((volatile unsigned int*)(0x42A251C0UL)))
#define bM4_INTC_VSSEL140_VSEL17                  (*((volatile unsigned int*)(0x42A251C4UL)))
#define bM4_INTC_VSSEL140_VSEL18                  (*((volatile unsigned int*)(0x42A251C8UL)))
#define bM4_INTC_VSSEL140_VSEL19                  (*((volatile unsigned int*)(0x42A251CCUL)))
#define bM4_INTC_VSSEL140_VSEL20                  (*((volatile unsigned int*)(0x42A251D0UL)))
#define bM4_INTC_VSSEL140_VSEL21                  (*((volatile unsigned int*)(0x42A251D4UL)))
#define bM4_INTC_VSSEL140_VSEL22                  (*((volatile unsigned int*)(0x42A251D8UL)))
#define bM4_INTC_VSSEL140_VSEL23                  (*((volatile unsigned int*)(0x42A251DCUL)))
#define bM4_INTC_VSSEL140_VSEL24                  (*((volatile unsigned int*)(0x42A251E0UL)))
#define bM4_INTC_VSSEL140_VSEL25                  (*((volatile unsigned int*)(0x42A251E4UL)))
#define bM4_INTC_VSSEL140_VSEL26                  (*((volatile unsigned int*)(0x42A251E8UL)))
#define bM4_INTC_VSSEL140_VSEL27                  (*((volatile unsigned int*)(0x42A251ECUL)))
#define bM4_INTC_VSSEL140_VSEL28                  (*((volatile unsigned int*)(0x42A251F0UL)))
#define bM4_INTC_VSSEL140_VSEL29                  (*((volatile unsigned int*)(0x42A251F4UL)))
#define bM4_INTC_VSSEL140_VSEL30                  (*((volatile unsigned int*)(0x42A251F8UL)))
#define bM4_INTC_VSSEL140_VSEL31                  (*((volatile unsigned int*)(0x42A251FCUL)))
#define bM4_INTC_VSSEL141_VSEL0                   (*((volatile unsigned int*)(0x42A25200UL)))
#define bM4_INTC_VSSEL141_VSEL1                   (*((volatile unsigned int*)(0x42A25204UL)))
#define bM4_INTC_VSSEL141_VSEL2                   (*((volatile unsigned int*)(0x42A25208UL)))
#define bM4_INTC_VSSEL141_VSEL3                   (*((volatile unsigned int*)(0x42A2520CUL)))
#define bM4_INTC_VSSEL141_VSEL4                   (*((volatile unsigned int*)(0x42A25210UL)))
#define bM4_INTC_VSSEL141_VSEL5                   (*((volatile unsigned int*)(0x42A25214UL)))
#define bM4_INTC_VSSEL141_VSEL6                   (*((volatile unsigned int*)(0x42A25218UL)))
#define bM4_INTC_VSSEL141_VSEL7                   (*((volatile unsigned int*)(0x42A2521CUL)))
#define bM4_INTC_VSSEL141_VSEL8                   (*((volatile unsigned int*)(0x42A25220UL)))
#define bM4_INTC_VSSEL141_VSEL9                   (*((volatile unsigned int*)(0x42A25224UL)))
#define bM4_INTC_VSSEL141_VSEL10                  (*((volatile unsigned int*)(0x42A25228UL)))
#define bM4_INTC_VSSEL141_VSEL11                  (*((volatile unsigned int*)(0x42A2522CUL)))
#define bM4_INTC_VSSEL141_VSEL12                  (*((volatile unsigned int*)(0x42A25230UL)))
#define bM4_INTC_VSSEL141_VSEL13                  (*((volatile unsigned int*)(0x42A25234UL)))
#define bM4_INTC_VSSEL141_VSEL14                  (*((volatile unsigned int*)(0x42A25238UL)))
#define bM4_INTC_VSSEL141_VSEL15                  (*((volatile unsigned int*)(0x42A2523CUL)))
#define bM4_INTC_VSSEL141_VSEL16                  (*((volatile unsigned int*)(0x42A25240UL)))
#define bM4_INTC_VSSEL141_VSEL17                  (*((volatile unsigned int*)(0x42A25244UL)))
#define bM4_INTC_VSSEL141_VSEL18                  (*((volatile unsigned int*)(0x42A25248UL)))
#define bM4_INTC_VSSEL141_VSEL19                  (*((volatile unsigned int*)(0x42A2524CUL)))
#define bM4_INTC_VSSEL141_VSEL20                  (*((volatile unsigned int*)(0x42A25250UL)))
#define bM4_INTC_VSSEL141_VSEL21                  (*((volatile unsigned int*)(0x42A25254UL)))
#define bM4_INTC_VSSEL141_VSEL22                  (*((volatile unsigned int*)(0x42A25258UL)))
#define bM4_INTC_VSSEL141_VSEL23                  (*((volatile unsigned int*)(0x42A2525CUL)))
#define bM4_INTC_VSSEL141_VSEL24                  (*((volatile unsigned int*)(0x42A25260UL)))
#define bM4_INTC_VSSEL141_VSEL25                  (*((volatile unsigned int*)(0x42A25264UL)))
#define bM4_INTC_VSSEL141_VSEL26                  (*((volatile unsigned int*)(0x42A25268UL)))
#define bM4_INTC_VSSEL141_VSEL27                  (*((volatile unsigned int*)(0x42A2526CUL)))
#define bM4_INTC_VSSEL141_VSEL28                  (*((volatile unsigned int*)(0x42A25270UL)))
#define bM4_INTC_VSSEL141_VSEL29                  (*((volatile unsigned int*)(0x42A25274UL)))
#define bM4_INTC_VSSEL141_VSEL30                  (*((volatile unsigned int*)(0x42A25278UL)))
#define bM4_INTC_VSSEL141_VSEL31                  (*((volatile unsigned int*)(0x42A2527CUL)))
#define bM4_INTC_VSSEL142_VSEL0                   (*((volatile unsigned int*)(0x42A25280UL)))
#define bM4_INTC_VSSEL142_VSEL1                   (*((volatile unsigned int*)(0x42A25284UL)))
#define bM4_INTC_VSSEL142_VSEL2                   (*((volatile unsigned int*)(0x42A25288UL)))
#define bM4_INTC_VSSEL142_VSEL3                   (*((volatile unsigned int*)(0x42A2528CUL)))
#define bM4_INTC_VSSEL142_VSEL4                   (*((volatile unsigned int*)(0x42A25290UL)))
#define bM4_INTC_VSSEL142_VSEL5                   (*((volatile unsigned int*)(0x42A25294UL)))
#define bM4_INTC_VSSEL142_VSEL6                   (*((volatile unsigned int*)(0x42A25298UL)))
#define bM4_INTC_VSSEL142_VSEL7                   (*((volatile unsigned int*)(0x42A2529CUL)))
#define bM4_INTC_VSSEL142_VSEL8                   (*((volatile unsigned int*)(0x42A252A0UL)))
#define bM4_INTC_VSSEL142_VSEL9                   (*((volatile unsigned int*)(0x42A252A4UL)))
#define bM4_INTC_VSSEL142_VSEL10                  (*((volatile unsigned int*)(0x42A252A8UL)))
#define bM4_INTC_VSSEL142_VSEL11                  (*((volatile unsigned int*)(0x42A252ACUL)))
#define bM4_INTC_VSSEL142_VSEL12                  (*((volatile unsigned int*)(0x42A252B0UL)))
#define bM4_INTC_VSSEL142_VSEL13                  (*((volatile unsigned int*)(0x42A252B4UL)))
#define bM4_INTC_VSSEL142_VSEL14                  (*((volatile unsigned int*)(0x42A252B8UL)))
#define bM4_INTC_VSSEL142_VSEL15                  (*((volatile unsigned int*)(0x42A252BCUL)))
#define bM4_INTC_VSSEL142_VSEL16                  (*((volatile unsigned int*)(0x42A252C0UL)))
#define bM4_INTC_VSSEL142_VSEL17                  (*((volatile unsigned int*)(0x42A252C4UL)))
#define bM4_INTC_VSSEL142_VSEL18                  (*((volatile unsigned int*)(0x42A252C8UL)))
#define bM4_INTC_VSSEL142_VSEL19                  (*((volatile unsigned int*)(0x42A252CCUL)))
#define bM4_INTC_VSSEL142_VSEL20                  (*((volatile unsigned int*)(0x42A252D0UL)))
#define bM4_INTC_VSSEL142_VSEL21                  (*((volatile unsigned int*)(0x42A252D4UL)))
#define bM4_INTC_VSSEL142_VSEL22                  (*((volatile unsigned int*)(0x42A252D8UL)))
#define bM4_INTC_VSSEL142_VSEL23                  (*((volatile unsigned int*)(0x42A252DCUL)))
#define bM4_INTC_VSSEL142_VSEL24                  (*((volatile unsigned int*)(0x42A252E0UL)))
#define bM4_INTC_VSSEL142_VSEL25                  (*((volatile unsigned int*)(0x42A252E4UL)))
#define bM4_INTC_VSSEL142_VSEL26                  (*((volatile unsigned int*)(0x42A252E8UL)))
#define bM4_INTC_VSSEL142_VSEL27                  (*((volatile unsigned int*)(0x42A252ECUL)))
#define bM4_INTC_VSSEL142_VSEL28                  (*((volatile unsigned int*)(0x42A252F0UL)))
#define bM4_INTC_VSSEL142_VSEL29                  (*((volatile unsigned int*)(0x42A252F4UL)))
#define bM4_INTC_VSSEL142_VSEL30                  (*((volatile unsigned int*)(0x42A252F8UL)))
#define bM4_INTC_VSSEL142_VSEL31                  (*((volatile unsigned int*)(0x42A252FCUL)))
#define bM4_INTC_VSSEL143_VSEL0                   (*((volatile unsigned int*)(0x42A25300UL)))
#define bM4_INTC_VSSEL143_VSEL1                   (*((volatile unsigned int*)(0x42A25304UL)))
#define bM4_INTC_VSSEL143_VSEL2                   (*((volatile unsigned int*)(0x42A25308UL)))
#define bM4_INTC_VSSEL143_VSEL3                   (*((volatile unsigned int*)(0x42A2530CUL)))
#define bM4_INTC_VSSEL143_VSEL4                   (*((volatile unsigned int*)(0x42A25310UL)))
#define bM4_INTC_VSSEL143_VSEL5                   (*((volatile unsigned int*)(0x42A25314UL)))
#define bM4_INTC_VSSEL143_VSEL6                   (*((volatile unsigned int*)(0x42A25318UL)))
#define bM4_INTC_VSSEL143_VSEL7                   (*((volatile unsigned int*)(0x42A2531CUL)))
#define bM4_INTC_VSSEL143_VSEL8                   (*((volatile unsigned int*)(0x42A25320UL)))
#define bM4_INTC_VSSEL143_VSEL9                   (*((volatile unsigned int*)(0x42A25324UL)))
#define bM4_INTC_VSSEL143_VSEL10                  (*((volatile unsigned int*)(0x42A25328UL)))
#define bM4_INTC_VSSEL143_VSEL11                  (*((volatile unsigned int*)(0x42A2532CUL)))
#define bM4_INTC_VSSEL143_VSEL12                  (*((volatile unsigned int*)(0x42A25330UL)))
#define bM4_INTC_VSSEL143_VSEL13                  (*((volatile unsigned int*)(0x42A25334UL)))
#define bM4_INTC_VSSEL143_VSEL14                  (*((volatile unsigned int*)(0x42A25338UL)))
#define bM4_INTC_VSSEL143_VSEL15                  (*((volatile unsigned int*)(0x42A2533CUL)))
#define bM4_INTC_VSSEL143_VSEL16                  (*((volatile unsigned int*)(0x42A25340UL)))
#define bM4_INTC_VSSEL143_VSEL17                  (*((volatile unsigned int*)(0x42A25344UL)))
#define bM4_INTC_VSSEL143_VSEL18                  (*((volatile unsigned int*)(0x42A25348UL)))
#define bM4_INTC_VSSEL143_VSEL19                  (*((volatile unsigned int*)(0x42A2534CUL)))
