patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_INTC_VSSEL143_VSEL20                  (*((volatile unsigned int*)(0x42A25350UL)))
#define bM4_INTC_VSSEL143_VSEL21                  (*((volatile unsigned int*)(0x42A25354UL)))
#define bM4_INTC_VSSEL143_VSEL22                  (*((volatile unsigned int*)(0x42A25358UL)))
#define bM4_INTC_VSSEL143_VSEL23                  (*((volatile unsigned int*)(0x42A2535CUL)))
#define bM4_INTC_VSSEL143_VSEL24                  (*((volatile unsigned int*)(0x42A25360UL)))
#define bM4_INTC_VSSEL143_VSEL25                  (*((volatile unsigned int*)(0x42A25364UL)))
#define bM4_INTC_VSSEL143_VSEL26                  (*((volatile unsigned int*)(0x42A25368UL)))
#define bM4_INTC_VSSEL143_VSEL27                  (*((volatile unsigned int*)(0x42A2536CUL)))
#define bM4_INTC_VSSEL143_VSEL28                  (*((volatile unsigned int*)(0x42A25370UL)))
#define bM4_INTC_VSSEL143_VSEL29                  (*((volatile unsigned int*)(0x42A25374UL)))
#define bM4_INTC_VSSEL143_VSEL30                  (*((volatile unsigned int*)(0x42A25378UL)))
#define bM4_INTC_VSSEL143_VSEL31                  (*((volatile unsigned int*)(0x42A2537CUL)))
#define bM4_INTC_SWIER_SWIE0                      (*((volatile unsigned int*)(0x42A25380UL)))
#define bM4_INTC_SWIER_SWIE1                      (*((volatile unsigned int*)(0x42A25384UL)))
#define bM4_INTC_SWIER_SWIE2                      (*((volatile unsigned int*)(0x42A25388UL)))
#define bM4_INTC_SWIER_SWIE3                      (*((volatile unsigned int*)(0x42A2538CUL)))
#define bM4_INTC_SWIER_SWIE4                      (*((volatile unsigned int*)(0x42A25390UL)))
#define bM4_INTC_SWIER_SWIE5                      (*((volatile unsigned int*)(0x42A25394UL)))
#define bM4_INTC_SWIER_SWIE6                      (*((volatile unsigned int*)(0x42A25398UL)))
#define bM4_INTC_SWIER_SWIE7                      (*((volatile unsigned int*)(0x42A2539CUL)))
#define bM4_INTC_SWIER_SWIE8                      (*((volatile unsigned int*)(0x42A253A0UL)))
#define bM4_INTC_SWIER_SWIE9                      (*((volatile unsigned int*)(0x42A253A4UL)))
#define bM4_INTC_SWIER_SWIE10                     (*((volatile unsigned int*)(0x42A253A8UL)))
#define bM4_INTC_SWIER_SWIE11                     (*((volatile unsigned int*)(0x42A253ACUL)))
#define bM4_INTC_SWIER_SWIE12                     (*((volatile unsigned int*)(0x42A253B0UL)))
#define bM4_INTC_SWIER_SWIE13                     (*((volatile unsigned int*)(0x42A253B4UL)))
#define bM4_INTC_SWIER_SWIE14                     (*((volatile unsigned int*)(0x42A253B8UL)))
#define bM4_INTC_SWIER_SWIE15                     (*((volatile unsigned int*)(0x42A253BCUL)))
#define bM4_INTC_SWIER_SWIE16                     (*((volatile unsigned int*)(0x42A253C0UL)))
#define bM4_INTC_SWIER_SWIE17                     (*((volatile unsigned int*)(0x42A253C4UL)))
#define bM4_INTC_SWIER_SWIE18                     (*((volatile unsigned int*)(0x42A253C8UL)))
#define bM4_INTC_SWIER_SWIE19                     (*((volatile unsigned int*)(0x42A253CCUL)))
#define bM4_INTC_SWIER_SWIE20                     (*((volatile unsigned int*)(0x42A253D0UL)))
#define bM4_INTC_SWIER_SWIE21                     (*((volatile unsigned int*)(0x42A253D4UL)))
#define bM4_INTC_SWIER_SWIE22                     (*((volatile unsigned int*)(0x42A253D8UL)))
#define bM4_INTC_SWIER_SWIE23                     (*((volatile unsigned int*)(0x42A253DCUL)))
#define bM4_INTC_SWIER_SWIE24                     (*((volatile unsigned int*)(0x42A253E0UL)))
#define bM4_INTC_SWIER_SWIE25                     (*((volatile unsigned int*)(0x42A253E4UL)))
#define bM4_INTC_SWIER_SWIE26                     (*((volatile unsigned int*)(0x42A253E8UL)))
#define bM4_INTC_SWIER_SWIE27                     (*((volatile unsigned int*)(0x42A253ECUL)))
#define bM4_INTC_SWIER_SWIE28                     (*((volatile unsigned int*)(0x42A253F0UL)))
#define bM4_INTC_SWIER_SWIE29                     (*((volatile unsigned int*)(0x42A253F4UL)))
#define bM4_INTC_SWIER_SWIE30                     (*((volatile unsigned int*)(0x42A253F8UL)))
#define bM4_INTC_SWIER_SWIE31                     (*((volatile unsigned int*)(0x42A253FCUL)))
#define bM4_INTC_EVTER_EVTE0                      (*((volatile unsigned int*)(0x42A25400UL)))
#define bM4_INTC_EVTER_EVTE1                      (*((volatile unsigned int*)(0x42A25404UL)))
#define bM4_INTC_EVTER_EVTE2                      (*((volatile unsigned int*)(0x42A25408UL)))
#define bM4_INTC_EVTER_EVTE3                      (*((volatile unsigned int*)(0x42A2540CUL)))
#define bM4_INTC_EVTER_EVTE4                      (*((volatile unsigned int*)(0x42A25410UL)))
#define bM4_INTC_EVTER_EVTE5                      (*((volatile unsigned int*)(0x42A25414UL)))
#define bM4_INTC_EVTER_EVTE6                      (*((volatile unsigned int*)(0x42A25418UL)))
#define bM4_INTC_EVTER_EVTE7                      (*((volatile unsigned int*)(0x42A2541CUL)))
#define bM4_INTC_EVTER_EVTE8                      (*((volatile unsigned int*)(0x42A25420UL)))
#define bM4_INTC_EVTER_EVTE9                      (*((volatile unsigned int*)(0x42A25424UL)))
#define bM4_INTC_EVTER_EVTE10                     (*((volatile unsigned int*)(0x42A25428UL)))
#define bM4_INTC_EVTER_EVTE11                     (*((volatile unsigned int*)(0x42A2542CUL)))
#define bM4_INTC_EVTER_EVTE12                     (*((volatile unsigned int*)(0x42A25430UL)))
#define bM4_INTC_EVTER_EVTE13                     (*((volatile unsigned int*)(0x42A25434UL)))
#define bM4_INTC_EVTER_EVTE14                     (*((volatile unsigned int*)(0x42A25438UL)))
#define bM4_INTC_EVTER_EVTE15                     (*((volatile unsigned int*)(0x42A2543CUL)))
#define bM4_INTC_EVTER_EVTE16                     (*((volatile unsigned int*)(0x42A25440UL)))
#define bM4_INTC_EVTER_EVTE17                     (*((volatile unsigned int*)(0x42A25444UL)))
#define bM4_INTC_EVTER_EVTE18                     (*((volatile unsigned int*)(0x42A25448UL)))
#define bM4_INTC_EVTER_EVTE19                     (*((volatile unsigned int*)(0x42A2544CUL)))
#define bM4_INTC_EVTER_EVTE20                     (*((volatile unsigned int*)(0x42A25450UL)))
#define bM4_INTC_EVTER_EVTE21                     (*((volatile unsigned int*)(0x42A25454UL)))
#define bM4_INTC_EVTER_EVTE22                     (*((volatile unsigned int*)(0x42A25458UL)))
#define bM4_INTC_EVTER_EVTE23                     (*((volatile unsigned int*)(0x42A2545CUL)))
#define bM4_INTC_EVTER_EVTE24                     (*((volatile unsigned int*)(0x42A25460UL)))
#define bM4_INTC_EVTER_EVTE25                     (*((volatile unsigned int*)(0x42A25464UL)))
#define bM4_INTC_EVTER_EVTE26                     (*((volatile unsigned int*)(0x42A25468UL)))
#define bM4_INTC_EVTER_EVTE27                     (*((volatile unsigned int*)(0x42A2546CUL)))
#define bM4_INTC_EVTER_EVTE28                     (*((volatile unsigned int*)(0x42A25470UL)))
#define bM4_INTC_EVTER_EVTE29                     (*((volatile unsigned int*)(0x42A25474UL)))
#define bM4_INTC_EVTER_EVTE30                     (*((volatile unsigned int*)(0x42A25478UL)))
#define bM4_INTC_EVTER_EVTE31                     (*((volatile unsigned int*)(0x42A2547CUL)))
#define bM4_INTC_IER_IER0                         (*((volatile unsigned int*)(0x42A25480UL)))
#define bM4_INTC_IER_IER1                         (*((volatile unsigned int*)(0x42A25484UL)))
#define bM4_INTC_IER_IER2                         (*((volatile unsigned int*)(0x42A25488UL)))
#define bM4_INTC_IER_IER3                         (*((volatile unsigned int*)(0x42A2548CUL)))
#define bM4_INTC_IER_IER4                         (*((volatile unsigned int*)(0x42A25490UL)))
#define bM4_INTC_IER_IER5                         (*((volatile unsigned int*)(0x42A25494UL)))
#define bM4_INTC_IER_IER6                         (*((volatile unsigned int*)(0x42A25498UL)))
#define bM4_INTC_IER_IER7                         (*((volatile unsigned int*)(0x42A2549CUL)))
#define bM4_INTC_IER_IER8                         (*((volatile unsigned int*)(0x42A254A0UL)))
#define bM4_INTC_IER_IER9                         (*((volatile unsigned int*)(0x42A254A4UL)))
#define bM4_INTC_IER_IER10                        (*((volatile unsigned int*)(0x42A254A8UL)))
#define bM4_INTC_IER_IER11                        (*((volatile unsigned int*)(0x42A254ACUL)))
#define bM4_INTC_IER_IER12                        (*((volatile unsigned int*)(0x42A254B0UL)))
#define bM4_INTC_IER_IER13                        (*((volatile unsigned int*)(0x42A254B4UL)))
#define bM4_INTC_IER_IER14                        (*((volatile unsigned int*)(0x42A254B8UL)))
#define bM4_INTC_IER_IER15                        (*((volatile unsigned int*)(0x42A254BCUL)))
#define bM4_INTC_IER_IER16                        (*((volatile unsigned int*)(0x42A254C0UL)))
#define bM4_INTC_IER_IER17                        (*((volatile unsigned int*)(0x42A254C4UL)))
#define bM4_INTC_IER_IER18                        (*((volatile unsigned int*)(0x42A254C8UL)))
#define bM4_INTC_IER_IER19                        (*((volatile unsigned int*)(0x42A254CCUL)))
#define bM4_INTC_IER_IER20                        (*((volatile unsigned int*)(0x42A254D0UL)))
#define bM4_INTC_IER_IER21                        (*((volatile unsigned int*)(0x42A254D4UL)))
#define bM4_INTC_IER_IER22                        (*((volatile unsigned int*)(0x42A254D8UL)))
#define bM4_INTC_IER_IER23                        (*((volatile unsigned int*)(0x42A254DCUL)))
#define bM4_INTC_IER_IER24                        (*((volatile unsigned int*)(0x42A254E0UL)))
#define bM4_INTC_IER_IER25                        (*((volatile unsigned int*)(0x42A254E4UL)))
#define bM4_INTC_IER_IER26                        (*((volatile unsigned int*)(0x42A254E8UL)))
#define bM4_INTC_IER_IER27                        (*((volatile unsigned int*)(0x42A254ECUL)))
#define bM4_INTC_IER_IER28                        (*((volatile unsigned int*)(0x42A254F0UL)))
#define bM4_INTC_IER_IER29                        (*((volatile unsigned int*)(0x42A254F4UL)))
#define bM4_INTC_IER_IER30                        (*((volatile unsigned int*)(0x42A254F8UL)))
#define bM4_INTC_IER_IER31                        (*((volatile unsigned int*)(0x42A254FCUL)))
#define bM4_KEYSCAN_SCR_KEYINSEL0                 (*((volatile unsigned int*)(0x42A18000UL)))
#define bM4_KEYSCAN_SCR_KEYINSEL1                 (*((volatile unsigned int*)(0x42A18004UL)))
#define bM4_KEYSCAN_SCR_KEYINSEL2                 (*((volatile unsigned int*)(0x42A18008UL)))
#define bM4_KEYSCAN_SCR_KEYINSEL3                 (*((volatile unsigned int*)(0x42A1800CUL)))
#define bM4_KEYSCAN_SCR_KEYINSEL4                 (*((volatile unsigned int*)(0x42A18010UL)))
#define bM4_KEYSCAN_SCR_KEYINSEL5                 (*((volatile unsigned int*)(0x42A18014UL)))
#define bM4_KEYSCAN_SCR_KEYINSEL6                 (*((volatile unsigned int*)(0x42A18018UL)))
#define bM4_KEYSCAN_SCR_KEYINSEL7                 (*((volatile unsigned int*)(0x42A1801CUL)))
#define bM4_KEYSCAN_SCR_KEYINSEL8                 (*((volatile unsigned int*)(0x42A18020UL)))
#define bM4_KEYSCAN_SCR_KEYINSEL9                 (*((volatile unsigned int*)(0x42A18024UL)))
#define bM4_KEYSCAN_SCR_KEYINSEL10                (*((volatile unsigned int*)(0x42A18028UL)))
#define bM4_KEYSCAN_SCR_KEYINSEL11                (*((volatile unsigned int*)(0x42A1802CUL)))
#define bM4_KEYSCAN_SCR_KEYINSEL12                (*((volatile unsigned int*)(0x42A18030UL)))
#define bM4_KEYSCAN_SCR_KEYINSEL13                (*((volatile unsigned int*)(0x42A18034UL)))
#define bM4_KEYSCAN_SCR_KEYINSEL14                (*((volatile unsigned int*)(0x42A18038UL)))
#define bM4_KEYSCAN_SCR_KEYINSEL15                (*((volatile unsigned int*)(0x42A1803CUL)))
#define bM4_KEYSCAN_SCR_KEYOUTSEL0                (*((volatile unsigned int*)(0x42A18040UL)))
#define bM4_KEYSCAN_SCR_KEYOUTSEL1                (*((volatile unsigned int*)(0x42A18044UL)))
#define bM4_KEYSCAN_SCR_KEYOUTSEL2                (*((volatile unsigned int*)(0x42A18048UL)))
#define bM4_KEYSCAN_SCR_CKSEL0                    (*((volatile unsigned int*)(0x42A18050UL)))
#define bM4_KEYSCAN_SCR_CKSEL1                    (*((volatile unsigned int*)(0x42A18054UL)))
#define bM4_KEYSCAN_SCR_T_LLEVEL0                 (*((volatile unsigned int*)(0x42A18060UL)))
#define bM4_KEYSCAN_SCR_T_LLEVEL1                 (*((volatile unsigned int*)(0x42A18064UL)))
#define bM4_KEYSCAN_SCR_T_LLEVEL2                 (*((volatile unsigned int*)(0x42A18068UL)))
#define bM4_KEYSCAN_SCR_T_LLEVEL3                 (*((volatile unsigned int*)(0x42A1806CUL)))
#define bM4_KEYSCAN_SCR_T_LLEVEL4                 (*((volatile unsigned int*)(0x42A18070UL)))
#define bM4_KEYSCAN_SCR_T_HIZ0                    (*((volatile unsigned int*)(0x42A18074UL)))
#define bM4_KEYSCAN_SCR_T_HIZ1                    (*((volatile unsigned int*)(0x42A18078UL)))
#define bM4_KEYSCAN_SCR_T_HIZ2                    (*((volatile unsigned int*)(0x42A1807CUL)))
#define bM4_KEYSCAN_SER_SEN                       (*((volatile unsigned int*)(0x42A18080UL)))
#define bM4_KEYSCAN_SSR_INDEX0                    (*((volatile unsigned int*)(0x42A18100UL)))
#define bM4_KEYSCAN_SSR_INDEX1                    (*((volatile unsigned int*)(0x42A18104UL)))
#define bM4_KEYSCAN_SSR_INDEX2                    (*((volatile unsigned int*)(0x42A18108UL)))
#define bM4_MPU_RGD0_MPURG0SIZE0                  (*((volatile unsigned int*)(0x42A00000UL)))
#define bM4_MPU_RGD0_MPURG0SIZE1                  (*((volatile unsigned int*)(0x42A00004UL)))
#define bM4_MPU_RGD0_MPURG0SIZE2                  (*((volatile unsigned int*)(0x42A00008UL)))
#define bM4_MPU_RGD0_MPURG0SIZE3                  (*((volatile unsigned int*)(0x42A0000CUL)))
#define bM4_MPU_RGD0_MPURG0SIZE4                  (*((volatile unsigned int*)(0x42A00010UL)))
#define bM4_MPU_RGD0_MPURG0ADDR0                  (*((volatile unsigned int*)(0x42A00014UL)))
#define bM4_MPU_RGD0_MPURG0ADDR1                  (*((volatile unsigned int*)(0x42A00018UL)))
#define bM4_MPU_RGD0_MPURG0ADDR2                  (*((volatile unsigned int*)(0x42A0001CUL)))
#define bM4_MPU_RGD0_MPURG0ADDR3                  (*((volatile unsigned int*)(0x42A00020UL)))
#define bM4_MPU_RGD0_MPURG0ADDR4                  (*((volatile unsigned int*)(0x42A00024UL)))
#define bM4_MPU_RGD0_MPURG0ADDR5                  (*((volatile unsigned int*)(0x42A00028UL)))
#define bM4_MPU_RGD0_MPURG0ADDR6                  (*((volatile unsigned int*)(0x42A0002CUL)))
#define bM4_MPU_RGD0_MPURG0ADDR7                  (*((volatile unsigned int*)(0x42A00030UL)))
#define bM4_MPU_RGD0_MPURG0ADDR8                  (*((volatile unsigned int*)(0x42A00034UL)))
#define bM4_MPU_RGD0_MPURG0ADDR9                  (*((volatile unsigned int*)(0x42A00038UL)))
#define bM4_MPU_RGD0_MPURG0ADDR10                 (*((volatile unsigned int*)(0x42A0003CUL)))
#define bM4_MPU_RGD0_MPURG0ADDR11                 (*((volatile unsigned int*)(0x42A00040UL)))
#define bM4_MPU_RGD0_MPURG0ADDR12                 (*((volatile unsigned int*)(0x42A00044UL)))
#define bM4_MPU_RGD0_MPURG0ADDR13                 (*((volatile unsigned int*)(0x42A00048UL)))
#define bM4_MPU_RGD0_MPURG0ADDR14                 (*((volatile unsigned int*)(0x42A0004CUL)))
#define bM4_MPU_RGD0_MPURG0ADDR15                 (*((volatile unsigned int*)(0x42A00050UL)))
#define bM4_MPU_RGD0_MPURG0ADDR16                 (*((volatile unsigned int*)(0x42A00054UL)))
#define bM4_MPU_RGD0_MPURG0ADDR17                 (*((volatile unsigned int*)(0x42A00058UL)))
#define bM4_MPU_RGD0_MPURG0ADDR18                 (*((volatile unsigned int*)(0x42A0005CUL)))
#define bM4_MPU_RGD0_MPURG0ADDR19                 (*((volatile unsigned int*)(0x42A00060UL)))
#define bM4_MPU_RGD0_MPURG0ADDR20                 (*((volatile unsigned int*)(0x42A00064UL)))
#define bM4_MPU_RGD0_MPURG0ADDR21                 (*((volatile unsigned int*)(0x42A00068UL)))
#define bM4_MPU_RGD0_MPURG0ADDR22                 (*((volatile unsigned int*)(0x42A0006CUL)))
#define bM4_MPU_RGD0_MPURG0ADDR23                 (*((volatile unsigned int*)(0x42A00070UL)))
#define bM4_MPU_RGD0_MPURG0ADDR24                 (*((volatile unsigned int*)(0x42A00074UL)))
#define bM4_MPU_RGD0_MPURG0ADDR25                 (*((volatile unsigned int*)(0x42A00078UL)))
#define bM4_MPU_RGD0_MPURG0ADDR26                 (*((volatile unsigned int*)(0x42A0007CUL)))
#define bM4_MPU_RGD1_MPURG1SIZE0                  (*((volatile unsigned int*)(0x42A00080UL)))
#define bM4_MPU_RGD1_MPURG1SIZE1                  (*((volatile unsigned int*)(0x42A00084UL)))
#define bM4_MPU_RGD1_MPURG1SIZE2                  (*((volatile unsigned int*)(0x42A00088UL)))
#define bM4_MPU_RGD1_MPURG1SIZE3                  (*((volatile unsigned int*)(0x42A0008CUL)))
#define bM4_MPU_RGD1_MPURG1SIZE4                  (*((volatile unsigned int*)(0x42A00090UL)))
#define bM4_MPU_RGD1_MPURG1ADDR0                  (*((volatile unsigned int*)(0x42A00094UL)))
#define bM4_MPU_RGD1_MPURG1ADDR1                  (*((volatile unsigned int*)(0x42A00098UL)))
#define bM4_MPU_RGD1_MPURG1ADDR2                  (*((volatile unsigned int*)(0x42A0009CUL)))
#define bM4_MPU_RGD1_MPURG1ADDR3                  (*((volatile unsigned int*)(0x42A000A0UL)))
#define bM4_MPU_RGD1_MPURG1ADDR4                  (*((volatile unsigned int*)(0x42A000A4UL)))
#define bM4_MPU_RGD1_MPURG1ADDR5                  (*((volatile unsigned int*)(0x42A000A8UL)))
#define bM4_MPU_RGD1_MPURG1ADDR6                  (*((volatile unsigned int*)(0x42A000ACUL)))
#define bM4_MPU_RGD1_MPURG1ADDR7                  (*((volatile unsigned int*)(0x42A000B0UL)))
#define bM4_MPU_RGD1_MPURG1ADDR8                  (*((volatile unsigned int*)(0x42A000B4UL)))
#define bM4_MPU_RGD1_MPURG1ADDR9                  (*((volatile unsigned int*)(0x42A000B8UL)))
#define bM4_MPU_RGD1_MPURG1ADDR10                 (*((volatile unsigned int*)(0x42A000BCUL)))
#define bM4_MPU_RGD1_MPURG1ADDR11                 (*((volatile unsigned int*)(0x42A000C0UL)))
#define bM4_MPU_RGD1_MPURG1ADDR12                 (*((volatile unsigned int*)(0x42A000C4UL)))
#define bM4_MPU_RGD1_MPURG1ADDR13                 (*((volatile unsigned int*)(0x42A000C8UL)))
#define bM4_MPU_RGD1_MPURG1ADDR14                 (*((volatile unsigned int*)(0x42A000CCUL)))
#define bM4_MPU_RGD1_MPURG1ADDR15                 (*((volatile unsigned int*)(0x42A000D0UL)))
#define bM4_MPU_RGD1_MPURG1ADDR16                 (*((volatile unsigned int*)(0x42A000D4UL)))
#define bM4_MPU_RGD1_MPURG1ADDR17                 (*((volatile unsigned int*)(0x42A000D8UL)))
#define bM4_MPU_RGD1_MPURG1ADDR18                 (*((volatile unsigned int*)(0x42A000DCUL)))
#define bM4_MPU_RGD1_MPURG1ADDR19                 (*((volatile unsigned int*)(0x42A000E0UL)))
#define bM4_MPU_RGD1_MPURG1ADDR20                 (*((volatile unsigned int*)(0x42A000E4UL)))
#define bM4_MPU_RGD1_MPURG1ADDR21                 (*((volatile unsigned int*)(0x42A000E8UL)))
#define bM4_MPU_RGD1_MPURG1ADDR22                 (*((volatile unsigned int*)(0x42A000ECUL)))
#define bM4_MPU_RGD1_MPURG1ADDR23                 (*((volatile unsigned int*)(0x42A000F0UL)))
#define bM4_MPU_RGD1_MPURG1ADDR24                 (*((volatile unsigned int*)(0x42A000F4UL)))
#define bM4_MPU_RGD1_MPURG1ADDR25                 (*((volatile unsigned int*)(0x42A000F8UL)))
#define bM4_MPU_RGD1_MPURG1ADDR26                 (*((volatile unsigned int*)(0x42A000FCUL)))
#define bM4_MPU_RGD2_MPURG2SIZE0                  (*((volatile unsigned int*)(0x42A00100UL)))
#define bM4_MPU_RGD2_MPURG2SIZE1                  (*((volatile unsigned int*)(0x42A00104UL)))
#define bM4_MPU_RGD2_MPURG2SIZE2                  (*((volatile unsigned int*)(0x42A00108UL)))
#define bM4_MPU_RGD2_MPURG2SIZE3                  (*((volatile unsigned int*)(0x42A0010CUL)))
#define bM4_MPU_RGD2_MPURG2SIZE4                  (*((volatile unsigned int*)(0x42A00110UL)))
#define bM4_MPU_RGD2_MPURG2ADDR0                  (*((volatile unsigned int*)(0x42A00114UL)))
#define bM4_MPU_RGD2_MPURG2ADDR1                  (*((volatile unsigned int*)(0x42A00118UL)))
#define bM4_MPU_RGD2_MPURG2ADDR2                  (*((volatile unsigned int*)(0x42A0011CUL)))
#define bM4_MPU_RGD2_MPURG2ADDR3                  (*((volatile unsigned int*)(0x42A00120UL)))
#define bM4_MPU_RGD2_MPURG2ADDR4                  (*((volatile unsigned int*)(0x42A00124UL)))
#define bM4_MPU_RGD2_MPURG2ADDR5                  (*((volatile unsigned int*)(0x42A00128UL)))
#define bM4_MPU_RGD2_MPURG2ADDR6                  (*((volatile unsigned int*)(0x42A0012CUL)))
#define bM4_MPU_RGD2_MPURG2ADDR7                  (*((volatile unsigned int*)(0x42A00130UL)))
#define bM4_MPU_RGD2_MPURG2ADDR8                  (*((volatile unsigned int*)(0x42A00134UL)))
#define bM4_MPU_RGD2_MPURG2ADDR9                  (*((volatile unsigned int*)(0x42A00138UL)))
#define bM4_MPU_RGD2_MPURG2ADDR10                 (*((volatile unsigned int*)(0x42A0013CUL)))
#define bM4_MPU_RGD2_MPURG2ADDR11                 (*((volatile unsigned int*)(0x42A00140UL)))
#define bM4_MPU_RGD2_MPURG2ADDR12                 (*((volatile unsigned int*)(0x42A00144UL)))
#define bM4_MPU_RGD2_MPURG2ADDR13                 (*((volatile unsigned int*)(0x42A00148UL)))
#define bM4_MPU_RGD2_MPURG2ADDR14                 (*((volatile unsigned int*)(0x42A0014CUL)))
#define bM4_MPU_RGD2_MPURG2ADDR15                 (*((volatile unsigned int*)(0x42A00150UL)))
#define bM4_MPU_RGD2_MPURG2ADDR16                 (*((volatile unsigned int*)(0x42A00154UL)))
#define bM4_MPU_RGD2_MPURG2ADDR17                 (*((volatile unsigned int*)(0x42A00158UL)))
#define bM4_MPU_RGD2_MPURG2ADDR18                 (*((volatile unsigned int*)(0x42A0015CUL)))
#define bM4_MPU_RGD2_MPURG2ADDR19                 (*((volatile unsigned int*)(0x42A00160UL)))
#define bM4_MPU_RGD2_MPURG2ADDR20                 (*((volatile unsigned int*)(0x42A00164UL)))
#define bM4_MPU_RGD2_MPURG2ADDR21                 (*((volatile unsigned int*)(0x42A00168UL)))
#define bM4_MPU_RGD2_MPURG2ADDR22                 (*((volatile unsigned int*)(0x42A0016CUL)))
#define bM4_MPU_RGD2_MPURG2ADDR23                 (*((volatile unsigned int*)(0x42A00170UL)))
#define bM4_MPU_RGD2_MPURG2ADDR24                 (*((volatile unsigned int*)(0x42A00174UL)))
#define bM4_MPU_RGD2_MPURG2ADDR25                 (*((volatile unsigned int*)(0x42A00178UL)))
#define bM4_MPU_RGD2_MPURG2ADDR26                 (*((volatile unsigned int*)(0x42A0017CUL)))
#define bM4_MPU_RGD3_MPURG3SIZE0                  (*((volatile unsigned int*)(0x42A00180UL)))
#define bM4_MPU_RGD3_MPURG3SIZE1                  (*((volatile unsigned int*)(0x42A00184UL)))
#define bM4_MPU_RGD3_MPURG3SIZE2                  (*((volatile unsigned int*)(0x42A00188UL)))
#define bM4_MPU_RGD3_MPURG3SIZE3                  (*((volatile unsigned int*)(0x42A0018CUL)))
#define bM4_MPU_RGD3_MPURG3SIZE4                  (*((volatile unsigned int*)(0x42A00190UL)))
#define bM4_MPU_RGD3_MPURG3ADDR0                  (*((volatile unsigned int*)(0x42A00194UL)))
#define bM4_MPU_RGD3_MPURG3ADDR1                  (*((volatile unsigned int*)(0x42A00198UL)))
#define bM4_MPU_RGD3_MPURG3ADDR2                  (*((volatile unsigned int*)(0x42A0019CUL)))
#define bM4_MPU_RGD3_MPURG3ADDR3                  (*((volatile unsigned int*)(0x42A001A0UL)))
#define bM4_MPU_RGD3_MPURG3ADDR4                  (*((volatile unsigned int*)(0x42A001A4UL)))
#define bM4_MPU_RGD3_MPURG3ADDR5                  (*((volatile unsigned int*)(0x42A001A8UL)))
#define bM4_MPU_RGD3_MPURG3ADDR6                  (*((volatile unsigned int*)(0x42A001ACUL)))
#define bM4_MPU_RGD3_MPURG3ADDR7                  (*((volatile unsigned int*)(0x42A001B0UL)))
#define bM4_MPU_RGD3_MPURG3ADDR8                  (*((volatile unsigned int*)(0x42A001B4UL)))
#define bM4_MPU_RGD3_MPURG3ADDR9                  (*((volatile unsigned int*)(0x42A001B8UL)))
#define bM4_MPU_RGD3_MPURG3ADDR10                 (*((volatile unsigned int*)(0x42A001BCUL)))
#define bM4_MPU_RGD3_MPURG3ADDR11                 (*((volatile unsigned int*)(0x42A001C0UL)))
#define bM4_MPU_RGD3_MPURG3ADDR12                 (*((volatile unsigned int*)(0x42A001C4UL)))
