patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_PORT_PIDRB_PIN01                      (*((volatile unsigned int*)(0x42A70204UL)))
#define bM4_PORT_PIDRB_PIN02                      (*((volatile unsigned int*)(0x42A70208UL)))
#define bM4_PORT_PIDRB_PIN03                      (*((volatile unsigned int*)(0x42A7020CUL)))
#define bM4_PORT_PIDRB_PIN04                      (*((volatile unsigned int*)(0x42A70210UL)))
#define bM4_PORT_PIDRB_PIN05                      (*((volatile unsigned int*)(0x42A70214UL)))
#define bM4_PORT_PIDRB_PIN06                      (*((volatile unsigned int*)(0x42A70218UL)))
#define bM4_PORT_PIDRB_PIN07                      (*((volatile unsigned int*)(0x42A7021CUL)))
#define bM4_PORT_PIDRB_PIN08                      (*((volatile unsigned int*)(0x42A70220UL)))
#define bM4_PORT_PIDRB_PIN09                      (*((volatile unsigned int*)(0x42A70224UL)))
#define bM4_PORT_PIDRB_PIN10                      (*((volatile unsigned int*)(0x42A70228UL)))
#define bM4_PORT_PIDRB_PIN11                      (*((volatile unsigned int*)(0x42A7022CUL)))
#define bM4_PORT_PIDRB_PIN12                      (*((volatile unsigned int*)(0x42A70230UL)))
#define bM4_PORT_PIDRB_PIN13                      (*((volatile unsigned int*)(0x42A70234UL)))
#define bM4_PORT_PIDRB_PIN14                      (*((volatile unsigned int*)(0x42A70238UL)))
#define bM4_PORT_PIDRB_PIN15                      (*((volatile unsigned int*)(0x42A7023CUL)))
#define bM4_PORT_PODRB_POUT00                     (*((volatile unsigned int*)(0x42A70280UL)))
#define bM4_PORT_PODRB_POUT01                     (*((volatile unsigned int*)(0x42A70284UL)))
#define bM4_PORT_PODRB_POUT02                     (*((volatile unsigned int*)(0x42A70288UL)))
#define bM4_PORT_PODRB_POUT03                     (*((volatile unsigned int*)(0x42A7028CUL)))
#define bM4_PORT_PODRB_POUT04                     (*((volatile unsigned int*)(0x42A70290UL)))
#define bM4_PORT_PODRB_POUT05                     (*((volatile unsigned int*)(0x42A70294UL)))
#define bM4_PORT_PODRB_POUT06                     (*((volatile unsigned int*)(0x42A70298UL)))
#define bM4_PORT_PODRB_POUT07                     (*((volatile unsigned int*)(0x42A7029CUL)))
#define bM4_PORT_PODRB_POUT08                     (*((volatile unsigned int*)(0x42A702A0UL)))
#define bM4_PORT_PODRB_POUT09                     (*((volatile unsigned int*)(0x42A702A4UL)))
#define bM4_PORT_PODRB_POUT10                     (*((volatile unsigned int*)(0x42A702A8UL)))
#define bM4_PORT_PODRB_POUT11                     (*((volatile unsigned int*)(0x42A702ACUL)))
#define bM4_PORT_PODRB_POUT12                     (*((volatile unsigned int*)(0x42A702B0UL)))
#define bM4_PORT_PODRB_POUT13                     (*((volatile unsigned int*)(0x42A702B4UL)))
#define bM4_PORT_PODRB_POUT14                     (*((volatile unsigned int*)(0x42A702B8UL)))
#define bM4_PORT_PODRB_POUT15                     (*((volatile unsigned int*)(0x42A702BCUL)))
#define bM4_PORT_POERB_POUTE00                    (*((volatile unsigned int*)(0x42A702C0UL)))
#define bM4_PORT_POERB_POUTE01                    (*((volatile unsigned int*)(0x42A702C4UL)))
#define bM4_PORT_POERB_POUTE02                    (*((volatile unsigned int*)(0x42A702C8UL)))
#define bM4_PORT_POERB_POUTE03                    (*((volatile unsigned int*)(0x42A702CCUL)))
#define bM4_PORT_POERB_POUTE04                    (*((volatile unsigned int*)(0x42A702D0UL)))
#define bM4_PORT_POERB_POUTE05                    (*((volatile unsigned int*)(0x42A702D4UL)))
#define bM4_PORT_POERB_POUTE06                    (*((volatile unsigned int*)(0x42A702D8UL)))
#define bM4_PORT_POERB_POUTE07                    (*((volatile unsigned int*)(0x42A702DCUL)))
#define bM4_PORT_POERB_POUTE08                    (*((volatile unsigned int*)(0x42A702E0UL)))
#define bM4_PORT_POERB_POUTE09                    (*((volatile unsigned int*)(0x42A702E4UL)))
#define bM4_PORT_POERB_POUTE10                    (*((volatile unsigned int*)(0x42A702E8UL)))
#define bM4_PORT_POERB_POUTE11                    (*((volatile unsigned int*)(0x42A702ECUL)))
#define bM4_PORT_POERB_POUTE12                    (*((volatile unsigned int*)(0x42A702F0UL)))
#define bM4_PORT_POERB_POUTE13                    (*((volatile unsigned int*)(0x42A702F4UL)))
#define bM4_PORT_POERB_POUTE14                    (*((volatile unsigned int*)(0x42A702F8UL)))
#define bM4_PORT_POERB_POUTE15                    (*((volatile unsigned int*)(0x42A702FCUL)))
#define bM4_PORT_POSRB_POS00                      (*((volatile unsigned int*)(0x42A70300UL)))
#define bM4_PORT_POSRB_POS01                      (*((volatile unsigned int*)(0x42A70304UL)))
#define bM4_PORT_POSRB_POS02                      (*((volatile unsigned int*)(0x42A70308UL)))
#define bM4_PORT_POSRB_POS03                      (*((volatile unsigned int*)(0x42A7030CUL)))
#define bM4_PORT_POSRB_POS04                      (*((volatile unsigned int*)(0x42A70310UL)))
#define bM4_PORT_POSRB_POS05                      (*((volatile unsigned int*)(0x42A70314UL)))
#define bM4_PORT_POSRB_POS06                      (*((volatile unsigned int*)(0x42A70318UL)))
#define bM4_PORT_POSRB_POS07                      (*((volatile unsigned int*)(0x42A7031CUL)))
#define bM4_PORT_POSRB_POS08                      (*((volatile unsigned int*)(0x42A70320UL)))
#define bM4_PORT_POSRB_POS09                      (*((volatile unsigned int*)(0x42A70324UL)))
#define bM4_PORT_POSRB_POS10                      (*((volatile unsigned int*)(0x42A70328UL)))
#define bM4_PORT_POSRB_POS11                      (*((volatile unsigned int*)(0x42A7032CUL)))
#define bM4_PORT_POSRB_POS12                      (*((volatile unsigned int*)(0x42A70330UL)))
#define bM4_PORT_POSRB_POS13                      (*((volatile unsigned int*)(0x42A70334UL)))
#define bM4_PORT_POSRB_POS14                      (*((volatile unsigned int*)(0x42A70338UL)))
#define bM4_PORT_POSRB_POS15                      (*((volatile unsigned int*)(0x42A7033CUL)))
#define bM4_PORT_PORRB_POR00                      (*((volatile unsigned int*)(0x42A70340UL)))
#define bM4_PORT_PORRB_POR01                      (*((volatile unsigned int*)(0x42A70344UL)))
#define bM4_PORT_PORRB_POR02                      (*((volatile unsigned int*)(0x42A70348UL)))
#define bM4_PORT_PORRB_POR03                      (*((volatile unsigned int*)(0x42A7034CUL)))
#define bM4_PORT_PORRB_POR04                      (*((volatile unsigned int*)(0x42A70350UL)))
#define bM4_PORT_PORRB_POR05                      (*((volatile unsigned int*)(0x42A70354UL)))
#define bM4_PORT_PORRB_POR06                      (*((volatile unsigned int*)(0x42A70358UL)))
#define bM4_PORT_PORRB_POR07                      (*((volatile unsigned int*)(0x42A7035CUL)))
#define bM4_PORT_PORRB_POR08                      (*((volatile unsigned int*)(0x42A70360UL)))
#define bM4_PORT_PORRB_POR09                      (*((volatile unsigned int*)(0x42A70364UL)))
#define bM4_PORT_PORRB_POR10                      (*((volatile unsigned int*)(0x42A70368UL)))
#define bM4_PORT_PORRB_POR11                      (*((volatile unsigned int*)(0x42A7036CUL)))
#define bM4_PORT_PORRB_POR12                      (*((volatile unsigned int*)(0x42A70370UL)))
#define bM4_PORT_PORRB_POR13                      (*((volatile unsigned int*)(0x42A70374UL)))
#define bM4_PORT_PORRB_POR14                      (*((volatile unsigned int*)(0x42A70378UL)))
#define bM4_PORT_PORRB_POR15                      (*((volatile unsigned int*)(0x42A7037CUL)))
#define bM4_PORT_POTRB_POT00                      (*((volatile unsigned int*)(0x42A70380UL)))
#define bM4_PORT_POTRB_POT01                      (*((volatile unsigned int*)(0x42A70384UL)))
#define bM4_PORT_POTRB_POT02                      (*((volatile unsigned int*)(0x42A70388UL)))
#define bM4_PORT_POTRB_POT03                      (*((volatile unsigned int*)(0x42A7038CUL)))
#define bM4_PORT_POTRB_POT04                      (*((volatile unsigned int*)(0x42A70390UL)))
#define bM4_PORT_POTRB_POT05                      (*((volatile unsigned int*)(0x42A70394UL)))
#define bM4_PORT_POTRB_POT06                      (*((volatile unsigned int*)(0x42A70398UL)))
#define bM4_PORT_POTRB_POT07                      (*((volatile unsigned int*)(0x42A7039CUL)))
#define bM4_PORT_POTRB_POT08                      (*((volatile unsigned int*)(0x42A703A0UL)))
#define bM4_PORT_POTRB_POT09                      (*((volatile unsigned int*)(0x42A703A4UL)))
#define bM4_PORT_POTRB_POT10                      (*((volatile unsigned int*)(0x42A703A8UL)))
#define bM4_PORT_POTRB_POT11                      (*((volatile unsigned int*)(0x42A703ACUL)))
#define bM4_PORT_POTRB_POT12                      (*((volatile unsigned int*)(0x42A703B0UL)))
#define bM4_PORT_POTRB_POT13                      (*((volatile unsigned int*)(0x42A703B4UL)))
#define bM4_PORT_POTRB_POT14                      (*((volatile unsigned int*)(0x42A703B8UL)))
#define bM4_PORT_POTRB_POT15                      (*((volatile unsigned int*)(0x42A703BCUL)))
#define bM4_PORT_PIDRC_PIN00                      (*((volatile unsigned int*)(0x42A70400UL)))
#define bM4_PORT_PIDRC_PIN01                      (*((volatile unsigned int*)(0x42A70404UL)))
#define bM4_PORT_PIDRC_PIN02                      (*((volatile unsigned int*)(0x42A70408UL)))
#define bM4_PORT_PIDRC_PIN03                      (*((volatile unsigned int*)(0x42A7040CUL)))
#define bM4_PORT_PIDRC_PIN04                      (*((volatile unsigned int*)(0x42A70410UL)))
#define bM4_PORT_PIDRC_PIN05                      (*((volatile unsigned int*)(0x42A70414UL)))
#define bM4_PORT_PIDRC_PIN06                      (*((volatile unsigned int*)(0x42A70418UL)))
#define bM4_PORT_PIDRC_PIN07                      (*((volatile unsigned int*)(0x42A7041CUL)))
#define bM4_PORT_PIDRC_PIN08                      (*((volatile unsigned int*)(0x42A70420UL)))
#define bM4_PORT_PIDRC_PIN09                      (*((volatile unsigned int*)(0x42A70424UL)))
#define bM4_PORT_PIDRC_PIN10                      (*((volatile unsigned int*)(0x42A70428UL)))
#define bM4_PORT_PIDRC_PIN11                      (*((volatile unsigned int*)(0x42A7042CUL)))
#define bM4_PORT_PIDRC_PIN12                      (*((volatile unsigned int*)(0x42A70430UL)))
#define bM4_PORT_PIDRC_PIN13                      (*((volatile unsigned int*)(0x42A70434UL)))
#define bM4_PORT_PIDRC_PIN14                      (*((volatile unsigned int*)(0x42A70438UL)))
#define bM4_PORT_PIDRC_PIN15                      (*((volatile unsigned int*)(0x42A7043CUL)))
#define bM4_PORT_PODRC_POUT00                     (*((volatile unsigned int*)(0x42A70480UL)))
#define bM4_PORT_PODRC_POUT01                     (*((volatile unsigned int*)(0x42A70484UL)))
#define bM4_PORT_PODRC_POUT02                     (*((volatile unsigned int*)(0x42A70488UL)))
#define bM4_PORT_PODRC_POUT03                     (*((volatile unsigned int*)(0x42A7048CUL)))
#define bM4_PORT_PODRC_POUT04                     (*((volatile unsigned int*)(0x42A70490UL)))
#define bM4_PORT_PODRC_POUT05                     (*((volatile unsigned int*)(0x42A70494UL)))
#define bM4_PORT_PODRC_POUT06                     (*((volatile unsigned int*)(0x42A70498UL)))
#define bM4_PORT_PODRC_POUT07                     (*((volatile unsigned int*)(0x42A7049CUL)))
#define bM4_PORT_PODRC_POUT08                     (*((volatile unsigned int*)(0x42A704A0UL)))
#define bM4_PORT_PODRC_POUT09                     (*((volatile unsigned int*)(0x42A704A4UL)))
#define bM4_PORT_PODRC_POUT10                     (*((volatile unsigned int*)(0x42A704A8UL)))
#define bM4_PORT_PODRC_POUT11                     (*((volatile unsigned int*)(0x42A704ACUL)))
#define bM4_PORT_PODRC_POUT12                     (*((volatile unsigned int*)(0x42A704B0UL)))
#define bM4_PORT_PODRC_POUT13                     (*((volatile unsigned int*)(0x42A704B4UL)))
#define bM4_PORT_PODRC_POUT14                     (*((volatile unsigned int*)(0x42A704B8UL)))
#define bM4_PORT_PODRC_POUT15                     (*((volatile unsigned int*)(0x42A704BCUL)))
#define bM4_PORT_POERC_POUTE00                    (*((volatile unsigned int*)(0x42A704C0UL)))
#define bM4_PORT_POERC_POUTE01                    (*((volatile unsigned int*)(0x42A704C4UL)))
#define bM4_PORT_POERC_POUTE02                    (*((volatile unsigned int*)(0x42A704C8UL)))
#define bM4_PORT_POERC_POUTE03                    (*((volatile unsigned int*)(0x42A704CCUL)))
#define bM4_PORT_POERC_POUTE04                    (*((volatile unsigned int*)(0x42A704D0UL)))
#define bM4_PORT_POERC_POUTE05                    (*((volatile unsigned int*)(0x42A704D4UL)))
#define bM4_PORT_POERC_POUTE06                    (*((volatile unsigned int*)(0x42A704D8UL)))
#define bM4_PORT_POERC_POUTE07                    (*((volatile unsigned int*)(0x42A704DCUL)))
#define bM4_PORT_POERC_POUTE08                    (*((volatile unsigned int*)(0x42A704E0UL)))
#define bM4_PORT_POERC_POUTE09                    (*((volatile unsigned int*)(0x42A704E4UL)))
#define bM4_PORT_POERC_POUTE10                    (*((volatile unsigned int*)(0x42A704E8UL)))
#define bM4_PORT_POERC_POUTE11                    (*((volatile unsigned int*)(0x42A704ECUL)))
#define bM4_PORT_POERC_POUTE12                    (*((volatile unsigned int*)(0x42A704F0UL)))
#define bM4_PORT_POERC_POUTE13                    (*((volatile unsigned int*)(0x42A704F4UL)))
#define bM4_PORT_POERC_POUTE14                    (*((volatile unsigned int*)(0x42A704F8UL)))
#define bM4_PORT_POERC_POUTE15                    (*((volatile unsigned int*)(0x42A704FCUL)))
#define bM4_PORT_POSRC_POS00                      (*((volatile unsigned int*)(0x42A70500UL)))
#define bM4_PORT_POSRC_POS01                      (*((volatile unsigned int*)(0x42A70504UL)))
#define bM4_PORT_POSRC_POS02                      (*((volatile unsigned int*)(0x42A70508UL)))
#define bM4_PORT_POSRC_POS03                      (*((volatile unsigned int*)(0x42A7050CUL)))
#define bM4_PORT_POSRC_POS04                      (*((volatile unsigned int*)(0x42A70510UL)))
#define bM4_PORT_POSRC_POS05                      (*((volatile unsigned int*)(0x42A70514UL)))
#define bM4_PORT_POSRC_POS06                      (*((volatile unsigned int*)(0x42A70518UL)))
#define bM4_PORT_POSRC_POS07                      (*((volatile unsigned int*)(0x42A7051CUL)))
#define bM4_PORT_POSRC_POS08                      (*((volatile unsigned int*)(0x42A70520UL)))
#define bM4_PORT_POSRC_POS09                      (*((volatile unsigned int*)(0x42A70524UL)))
#define bM4_PORT_POSRC_POS10                      (*((volatile unsigned int*)(0x42A70528UL)))
#define bM4_PORT_POSRC_POS11                      (*((volatile unsigned int*)(0x42A7052CUL)))
#define bM4_PORT_POSRC_POS12                      (*((volatile unsigned int*)(0x42A70530UL)))
#define bM4_PORT_POSRC_POS13                      (*((volatile unsigned int*)(0x42A70534UL)))
#define bM4_PORT_POSRC_POS14                      (*((volatile unsigned int*)(0x42A70538UL)))
#define bM4_PORT_POSRC_POS15                      (*((volatile unsigned int*)(0x42A7053CUL)))
#define bM4_PORT_PORRC_POR00                      (*((volatile unsigned int*)(0x42A70540UL)))
#define bM4_PORT_PORRC_POR01                      (*((volatile unsigned int*)(0x42A70544UL)))
#define bM4_PORT_PORRC_POR02                      (*((volatile unsigned int*)(0x42A70548UL)))
#define bM4_PORT_PORRC_POR03                      (*((volatile unsigned int*)(0x42A7054CUL)))
#define bM4_PORT_PORRC_POR04                      (*((volatile unsigned int*)(0x42A70550UL)))
#define bM4_PORT_PORRC_POR05                      (*((volatile unsigned int*)(0x42A70554UL)))
#define bM4_PORT_PORRC_POR06                      (*((volatile unsigned int*)(0x42A70558UL)))
#define bM4_PORT_PORRC_POR07                      (*((volatile unsigned int*)(0x42A7055CUL)))
#define bM4_PORT_PORRC_POR08                      (*((volatile unsigned int*)(0x42A70560UL)))
#define bM4_PORT_PORRC_POR09                      (*((volatile unsigned int*)(0x42A70564UL)))
#define bM4_PORT_PORRC_POR10                      (*((volatile unsigned int*)(0x42A70568UL)))
#define bM4_PORT_PORRC_POR11                      (*((volatile unsigned int*)(0x42A7056CUL)))
#define bM4_PORT_PORRC_POR12                      (*((volatile unsigned int*)(0x42A70570UL)))
#define bM4_PORT_PORRC_POR13                      (*((volatile unsigned int*)(0x42A70574UL)))
#define bM4_PORT_PORRC_POR14                      (*((volatile unsigned int*)(0x42A70578UL)))
#define bM4_PORT_PORRC_POR15                      (*((volatile unsigned int*)(0x42A7057CUL)))
#define bM4_PORT_POTRC_POT00                      (*((volatile unsigned int*)(0x42A70580UL)))
#define bM4_PORT_POTRC_POT01                      (*((volatile unsigned int*)(0x42A70584UL)))
#define bM4_PORT_POTRC_POT02                      (*((volatile unsigned int*)(0x42A70588UL)))
#define bM4_PORT_POTRC_POT03                      (*((volatile unsigned int*)(0x42A7058CUL)))
#define bM4_PORT_POTRC_POT04                      (*((volatile unsigned int*)(0x42A70590UL)))
#define bM4_PORT_POTRC_POT05                      (*((volatile unsigned int*)(0x42A70594UL)))
#define bM4_PORT_POTRC_POT06                      (*((volatile unsigned int*)(0x42A70598UL)))
#define bM4_PORT_POTRC_POT07                      (*((volatile unsigned int*)(0x42A7059CUL)))
#define bM4_PORT_POTRC_POT08                      (*((volatile unsigned int*)(0x42A705A0UL)))
#define bM4_PORT_POTRC_POT09                      (*((volatile unsigned int*)(0x42A705A4UL)))
#define bM4_PORT_POTRC_POT10                      (*((volatile unsigned int*)(0x42A705A8UL)))
#define bM4_PORT_POTRC_POT11                      (*((volatile unsigned int*)(0x42A705ACUL)))
#define bM4_PORT_POTRC_POT12                      (*((volatile unsigned int*)(0x42A705B0UL)))
#define bM4_PORT_POTRC_POT13                      (*((volatile unsigned int*)(0x42A705B4UL)))
#define bM4_PORT_POTRC_POT14                      (*((volatile unsigned int*)(0x42A705B8UL)))
#define bM4_PORT_POTRC_POT15                      (*((volatile unsigned int*)(0x42A705BCUL)))
#define bM4_PORT_PIDRD_PIN00                      (*((volatile unsigned int*)(0x42A70600UL)))
#define bM4_PORT_PIDRD_PIN01                      (*((volatile unsigned int*)(0x42A70604UL)))
#define bM4_PORT_PIDRD_PIN02                      (*((volatile unsigned int*)(0x42A70608UL)))
#define bM4_PORT_PIDRD_PIN03                      (*((volatile unsigned int*)(0x42A7060CUL)))
#define bM4_PORT_PIDRD_PIN04                      (*((volatile unsigned int*)(0x42A70610UL)))
#define bM4_PORT_PIDRD_PIN05                      (*((volatile unsigned int*)(0x42A70614UL)))
#define bM4_PORT_PIDRD_PIN06                      (*((volatile unsigned int*)(0x42A70618UL)))
#define bM4_PORT_PIDRD_PIN07                      (*((volatile unsigned int*)(0x42A7061CUL)))
#define bM4_PORT_PIDRD_PIN08                      (*((volatile unsigned int*)(0x42A70620UL)))
#define bM4_PORT_PIDRD_PIN09                      (*((volatile unsigned int*)(0x42A70624UL)))
#define bM4_PORT_PIDRD_PIN10                      (*((volatile unsigned int*)(0x42A70628UL)))
#define bM4_PORT_PIDRD_PIN11                      (*((volatile unsigned int*)(0x42A7062CUL)))
#define bM4_PORT_PIDRD_PIN12                      (*((volatile unsigned int*)(0x42A70630UL)))
#define bM4_PORT_PIDRD_PIN13                      (*((volatile unsigned int*)(0x42A70634UL)))
#define bM4_PORT_PIDRD_PIN14                      (*((volatile unsigned int*)(0x42A70638UL)))
#define bM4_PORT_PIDRD_PIN15                      (*((volatile unsigned int*)(0x42A7063CUL)))
#define bM4_PORT_PODRD_POUT00                     (*((volatile unsigned int*)(0x42A70680UL)))
#define bM4_PORT_PODRD_POUT01                     (*((volatile unsigned int*)(0x42A70684UL)))
#define bM4_PORT_PODRD_POUT02                     (*((volatile unsigned int*)(0x42A70688UL)))
#define bM4_PORT_PODRD_POUT03                     (*((volatile unsigned int*)(0x42A7068CUL)))
#define bM4_PORT_PODRD_POUT04                     (*((volatile unsigned int*)(0x42A70690UL)))
#define bM4_PORT_PODRD_POUT05                     (*((volatile unsigned int*)(0x42A70694UL)))
#define bM4_PORT_PODRD_POUT06                     (*((volatile unsigned int*)(0x42A70698UL)))
#define bM4_PORT_PODRD_POUT07                     (*((volatile unsigned int*)(0x42A7069CUL)))
#define bM4_PORT_PODRD_POUT08                     (*((volatile unsigned int*)(0x42A706A0UL)))
#define bM4_PORT_PODRD_POUT09                     (*((volatile unsigned int*)(0x42A706A4UL)))
#define bM4_PORT_PODRD_POUT10                     (*((volatile unsigned int*)(0x42A706A8UL)))
#define bM4_PORT_PODRD_POUT11                     (*((volatile unsigned int*)(0x42A706ACUL)))
#define bM4_PORT_PODRD_POUT12                     (*((volatile unsigned int*)(0x42A706B0UL)))
#define bM4_PORT_PODRD_POUT13                     (*((volatile unsigned int*)(0x42A706B4UL)))
#define bM4_PORT_PODRD_POUT14                     (*((volatile unsigned int*)(0x42A706B8UL)))
#define bM4_PORT_PODRD_POUT15                     (*((volatile unsigned int*)(0x42A706BCUL)))
#define bM4_PORT_POERD_POUTE00                    (*((volatile unsigned int*)(0x42A706C0UL)))
#define bM4_PORT_POERD_POUTE01                    (*((volatile unsigned int*)(0x42A706C4UL)))
#define bM4_PORT_POERD_POUTE02                    (*((volatile unsigned int*)(0x42A706C8UL)))
#define bM4_PORT_POERD_POUTE03                    (*((volatile unsigned int*)(0x42A706CCUL)))
#define bM4_PORT_POERD_POUTE04                    (*((volatile unsigned int*)(0x42A706D0UL)))
#define bM4_PORT_POERD_POUTE05                    (*((volatile unsigned int*)(0x42A706D4UL)))
#define bM4_PORT_POERD_POUTE06                    (*((volatile unsigned int*)(0x42A706D8UL)))
#define bM4_PORT_POERD_POUTE07                    (*((volatile unsigned int*)(0x42A706DCUL)))
#define bM4_PORT_POERD_POUTE08                    (*((volatile unsigned int*)(0x42A706E0UL)))
#define bM4_PORT_POERD_POUTE09                    (*((volatile unsigned int*)(0x42A706E4UL)))
#define bM4_PORT_POERD_POUTE10                    (*((volatile unsigned int*)(0x42A706E8UL)))
#define bM4_PORT_POERD_POUTE11                    (*((volatile unsigned int*)(0x42A706ECUL)))
#define bM4_PORT_POERD_POUTE12                    (*((volatile unsigned int*)(0x42A706F0UL)))
#define bM4_PORT_POERD_POUTE13                    (*((volatile unsigned int*)(0x42A706F4UL)))
#define bM4_PORT_POERD_POUTE14                    (*((volatile unsigned int*)(0x42A706F8UL)))
#define bM4_PORT_POERD_POUTE15                    (*((volatile unsigned int*)(0x42A706FCUL)))
#define bM4_PORT_POSRD_POS00                      (*((volatile unsigned int*)(0x42A70700UL)))
#define bM4_PORT_POSRD_POS01                      (*((volatile unsigned int*)(0x42A70704UL)))
#define bM4_PORT_POSRD_POS02                      (*((volatile unsigned int*)(0x42A70708UL)))
#define bM4_PORT_POSRD_POS03                      (*((volatile unsigned int*)(0x42A7070CUL)))
#define bM4_PORT_POSRD_POS04                      (*((volatile unsigned int*)(0x42A70710UL)))
#define bM4_PORT_POSRD_POS05                      (*((volatile unsigned int*)(0x42A70714UL)))
#define bM4_PORT_POSRD_POS06                      (*((volatile unsigned int*)(0x42A70718UL)))
#define bM4_PORT_POSRD_POS07                      (*((volatile unsigned int*)(0x42A7071CUL)))
#define bM4_PORT_POSRD_POS08                      (*((volatile unsigned int*)(0x42A70720UL)))
#define bM4_PORT_POSRD_POS09                      (*((volatile unsigned int*)(0x42A70724UL)))
#define bM4_PORT_POSRD_POS10                      (*((volatile unsigned int*)(0x42A70728UL)))
#define bM4_PORT_POSRD_POS11                      (*((volatile unsigned int*)(0x42A7072CUL)))
#define bM4_PORT_POSRD_POS12                      (*((volatile unsigned int*)(0x42A70730UL)))
#define bM4_PORT_POSRD_POS13                      (*((volatile unsigned int*)(0x42A70734UL)))
#define bM4_PORT_POSRD_POS14                      (*((volatile unsigned int*)(0x42A70738UL)))
#define bM4_PORT_POSRD_POS15                      (*((volatile unsigned int*)(0x42A7073CUL)))
