patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_PORT_PORRD_POR00                      (*((volatile unsigned int*)(0x42A70740UL)))
#define bM4_PORT_PORRD_POR01                      (*((volatile unsigned int*)(0x42A70744UL)))
#define bM4_PORT_PORRD_POR02                      (*((volatile unsigned int*)(0x42A70748UL)))
#define bM4_PORT_PORRD_POR03                      (*((volatile unsigned int*)(0x42A7074CUL)))
#define bM4_PORT_PORRD_POR04                      (*((volatile unsigned int*)(0x42A70750UL)))
#define bM4_PORT_PORRD_POR05                      (*((volatile unsigned int*)(0x42A70754UL)))
#define bM4_PORT_PORRD_POR06                      (*((volatile unsigned int*)(0x42A70758UL)))
#define bM4_PORT_PORRD_POR07                      (*((volatile unsigned int*)(0x42A7075CUL)))
#define bM4_PORT_PORRD_POR08                      (*((volatile unsigned int*)(0x42A70760UL)))
#define bM4_PORT_PORRD_POR09                      (*((volatile unsigned int*)(0x42A70764UL)))
#define bM4_PORT_PORRD_POR10                      (*((volatile unsigned int*)(0x42A70768UL)))
#define bM4_PORT_PORRD_POR11                      (*((volatile unsigned int*)(0x42A7076CUL)))
#define bM4_PORT_PORRD_POR12                      (*((volatile unsigned int*)(0x42A70770UL)))
#define bM4_PORT_PORRD_POR13                      (*((volatile unsigned int*)(0x42A70774UL)))
#define bM4_PORT_PORRD_POR14                      (*((volatile unsigned int*)(0x42A70778UL)))
#define bM4_PORT_PORRD_POR15                      (*((volatile unsigned int*)(0x42A7077CUL)))
#define bM4_PORT_POTRD_POT00                      (*((volatile unsigned int*)(0x42A70780UL)))
#define bM4_PORT_POTRD_POT01                      (*((volatile unsigned int*)(0x42A70784UL)))
#define bM4_PORT_POTRD_POT02                      (*((volatile unsigned int*)(0x42A70788UL)))
#define bM4_PORT_POTRD_POT03                      (*((volatile unsigned int*)(0x42A7078CUL)))
#define bM4_PORT_POTRD_POT04                      (*((volatile unsigned int*)(0x42A70790UL)))
#define bM4_PORT_POTRD_POT05                      (*((volatile unsigned int*)(0x42A70794UL)))
#define bM4_PORT_POTRD_POT06                      (*((volatile unsigned int*)(0x42A70798UL)))
#define bM4_PORT_POTRD_POT07                      (*((volatile unsigned int*)(0x42A7079CUL)))
#define bM4_PORT_POTRD_POT08                      (*((volatile unsigned int*)(0x42A707A0UL)))
#define bM4_PORT_POTRD_POT09                      (*((volatile unsigned int*)(0x42A707A4UL)))
#define bM4_PORT_POTRD_POT10                      (*((volatile unsigned int*)(0x42A707A8UL)))
#define bM4_PORT_POTRD_POT11                      (*((volatile unsigned int*)(0x42A707ACUL)))
#define bM4_PORT_POTRD_POT12                      (*((volatile unsigned int*)(0x42A707B0UL)))
#define bM4_PORT_POTRD_POT13                      (*((volatile unsigned int*)(0x42A707B4UL)))
#define bM4_PORT_POTRD_POT14                      (*((volatile unsigned int*)(0x42A707B8UL)))
#define bM4_PORT_POTRD_POT15                      (*((volatile unsigned int*)(0x42A707BCUL)))
#define bM4_PORT_PIDRE_PIN00                      (*((volatile unsigned int*)(0x42A70800UL)))
#define bM4_PORT_PIDRE_PIN01                      (*((volatile unsigned int*)(0x42A70804UL)))
#define bM4_PORT_PIDRE_PIN02                      (*((volatile unsigned int*)(0x42A70808UL)))
#define bM4_PORT_PIDRE_PIN03                      (*((volatile unsigned int*)(0x42A7080CUL)))
#define bM4_PORT_PIDRE_PIN04                      (*((volatile unsigned int*)(0x42A70810UL)))
#define bM4_PORT_PIDRE_PIN05                      (*((volatile unsigned int*)(0x42A70814UL)))
#define bM4_PORT_PIDRE_PIN06                      (*((volatile unsigned int*)(0x42A70818UL)))
#define bM4_PORT_PIDRE_PIN07                      (*((volatile unsigned int*)(0x42A7081CUL)))
#define bM4_PORT_PIDRE_PIN08                      (*((volatile unsigned int*)(0x42A70820UL)))
#define bM4_PORT_PIDRE_PIN09                      (*((volatile unsigned int*)(0x42A70824UL)))
#define bM4_PORT_PIDRE_PIN10                      (*((volatile unsigned int*)(0x42A70828UL)))
#define bM4_PORT_PIDRE_PIN11                      (*((volatile unsigned int*)(0x42A7082CUL)))
#define bM4_PORT_PIDRE_PIN12                      (*((volatile unsigned int*)(0x42A70830UL)))
#define bM4_PORT_PIDRE_PIN13                      (*((volatile unsigned int*)(0x42A70834UL)))
#define bM4_PORT_PIDRE_PIN14                      (*((volatile unsigned int*)(0x42A70838UL)))
#define bM4_PORT_PIDRE_PIN15                      (*((volatile unsigned int*)(0x42A7083CUL)))
#define bM4_PORT_PODRE_POUT00                     (*((volatile unsigned int*)(0x42A70880UL)))
#define bM4_PORT_PODRE_POUT01                     (*((volatile unsigned int*)(0x42A70884UL)))
#define bM4_PORT_PODRE_POUT02                     (*((volatile unsigned int*)(0x42A70888UL)))
#define bM4_PORT_PODRE_POUT03                     (*((volatile unsigned int*)(0x42A7088CUL)))
#define bM4_PORT_PODRE_POUT04                     (*((volatile unsigned int*)(0x42A70890UL)))
#define bM4_PORT_PODRE_POUT05                     (*((volatile unsigned int*)(0x42A70894UL)))
#define bM4_PORT_PODRE_POUT06                     (*((volatile unsigned int*)(0x42A70898UL)))
#define bM4_PORT_PODRE_POUT07                     (*((volatile unsigned int*)(0x42A7089CUL)))
#define bM4_PORT_PODRE_POUT08                     (*((volatile unsigned int*)(0x42A708A0UL)))
#define bM4_PORT_PODRE_POUT09                     (*((volatile unsigned int*)(0x42A708A4UL)))
#define bM4_PORT_PODRE_POUT10                     (*((volatile unsigned int*)(0x42A708A8UL)))
#define bM4_PORT_PODRE_POUT11                     (*((volatile unsigned int*)(0x42A708ACUL)))
#define bM4_PORT_PODRE_POUT12                     (*((volatile unsigned int*)(0x42A708B0UL)))
#define bM4_PORT_PODRE_POUT13                     (*((volatile unsigned int*)(0x42A708B4UL)))
#define bM4_PORT_PODRE_POUT14                     (*((volatile unsigned int*)(0x42A708B8UL)))
#define bM4_PORT_PODRE_POUT15                     (*((volatile unsigned int*)(0x42A708BCUL)))
#define bM4_PORT_POERE_POUTE00                    (*((volatile unsigned int*)(0x42A708C0UL)))
#define bM4_PORT_POERE_POUTE01                    (*((volatile unsigned int*)(0x42A708C4UL)))
#define bM4_PORT_POERE_POUTE02                    (*((volatile unsigned int*)(0x42A708C8UL)))
#define bM4_PORT_POERE_POUTE03                    (*((volatile unsigned int*)(0x42A708CCUL)))
#define bM4_PORT_POERE_POUTE04                    (*((volatile unsigned int*)(0x42A708D0UL)))
#define bM4_PORT_POERE_POUTE05                    (*((volatile unsigned int*)(0x42A708D4UL)))
#define bM4_PORT_POERE_POUTE06                    (*((volatile unsigned int*)(0x42A708D8UL)))
#define bM4_PORT_POERE_POUTE07                    (*((volatile unsigned int*)(0x42A708DCUL)))
#define bM4_PORT_POERE_POUTE08                    (*((volatile unsigned int*)(0x42A708E0UL)))
#define bM4_PORT_POERE_POUTE09                    (*((volatile unsigned int*)(0x42A708E4UL)))
#define bM4_PORT_POERE_POUTE10                    (*((volatile unsigned int*)(0x42A708E8UL)))
#define bM4_PORT_POERE_POUTE11                    (*((volatile unsigned int*)(0x42A708ECUL)))
#define bM4_PORT_POERE_POUTE12                    (*((volatile unsigned int*)(0x42A708F0UL)))
#define bM4_PORT_POERE_POUTE13                    (*((volatile unsigned int*)(0x42A708F4UL)))
#define bM4_PORT_POERE_POUTE14                    (*((volatile unsigned int*)(0x42A708F8UL)))
#define bM4_PORT_POERE_POUTE15                    (*((volatile unsigned int*)(0x42A708FCUL)))
#define bM4_PORT_POSRE_POS00                      (*((volatile unsigned int*)(0x42A70900UL)))
#define bM4_PORT_POSRE_POS01                      (*((volatile unsigned int*)(0x42A70904UL)))
#define bM4_PORT_POSRE_POS02                      (*((volatile unsigned int*)(0x42A70908UL)))
#define bM4_PORT_POSRE_POS03                      (*((volatile unsigned int*)(0x42A7090CUL)))
#define bM4_PORT_POSRE_POS04                      (*((volatile unsigned int*)(0x42A70910UL)))
#define bM4_PORT_POSRE_POS05                      (*((volatile unsigned int*)(0x42A70914UL)))
#define bM4_PORT_POSRE_POS06                      (*((volatile unsigned int*)(0x42A70918UL)))
#define bM4_PORT_POSRE_POS07                      (*((volatile unsigned int*)(0x42A7091CUL)))
#define bM4_PORT_POSRE_POS08                      (*((volatile unsigned int*)(0x42A70920UL)))
#define bM4_PORT_POSRE_POS09                      (*((volatile unsigned int*)(0x42A70924UL)))
#define bM4_PORT_POSRE_POS10                      (*((volatile unsigned int*)(0x42A70928UL)))
#define bM4_PORT_POSRE_POS11                      (*((volatile unsigned int*)(0x42A7092CUL)))
#define bM4_PORT_POSRE_POS12                      (*((volatile unsigned int*)(0x42A70930UL)))
#define bM4_PORT_POSRE_POS13                      (*((volatile unsigned int*)(0x42A70934UL)))
#define bM4_PORT_POSRE_POS14                      (*((volatile unsigned int*)(0x42A70938UL)))
#define bM4_PORT_POSRE_POS15                      (*((volatile unsigned int*)(0x42A7093CUL)))
#define bM4_PORT_PORRE_POR00                      (*((volatile unsigned int*)(0x42A70940UL)))
#define bM4_PORT_PORRE_POR01                      (*((volatile unsigned int*)(0x42A70944UL)))
#define bM4_PORT_PORRE_POR02                      (*((volatile unsigned int*)(0x42A70948UL)))
#define bM4_PORT_PORRE_POR03                      (*((volatile unsigned int*)(0x42A7094CUL)))
#define bM4_PORT_PORRE_POR04                      (*((volatile unsigned int*)(0x42A70950UL)))
#define bM4_PORT_PORRE_POR05                      (*((volatile unsigned int*)(0x42A70954UL)))
#define bM4_PORT_PORRE_POR06                      (*((volatile unsigned int*)(0x42A70958UL)))
#define bM4_PORT_PORRE_POR07                      (*((volatile unsigned int*)(0x42A7095CUL)))
#define bM4_PORT_PORRE_POR08                      (*((volatile unsigned int*)(0x42A70960UL)))
#define bM4_PORT_PORRE_POR09                      (*((volatile unsigned int*)(0x42A70964UL)))
#define bM4_PORT_PORRE_POR10                      (*((volatile unsigned int*)(0x42A70968UL)))
#define bM4_PORT_PORRE_POR11                      (*((volatile unsigned int*)(0x42A7096CUL)))
#define bM4_PORT_PORRE_POR12                      (*((volatile unsigned int*)(0x42A70970UL)))
#define bM4_PORT_PORRE_POR13                      (*((volatile unsigned int*)(0x42A70974UL)))
#define bM4_PORT_PORRE_POR14                      (*((volatile unsigned int*)(0x42A70978UL)))
#define bM4_PORT_PORRE_POR15                      (*((volatile unsigned int*)(0x42A7097CUL)))
#define bM4_PORT_POTRE_POT00                      (*((volatile unsigned int*)(0x42A70980UL)))
#define bM4_PORT_POTRE_POT01                      (*((volatile unsigned int*)(0x42A70984UL)))
#define bM4_PORT_POTRE_POT02                      (*((volatile unsigned int*)(0x42A70988UL)))
#define bM4_PORT_POTRE_POT03                      (*((volatile unsigned int*)(0x42A7098CUL)))
#define bM4_PORT_POTRE_POT04                      (*((volatile unsigned int*)(0x42A70990UL)))
#define bM4_PORT_POTRE_POT05                      (*((volatile unsigned int*)(0x42A70994UL)))
#define bM4_PORT_POTRE_POT06                      (*((volatile unsigned int*)(0x42A70998UL)))
#define bM4_PORT_POTRE_POT07                      (*((volatile unsigned int*)(0x42A7099CUL)))
#define bM4_PORT_POTRE_POT08                      (*((volatile unsigned int*)(0x42A709A0UL)))
#define bM4_PORT_POTRE_POT09                      (*((volatile unsigned int*)(0x42A709A4UL)))
#define bM4_PORT_POTRE_POT10                      (*((volatile unsigned int*)(0x42A709A8UL)))
#define bM4_PORT_POTRE_POT11                      (*((volatile unsigned int*)(0x42A709ACUL)))
#define bM4_PORT_POTRE_POT12                      (*((volatile unsigned int*)(0x42A709B0UL)))
#define bM4_PORT_POTRE_POT13                      (*((volatile unsigned int*)(0x42A709B4UL)))
#define bM4_PORT_POTRE_POT14                      (*((volatile unsigned int*)(0x42A709B8UL)))
#define bM4_PORT_POTRE_POT15                      (*((volatile unsigned int*)(0x42A709BCUL)))
#define bM4_PORT_PIDRH_PIN00                      (*((volatile unsigned int*)(0x42A70A00UL)))
#define bM4_PORT_PIDRH_PIN01                      (*((volatile unsigned int*)(0x42A70A04UL)))
#define bM4_PORT_PIDRH_PIN02                      (*((volatile unsigned int*)(0x42A70A08UL)))
#define bM4_PORT_PODRH_POUT00                     (*((volatile unsigned int*)(0x42A70A80UL)))
#define bM4_PORT_PODRH_POUT01                     (*((volatile unsigned int*)(0x42A70A84UL)))
#define bM4_PORT_PODRH_POUT02                     (*((volatile unsigned int*)(0x42A70A88UL)))
#define bM4_PORT_POERH_POUTE00                    (*((volatile unsigned int*)(0x42A70AC0UL)))
#define bM4_PORT_POERH_POUTE01                    (*((volatile unsigned int*)(0x42A70AC4UL)))
#define bM4_PORT_POERH_POUTE02                    (*((volatile unsigned int*)(0x42A70AC8UL)))
#define bM4_PORT_POSRH_POS00                      (*((volatile unsigned int*)(0x42A70B00UL)))
#define bM4_PORT_POSRH_POS01                      (*((volatile unsigned int*)(0x42A70B04UL)))
#define bM4_PORT_POSRH_POS02                      (*((volatile unsigned int*)(0x42A70B08UL)))
#define bM4_PORT_PORRH_POR00                      (*((volatile unsigned int*)(0x42A70B40UL)))
#define bM4_PORT_PORRH_POR01                      (*((volatile unsigned int*)(0x42A70B44UL)))
#define bM4_PORT_PORRH_POR02                      (*((volatile unsigned int*)(0x42A70B48UL)))
#define bM4_PORT_POTRH_POT00                      (*((volatile unsigned int*)(0x42A70B80UL)))
#define bM4_PORT_POTRH_POT01                      (*((volatile unsigned int*)(0x42A70B84UL)))
#define bM4_PORT_POTRH_POT02                      (*((volatile unsigned int*)(0x42A70B88UL)))
#define bM4_PORT_PSPCR_SPFE0                      (*((volatile unsigned int*)(0x42A77E80UL)))
#define bM4_PORT_PSPCR_SPFE1                      (*((volatile unsigned int*)(0x42A77E84UL)))
#define bM4_PORT_PSPCR_SPFE2                      (*((volatile unsigned int*)(0x42A77E88UL)))
#define bM4_PORT_PSPCR_SPFE3                      (*((volatile unsigned int*)(0x42A77E8CUL)))
#define bM4_PORT_PSPCR_SPFE4                      (*((volatile unsigned int*)(0x42A77E90UL)))
#define bM4_PORT_PCCR_BFSEL0                      (*((volatile unsigned int*)(0x42A77F00UL)))
#define bM4_PORT_PCCR_BFSEL1                      (*((volatile unsigned int*)(0x42A77F04UL)))
#define bM4_PORT_PCCR_BFSEL2                      (*((volatile unsigned int*)(0x42A77F08UL)))
#define bM4_PORT_PCCR_BFSEL3                      (*((volatile unsigned int*)(0x42A77F0CUL)))
#define bM4_PORT_PCCR_RDWT0                       (*((volatile unsigned int*)(0x42A77F38UL)))
#define bM4_PORT_PCCR_RDWT1                       (*((volatile unsigned int*)(0x42A77F3CUL)))
#define bM4_PORT_PINAER_PINAE0                    (*((volatile unsigned int*)(0x42A77F40UL)))
#define bM4_PORT_PINAER_PINAE1                    (*((volatile unsigned int*)(0x42A77F44UL)))
#define bM4_PORT_PINAER_PINAE2                    (*((volatile unsigned int*)(0x42A77F48UL)))
#define bM4_PORT_PINAER_PINAE3                    (*((volatile unsigned int*)(0x42A77F4CUL)))
#define bM4_PORT_PINAER_PINAE4                    (*((volatile unsigned int*)(0x42A77F50UL)))
#define bM4_PORT_PINAER_PINAE5                    (*((volatile unsigned int*)(0x42A77F54UL)))
#define bM4_PORT_PWPR_WE                          (*((volatile unsigned int*)(0x42A77F80UL)))
#define bM4_PORT_PWPR_WP0                         (*((volatile unsigned int*)(0x42A77FA0UL)))
#define bM4_PORT_PWPR_WP1                         (*((volatile unsigned int*)(0x42A77FA4UL)))
#define bM4_PORT_PWPR_WP2                         (*((volatile unsigned int*)(0x42A77FA8UL)))
#define bM4_PORT_PWPR_WP3                         (*((volatile unsigned int*)(0x42A77FACUL)))
#define bM4_PORT_PWPR_WP4                         (*((volatile unsigned int*)(0x42A77FB0UL)))
#define bM4_PORT_PWPR_WP5                         (*((volatile unsigned int*)(0x42A77FB4UL)))
#define bM4_PORT_PWPR_WP6                         (*((volatile unsigned int*)(0x42A77FB8UL)))
#define bM4_PORT_PWPR_WP7                         (*((volatile unsigned int*)(0x42A77FBCUL)))
#define bM4_PORT_PCRA0_POUT                       (*((volatile unsigned int*)(0x42A78000UL)))
#define bM4_PORT_PCRA0_POUTE                      (*((volatile unsigned int*)(0x42A78004UL)))
#define bM4_PORT_PCRA0_NOD                        (*((volatile unsigned int*)(0x42A78008UL)))
#define bM4_PORT_PCRA0_DRV0                       (*((volatile unsigned int*)(0x42A78010UL)))
#define bM4_PORT_PCRA0_DRV1                       (*((volatile unsigned int*)(0x42A78014UL)))
#define bM4_PORT_PCRA0_PUU                        (*((volatile unsigned int*)(0x42A78018UL)))
#define bM4_PORT_PCRA0_PIN                        (*((volatile unsigned int*)(0x42A78020UL)))
#define bM4_PORT_PCRA0_INVE                       (*((volatile unsigned int*)(0x42A78024UL)))
#define bM4_PORT_PCRA0_INTE                       (*((volatile unsigned int*)(0x42A78030UL)))
#define bM4_PORT_PCRA0_LTE                        (*((volatile unsigned int*)(0x42A78038UL)))
#define bM4_PORT_PCRA0_DDIS                       (*((volatile unsigned int*)(0x42A7803CUL)))
#define bM4_PORT_PFSRA0_FSEL0                     (*((volatile unsigned int*)(0x42A78040UL)))
#define bM4_PORT_PFSRA0_FSEL1                     (*((volatile unsigned int*)(0x42A78044UL)))
#define bM4_PORT_PFSRA0_FSEL2                     (*((volatile unsigned int*)(0x42A78048UL)))
#define bM4_PORT_PFSRA0_FSEL3                     (*((volatile unsigned int*)(0x42A7804CUL)))
#define bM4_PORT_PFSRA0_FSEL4                     (*((volatile unsigned int*)(0x42A78050UL)))
#define bM4_PORT_PFSRA0_FSEL5                     (*((volatile unsigned int*)(0x42A78054UL)))
#define bM4_PORT_PFSRA0_BFE                       (*((volatile unsigned int*)(0x42A78060UL)))
#define bM4_PORT_PCRA1_POUT                       (*((volatile unsigned int*)(0x42A78080UL)))
#define bM4_PORT_PCRA1_POUTE                      (*((volatile unsigned int*)(0x42A78084UL)))
#define bM4_PORT_PCRA1_NOD                        (*((volatile unsigned int*)(0x42A78088UL)))
#define bM4_PORT_PCRA1_DRV0                       (*((volatile unsigned int*)(0x42A78090UL)))
#define bM4_PORT_PCRA1_DRV1                       (*((volatile unsigned int*)(0x42A78094UL)))
#define bM4_PORT_PCRA1_PUU                        (*((volatile unsigned int*)(0x42A78098UL)))
#define bM4_PORT_PCRA1_PIN                        (*((volatile unsigned int*)(0x42A780A0UL)))
#define bM4_PORT_PCRA1_INVE                       (*((volatile unsigned int*)(0x42A780A4UL)))
#define bM4_PORT_PCRA1_INTE                       (*((volatile unsigned int*)(0x42A780B0UL)))
#define bM4_PORT_PCRA1_LTE                        (*((volatile unsigned int*)(0x42A780B8UL)))
#define bM4_PORT_PCRA1_DDIS                       (*((volatile unsigned int*)(0x42A780BCUL)))
#define bM4_PORT_PFSRA1_FSEL0                     (*((volatile unsigned int*)(0x42A780C0UL)))
#define bM4_PORT_PFSRA1_FSEL1                     (*((volatile unsigned int*)(0x42A780C4UL)))
#define bM4_PORT_PFSRA1_FSEL2                     (*((volatile unsigned int*)(0x42A780C8UL)))
#define bM4_PORT_PFSRA1_FSEL3                     (*((volatile unsigned int*)(0x42A780CCUL)))
#define bM4_PORT_PFSRA1_FSEL4                     (*((volatile unsigned int*)(0x42A780D0UL)))
#define bM4_PORT_PFSRA1_FSEL5                     (*((volatile unsigned int*)(0x42A780D4UL)))
#define bM4_PORT_PFSRA1_BFE                       (*((volatile unsigned int*)(0x42A780E0UL)))
#define bM4_PORT_PCRA2_POUT                       (*((volatile unsigned int*)(0x42A78100UL)))
#define bM4_PORT_PCRA2_POUTE                      (*((volatile unsigned int*)(0x42A78104UL)))
#define bM4_PORT_PCRA2_NOD                        (*((volatile unsigned int*)(0x42A78108UL)))
#define bM4_PORT_PCRA2_DRV0                       (*((volatile unsigned int*)(0x42A78110UL)))
#define bM4_PORT_PCRA2_DRV1                       (*((volatile unsigned int*)(0x42A78114UL)))
#define bM4_PORT_PCRA2_PUU                        (*((volatile unsigned int*)(0x42A78118UL)))
#define bM4_PORT_PCRA2_PIN                        (*((volatile unsigned int*)(0x42A78120UL)))
#define bM4_PORT_PCRA2_INVE                       (*((volatile unsigned int*)(0x42A78124UL)))
#define bM4_PORT_PCRA2_INTE                       (*((volatile unsigned int*)(0x42A78130UL)))
#define bM4_PORT_PCRA2_LTE                        (*((volatile unsigned int*)(0x42A78138UL)))
#define bM4_PORT_PCRA2_DDIS                       (*((volatile unsigned int*)(0x42A7813CUL)))
#define bM4_PORT_PFSRA2_FSEL0                     (*((volatile unsigned int*)(0x42A78140UL)))
#define bM4_PORT_PFSRA2_FSEL1                     (*((volatile unsigned int*)(0x42A78144UL)))
#define bM4_PORT_PFSRA2_FSEL2                     (*((volatile unsigned int*)(0x42A78148UL)))
#define bM4_PORT_PFSRA2_FSEL3                     (*((volatile unsigned int*)(0x42A7814CUL)))
#define bM4_PORT_PFSRA2_FSEL4                     (*((volatile unsigned int*)(0x42A78150UL)))
#define bM4_PORT_PFSRA2_FSEL5                     (*((volatile unsigned int*)(0x42A78154UL)))
#define bM4_PORT_PFSRA2_BFE                       (*((volatile unsigned int*)(0x42A78160UL)))
#define bM4_PORT_PCRA3_POUT                       (*((volatile unsigned int*)(0x42A78180UL)))
#define bM4_PORT_PCRA3_POUTE                      (*((volatile unsigned int*)(0x42A78184UL)))
#define bM4_PORT_PCRA3_NOD                        (*((volatile unsigned int*)(0x42A78188UL)))
#define bM4_PORT_PCRA3_DRV0                       (*((volatile unsigned int*)(0x42A78190UL)))
#define bM4_PORT_PCRA3_DRV1                       (*((volatile unsigned int*)(0x42A78194UL)))
#define bM4_PORT_PCRA3_PUU                        (*((volatile unsigned int*)(0x42A78198UL)))
#define bM4_PORT_PCRA3_PIN                        (*((volatile unsigned int*)(0x42A781A0UL)))
#define bM4_PORT_PCRA3_INVE                       (*((volatile unsigned int*)(0x42A781A4UL)))
#define bM4_PORT_PCRA3_INTE                       (*((volatile unsigned int*)(0x42A781B0UL)))
#define bM4_PORT_PCRA3_LTE                        (*((volatile unsigned int*)(0x42A781B8UL)))
#define bM4_PORT_PCRA3_DDIS                       (*((volatile unsigned int*)(0x42A781BCUL)))
#define bM4_PORT_PFSRA3_FSEL0                     (*((volatile unsigned int*)(0x42A781C0UL)))
#define bM4_PORT_PFSRA3_FSEL1                     (*((volatile unsigned int*)(0x42A781C4UL)))
#define bM4_PORT_PFSRA3_FSEL2                     (*((volatile unsigned int*)(0x42A781C8UL)))
#define bM4_PORT_PFSRA3_FSEL3                     (*((volatile unsigned int*)(0x42A781CCUL)))
#define bM4_PORT_PFSRA3_FSEL4                     (*((volatile unsigned int*)(0x42A781D0UL)))
#define bM4_PORT_PFSRA3_FSEL5                     (*((volatile unsigned int*)(0x42A781D4UL)))
#define bM4_PORT_PFSRA3_BFE                       (*((volatile unsigned int*)(0x42A781E0UL)))
#define bM4_PORT_PCRA4_POUT                       (*((volatile unsigned int*)(0x42A78200UL)))
#define bM4_PORT_PCRA4_POUTE                      (*((volatile unsigned int*)(0x42A78204UL)))
#define bM4_PORT_PCRA4_NOD                        (*((volatile unsigned int*)(0x42A78208UL)))
#define bM4_PORT_PCRA4_DRV0                       (*((volatile unsigned int*)(0x42A78210UL)))
#define bM4_PORT_PCRA4_DRV1                       (*((volatile unsigned int*)(0x42A78214UL)))
#define bM4_PORT_PCRA4_PUU                        (*((volatile unsigned int*)(0x42A78218UL)))
#define bM4_PORT_PCRA4_PIN                        (*((volatile unsigned int*)(0x42A78220UL)))
#define bM4_PORT_PCRA4_INVE                       (*((volatile unsigned int*)(0x42A78224UL)))
#define bM4_PORT_PCRA4_INTE                       (*((volatile unsigned int*)(0x42A78230UL)))
#define bM4_PORT_PCRA4_LTE                        (*((volatile unsigned int*)(0x42A78238UL)))
#define bM4_PORT_PCRA4_DDIS                       (*((volatile unsigned int*)(0x42A7823CUL)))
