patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_PORT_PCRD13_PUU                       (*((volatile unsigned int*)(0x42A79E98UL)))
#define bM4_PORT_PCRD13_PIN                       (*((volatile unsigned int*)(0x42A79EA0UL)))
#define bM4_PORT_PCRD13_INVE                      (*((volatile unsigned int*)(0x42A79EA4UL)))
#define bM4_PORT_PCRD13_INTE                      (*((volatile unsigned int*)(0x42A79EB0UL)))
#define bM4_PORT_PCRD13_LTE                       (*((volatile unsigned int*)(0x42A79EB8UL)))
#define bM4_PORT_PCRD13_DDIS                      (*((volatile unsigned int*)(0x42A79EBCUL)))
#define bM4_PORT_PFSRD13_FSEL0                    (*((volatile unsigned int*)(0x42A79EC0UL)))
#define bM4_PORT_PFSRD13_FSEL1                    (*((volatile unsigned int*)(0x42A79EC4UL)))
#define bM4_PORT_PFSRD13_FSEL2                    (*((volatile unsigned int*)(0x42A79EC8UL)))
#define bM4_PORT_PFSRD13_FSEL3                    (*((volatile unsigned int*)(0x42A79ECCUL)))
#define bM4_PORT_PFSRD13_FSEL4                    (*((volatile unsigned int*)(0x42A79ED0UL)))
#define bM4_PORT_PFSRD13_FSEL5                    (*((volatile unsigned int*)(0x42A79ED4UL)))
#define bM4_PORT_PFSRD13_BFE                      (*((volatile unsigned int*)(0x42A79EE0UL)))
#define bM4_PORT_PCRD14_POUT                      (*((volatile unsigned int*)(0x42A79F00UL)))
#define bM4_PORT_PCRD14_POUTE                     (*((volatile unsigned int*)(0x42A79F04UL)))
#define bM4_PORT_PCRD14_NOD                       (*((volatile unsigned int*)(0x42A79F08UL)))
#define bM4_PORT_PCRD14_DRV0                      (*((volatile unsigned int*)(0x42A79F10UL)))
#define bM4_PORT_PCRD14_DRV1                      (*((volatile unsigned int*)(0x42A79F14UL)))
#define bM4_PORT_PCRD14_PUU                       (*((volatile unsigned int*)(0x42A79F18UL)))
#define bM4_PORT_PCRD14_PIN                       (*((volatile unsigned int*)(0x42A79F20UL)))
#define bM4_PORT_PCRD14_INVE                      (*((volatile unsigned int*)(0x42A79F24UL)))
#define bM4_PORT_PCRD14_INTE                      (*((volatile unsigned int*)(0x42A79F30UL)))
#define bM4_PORT_PCRD14_LTE                       (*((volatile unsigned int*)(0x42A79F38UL)))
#define bM4_PORT_PCRD14_DDIS                      (*((volatile unsigned int*)(0x42A79F3CUL)))
#define bM4_PORT_PFSRD14_FSEL0                    (*((volatile unsigned int*)(0x42A79F40UL)))
#define bM4_PORT_PFSRD14_FSEL1                    (*((volatile unsigned int*)(0x42A79F44UL)))
#define bM4_PORT_PFSRD14_FSEL2                    (*((volatile unsigned int*)(0x42A79F48UL)))
#define bM4_PORT_PFSRD14_FSEL3                    (*((volatile unsigned int*)(0x42A79F4CUL)))
#define bM4_PORT_PFSRD14_FSEL4                    (*((volatile unsigned int*)(0x42A79F50UL)))
#define bM4_PORT_PFSRD14_FSEL5                    (*((volatile unsigned int*)(0x42A79F54UL)))
#define bM4_PORT_PFSRD14_BFE                      (*((volatile unsigned int*)(0x42A79F60UL)))
#define bM4_PORT_PCRD15_POUT                      (*((volatile unsigned int*)(0x42A79F80UL)))
#define bM4_PORT_PCRD15_POUTE                     (*((volatile unsigned int*)(0x42A79F84UL)))
#define bM4_PORT_PCRD15_NOD                       (*((volatile unsigned int*)(0x42A79F88UL)))
#define bM4_PORT_PCRD15_DRV0                      (*((volatile unsigned int*)(0x42A79F90UL)))
#define bM4_PORT_PCRD15_DRV1                      (*((volatile unsigned int*)(0x42A79F94UL)))
#define bM4_PORT_PCRD15_PUU                       (*((volatile unsigned int*)(0x42A79F98UL)))
#define bM4_PORT_PCRD15_PIN                       (*((volatile unsigned int*)(0x42A79FA0UL)))
#define bM4_PORT_PCRD15_INVE                      (*((volatile unsigned int*)(0x42A79FA4UL)))
#define bM4_PORT_PCRD15_INTE                      (*((volatile unsigned int*)(0x42A79FB0UL)))
#define bM4_PORT_PCRD15_LTE                       (*((volatile unsigned int*)(0x42A79FB8UL)))
#define bM4_PORT_PCRD15_DDIS                      (*((volatile unsigned int*)(0x42A79FBCUL)))
#define bM4_PORT_PFSRD15_FSEL0                    (*((volatile unsigned int*)(0x42A79FC0UL)))
#define bM4_PORT_PFSRD15_FSEL1                    (*((volatile unsigned int*)(0x42A79FC4UL)))
#define bM4_PORT_PFSRD15_FSEL2                    (*((volatile unsigned int*)(0x42A79FC8UL)))
#define bM4_PORT_PFSRD15_FSEL3                    (*((volatile unsigned int*)(0x42A79FCCUL)))
#define bM4_PORT_PFSRD15_FSEL4                    (*((volatile unsigned int*)(0x42A79FD0UL)))
#define bM4_PORT_PFSRD15_FSEL5                    (*((volatile unsigned int*)(0x42A79FD4UL)))
#define bM4_PORT_PFSRD15_BFE                      (*((volatile unsigned int*)(0x42A79FE0UL)))
#define bM4_PORT_PCRE0_POUT                       (*((volatile unsigned int*)(0x42A7A000UL)))
#define bM4_PORT_PCRE0_POUTE                      (*((volatile unsigned int*)(0x42A7A004UL)))
#define bM4_PORT_PCRE0_NOD                        (*((volatile unsigned int*)(0x42A7A008UL)))
#define bM4_PORT_PCRE0_DRV0                       (*((volatile unsigned int*)(0x42A7A010UL)))
#define bM4_PORT_PCRE0_DRV1                       (*((volatile unsigned int*)(0x42A7A014UL)))
#define bM4_PORT_PCRE0_PUU                        (*((volatile unsigned int*)(0x42A7A018UL)))
#define bM4_PORT_PCRE0_PIN                        (*((volatile unsigned int*)(0x42A7A020UL)))
#define bM4_PORT_PCRE0_INVE                       (*((volatile unsigned int*)(0x42A7A024UL)))
#define bM4_PORT_PCRE0_INTE                       (*((volatile unsigned int*)(0x42A7A030UL)))
#define bM4_PORT_PCRE0_LTE                        (*((volatile unsigned int*)(0x42A7A038UL)))
#define bM4_PORT_PCRE0_DDIS                       (*((volatile unsigned int*)(0x42A7A03CUL)))
#define bM4_PORT_PFSRE0_FSEL0                     (*((volatile unsigned int*)(0x42A7A040UL)))
#define bM4_PORT_PFSRE0_FSEL1                     (*((volatile unsigned int*)(0x42A7A044UL)))
#define bM4_PORT_PFSRE0_FSEL2                     (*((volatile unsigned int*)(0x42A7A048UL)))
#define bM4_PORT_PFSRE0_FSEL3                     (*((volatile unsigned int*)(0x42A7A04CUL)))
#define bM4_PORT_PFSRE0_FSEL4                     (*((volatile unsigned int*)(0x42A7A050UL)))
#define bM4_PORT_PFSRE0_FSEL5                     (*((volatile unsigned int*)(0x42A7A054UL)))
#define bM4_PORT_PFSRE0_BFE                       (*((volatile unsigned int*)(0x42A7A060UL)))
#define bM4_PORT_PCRE1_POUT                       (*((volatile unsigned int*)(0x42A7A080UL)))
#define bM4_PORT_PCRE1_POUTE                      (*((volatile unsigned int*)(0x42A7A084UL)))
#define bM4_PORT_PCRE1_NOD                        (*((volatile unsigned int*)(0x42A7A088UL)))
#define bM4_PORT_PCRE1_DRV0                       (*((volatile unsigned int*)(0x42A7A090UL)))
#define bM4_PORT_PCRE1_DRV1                       (*((volatile unsigned int*)(0x42A7A094UL)))
#define bM4_PORT_PCRE1_PUU                        (*((volatile unsigned int*)(0x42A7A098UL)))
#define bM4_PORT_PCRE1_PIN                        (*((volatile unsigned int*)(0x42A7A0A0UL)))
#define bM4_PORT_PCRE1_INVE                       (*((volatile unsigned int*)(0x42A7A0A4UL)))
#define bM4_PORT_PCRE1_INTE                       (*((volatile unsigned int*)(0x42A7A0B0UL)))
#define bM4_PORT_PCRE1_LTE                        (*((volatile unsigned int*)(0x42A7A0B8UL)))
#define bM4_PORT_PCRE1_DDIS                       (*((volatile unsigned int*)(0x42A7A0BCUL)))
#define bM4_PORT_PFSRE1_FSEL0                     (*((volatile unsigned int*)(0x42A7A0C0UL)))
#define bM4_PORT_PFSRE1_FSEL1                     (*((volatile unsigned int*)(0x42A7A0C4UL)))
#define bM4_PORT_PFSRE1_FSEL2                     (*((volatile unsigned int*)(0x42A7A0C8UL)))
#define bM4_PORT_PFSRE1_FSEL3                     (*((volatile unsigned int*)(0x42A7A0CCUL)))
#define bM4_PORT_PFSRE1_FSEL4                     (*((volatile unsigned int*)(0x42A7A0D0UL)))
#define bM4_PORT_PFSRE1_FSEL5                     (*((volatile unsigned int*)(0x42A7A0D4UL)))
#define bM4_PORT_PFSRE1_BFE                       (*((volatile unsigned int*)(0x42A7A0E0UL)))
#define bM4_PORT_PCRE2_POUT                       (*((volatile unsigned int*)(0x42A7A100UL)))
#define bM4_PORT_PCRE2_POUTE                      (*((volatile unsigned int*)(0x42A7A104UL)))
#define bM4_PORT_PCRE2_NOD                        (*((volatile unsigned int*)(0x42A7A108UL)))
#define bM4_PORT_PCRE2_DRV0                       (*((volatile unsigned int*)(0x42A7A110UL)))
#define bM4_PORT_PCRE2_DRV1                       (*((volatile unsigned int*)(0x42A7A114UL)))
#define bM4_PORT_PCRE2_PUU                        (*((volatile unsigned int*)(0x42A7A118UL)))
#define bM4_PORT_PCRE2_PIN                        (*((volatile unsigned int*)(0x42A7A120UL)))
#define bM4_PORT_PCRE2_INVE                       (*((volatile unsigned int*)(0x42A7A124UL)))
#define bM4_PORT_PCRE2_INTE                       (*((volatile unsigned int*)(0x42A7A130UL)))
#define bM4_PORT_PCRE2_LTE                        (*((volatile unsigned int*)(0x42A7A138UL)))
#define bM4_PORT_PCRE2_DDIS                       (*((volatile unsigned int*)(0x42A7A13CUL)))
#define bM4_PORT_PFSRE2_FSEL0                     (*((volatile unsigned int*)(0x42A7A140UL)))
#define bM4_PORT_PFSRE2_FSEL1                     (*((volatile unsigned int*)(0x42A7A144UL)))
#define bM4_PORT_PFSRE2_FSEL2                     (*((volatile unsigned int*)(0x42A7A148UL)))
#define bM4_PORT_PFSRE2_FSEL3                     (*((volatile unsigned int*)(0x42A7A14CUL)))
#define bM4_PORT_PFSRE2_FSEL4                     (*((volatile unsigned int*)(0x42A7A150UL)))
#define bM4_PORT_PFSRE2_FSEL5                     (*((volatile unsigned int*)(0x42A7A154UL)))
#define bM4_PORT_PFSRE2_BFE                       (*((volatile unsigned int*)(0x42A7A160UL)))
#define bM4_PORT_PCRE3_POUT                       (*((volatile unsigned int*)(0x42A7A180UL)))
#define bM4_PORT_PCRE3_POUTE                      (*((volatile unsigned int*)(0x42A7A184UL)))
#define bM4_PORT_PCRE3_NOD                        (*((volatile unsigned int*)(0x42A7A188UL)))
#define bM4_PORT_PCRE3_DRV0                       (*((volatile unsigned int*)(0x42A7A190UL)))
#define bM4_PORT_PCRE3_DRV1                       (*((volatile unsigned int*)(0x42A7A194UL)))
#define bM4_PORT_PCRE3_PUU                        (*((volatile unsigned int*)(0x42A7A198UL)))
#define bM4_PORT_PCRE3_PIN                        (*((volatile unsigned int*)(0x42A7A1A0UL)))
#define bM4_PORT_PCRE3_INVE                       (*((volatile unsigned int*)(0x42A7A1A4UL)))
#define bM4_PORT_PCRE3_INTE                       (*((volatile unsigned int*)(0x42A7A1B0UL)))
#define bM4_PORT_PCRE3_LTE                        (*((volatile unsigned int*)(0x42A7A1B8UL)))
#define bM4_PORT_PCRE3_DDIS                       (*((volatile unsigned int*)(0x42A7A1BCUL)))
#define bM4_PORT_PFSRE3_FSEL0                     (*((volatile unsigned int*)(0x42A7A1C0UL)))
#define bM4_PORT_PFSRE3_FSEL1                     (*((volatile unsigned int*)(0x42A7A1C4UL)))
#define bM4_PORT_PFSRE3_FSEL2                     (*((volatile unsigned int*)(0x42A7A1C8UL)))
#define bM4_PORT_PFSRE3_FSEL3                     (*((volatile unsigned int*)(0x42A7A1CCUL)))
#define bM4_PORT_PFSRE3_FSEL4                     (*((volatile unsigned int*)(0x42A7A1D0UL)))
#define bM4_PORT_PFSRE3_FSEL5                     (*((volatile unsigned int*)(0x42A7A1D4UL)))
#define bM4_PORT_PFSRE3_BFE                       (*((volatile unsigned int*)(0x42A7A1E0UL)))
#define bM4_PORT_PCRE4_POUT                       (*((volatile unsigned int*)(0x42A7A200UL)))
#define bM4_PORT_PCRE4_POUTE                      (*((volatile unsigned int*)(0x42A7A204UL)))
#define bM4_PORT_PCRE4_NOD                        (*((volatile unsigned int*)(0x42A7A208UL)))
#define bM4_PORT_PCRE4_DRV0                       (*((volatile unsigned int*)(0x42A7A210UL)))
#define bM4_PORT_PCRE4_DRV1                       (*((volatile unsigned int*)(0x42A7A214UL)))
#define bM4_PORT_PCRE4_PUU                        (*((volatile unsigned int*)(0x42A7A218UL)))
#define bM4_PORT_PCRE4_PIN                        (*((volatile unsigned int*)(0x42A7A220UL)))
#define bM4_PORT_PCRE4_INVE                       (*((volatile unsigned int*)(0x42A7A224UL)))
#define bM4_PORT_PCRE4_INTE                       (*((volatile unsigned int*)(0x42A7A230UL)))
#define bM4_PORT_PCRE4_LTE                        (*((volatile unsigned int*)(0x42A7A238UL)))
#define bM4_PORT_PCRE4_DDIS                       (*((volatile unsigned int*)(0x42A7A23CUL)))
#define bM4_PORT_PFSRE4_FSEL0                     (*((volatile unsigned int*)(0x42A7A240UL)))
#define bM4_PORT_PFSRE4_FSEL1                     (*((volatile unsigned int*)(0x42A7A244UL)))
#define bM4_PORT_PFSRE4_FSEL2                     (*((volatile unsigned int*)(0x42A7A248UL)))
#define bM4_PORT_PFSRE4_FSEL3                     (*((volatile unsigned int*)(0x42A7A24CUL)))
#define bM4_PORT_PFSRE4_FSEL4                     (*((volatile unsigned int*)(0x42A7A250UL)))
#define bM4_PORT_PFSRE4_FSEL5                     (*((volatile unsigned int*)(0x42A7A254UL)))
#define bM4_PORT_PFSRE4_BFE                       (*((volatile unsigned int*)(0x42A7A260UL)))
#define bM4_PORT_PCRE5_POUT                       (*((volatile unsigned int*)(0x42A7A280UL)))
#define bM4_PORT_PCRE5_POUTE                      (*((volatile unsigned int*)(0x42A7A284UL)))
#define bM4_PORT_PCRE5_NOD                        (*((volatile unsigned int*)(0x42A7A288UL)))
#define bM4_PORT_PCRE5_DRV0                       (*((volatile unsigned int*)(0x42A7A290UL)))
#define bM4_PORT_PCRE5_DRV1                       (*((volatile unsigned int*)(0x42A7A294UL)))
#define bM4_PORT_PCRE5_PUU                        (*((volatile unsigned int*)(0x42A7A298UL)))
#define bM4_PORT_PCRE5_PIN                        (*((volatile unsigned int*)(0x42A7A2A0UL)))
#define bM4_PORT_PCRE5_INVE                       (*((volatile unsigned int*)(0x42A7A2A4UL)))
#define bM4_PORT_PCRE5_INTE                       (*((volatile unsigned int*)(0x42A7A2B0UL)))
#define bM4_PORT_PCRE5_LTE                        (*((volatile unsigned int*)(0x42A7A2B8UL)))
#define bM4_PORT_PCRE5_DDIS                       (*((volatile unsigned int*)(0x42A7A2BCUL)))
#define bM4_PORT_PFSRE5_FSEL0                     (*((volatile unsigned int*)(0x42A7A2C0UL)))
#define bM4_PORT_PFSRE5_FSEL1                     (*((volatile unsigned int*)(0x42A7A2C4UL)))
#define bM4_PORT_PFSRE5_FSEL2                     (*((volatile unsigned int*)(0x42A7A2C8UL)))
#define bM4_PORT_PFSRE5_FSEL3                     (*((volatile unsigned int*)(0x42A7A2CCUL)))
#define bM4_PORT_PFSRE5_FSEL4                     (*((volatile unsigned int*)(0x42A7A2D0UL)))
#define bM4_PORT_PFSRE5_FSEL5                     (*((volatile unsigned int*)(0x42A7A2D4UL)))
#define bM4_PORT_PFSRE5_BFE                       (*((volatile unsigned int*)(0x42A7A2E0UL)))
#define bM4_PORT_PCRE6_POUT                       (*((volatile unsigned int*)(0x42A7A300UL)))
#define bM4_PORT_PCRE6_POUTE                      (*((volatile unsigned int*)(0x42A7A304UL)))
#define bM4_PORT_PCRE6_NOD                        (*((volatile unsigned int*)(0x42A7A308UL)))
#define bM4_PORT_PCRE6_DRV0                       (*((volatile unsigned int*)(0x42A7A310UL)))
#define bM4_PORT_PCRE6_DRV1                       (*((volatile unsigned int*)(0x42A7A314UL)))
#define bM4_PORT_PCRE6_PUU                        (*((volatile unsigned int*)(0x42A7A318UL)))
#define bM4_PORT_PCRE6_PIN                        (*((volatile unsigned int*)(0x42A7A320UL)))
#define bM4_PORT_PCRE6_INVE                       (*((volatile unsigned int*)(0x42A7A324UL)))
#define bM4_PORT_PCRE6_INTE                       (*((volatile unsigned int*)(0x42A7A330UL)))
#define bM4_PORT_PCRE6_LTE                        (*((volatile unsigned int*)(0x42A7A338UL)))
#define bM4_PORT_PCRE6_DDIS                       (*((volatile unsigned int*)(0x42A7A33CUL)))
#define bM4_PORT_PFSRE6_FSEL0                     (*((volatile unsigned int*)(0x42A7A340UL)))
#define bM4_PORT_PFSRE6_FSEL1                     (*((volatile unsigned int*)(0x42A7A344UL)))
#define bM4_PORT_PFSRE6_FSEL2                     (*((volatile unsigned int*)(0x42A7A348UL)))
#define bM4_PORT_PFSRE6_FSEL3                     (*((volatile unsigned int*)(0x42A7A34CUL)))
#define bM4_PORT_PFSRE6_FSEL4                     (*((volatile unsigned int*)(0x42A7A350UL)))
#define bM4_PORT_PFSRE6_FSEL5                     (*((volatile unsigned int*)(0x42A7A354UL)))
#define bM4_PORT_PFSRE6_BFE                       (*((volatile unsigned int*)(0x42A7A360UL)))
#define bM4_PORT_PCRE7_POUT                       (*((volatile unsigned int*)(0x42A7A380UL)))
#define bM4_PORT_PCRE7_POUTE                      (*((volatile unsigned int*)(0x42A7A384UL)))
#define bM4_PORT_PCRE7_NOD                        (*((volatile unsigned int*)(0x42A7A388UL)))
#define bM4_PORT_PCRE7_DRV0                       (*((volatile unsigned int*)(0x42A7A390UL)))
#define bM4_PORT_PCRE7_DRV1                       (*((volatile unsigned int*)(0x42A7A394UL)))
#define bM4_PORT_PCRE7_PUU                        (*((volatile unsigned int*)(0x42A7A398UL)))
#define bM4_PORT_PCRE7_PIN                        (*((volatile unsigned int*)(0x42A7A3A0UL)))
#define bM4_PORT_PCRE7_INVE                       (*((volatile unsigned int*)(0x42A7A3A4UL)))
#define bM4_PORT_PCRE7_INTE                       (*((volatile unsigned int*)(0x42A7A3B0UL)))
#define bM4_PORT_PCRE7_LTE                        (*((volatile unsigned int*)(0x42A7A3B8UL)))
#define bM4_PORT_PCRE7_DDIS                       (*((volatile unsigned int*)(0x42A7A3BCUL)))
#define bM4_PORT_PFSRE7_FSEL0                     (*((volatile unsigned int*)(0x42A7A3C0UL)))
#define bM4_PORT_PFSRE7_FSEL1                     (*((volatile unsigned int*)(0x42A7A3C4UL)))
#define bM4_PORT_PFSRE7_FSEL2                     (*((volatile unsigned int*)(0x42A7A3C8UL)))
#define bM4_PORT_PFSRE7_FSEL3                     (*((volatile unsigned int*)(0x42A7A3CCUL)))
#define bM4_PORT_PFSRE7_FSEL4                     (*((volatile unsigned int*)(0x42A7A3D0UL)))
#define bM4_PORT_PFSRE7_FSEL5                     (*((volatile unsigned int*)(0x42A7A3D4UL)))
#define bM4_PORT_PFSRE7_BFE                       (*((volatile unsigned int*)(0x42A7A3E0UL)))
#define bM4_PORT_PCRE8_POUT                       (*((volatile unsigned int*)(0x42A7A400UL)))
#define bM4_PORT_PCRE8_POUTE                      (*((volatile unsigned int*)(0x42A7A404UL)))
#define bM4_PORT_PCRE8_NOD                        (*((volatile unsigned int*)(0x42A7A408UL)))
#define bM4_PORT_PCRE8_DRV0                       (*((volatile unsigned int*)(0x42A7A410UL)))
#define bM4_PORT_PCRE8_DRV1                       (*((volatile unsigned int*)(0x42A7A414UL)))
#define bM4_PORT_PCRE8_PUU                        (*((volatile unsigned int*)(0x42A7A418UL)))
#define bM4_PORT_PCRE8_PIN                        (*((volatile unsigned int*)(0x42A7A420UL)))
#define bM4_PORT_PCRE8_INVE                       (*((volatile unsigned int*)(0x42A7A424UL)))
#define bM4_PORT_PCRE8_INTE                       (*((volatile unsigned int*)(0x42A7A430UL)))
#define bM4_PORT_PCRE8_LTE                        (*((volatile unsigned int*)(0x42A7A438UL)))
#define bM4_PORT_PCRE8_DDIS                       (*((volatile unsigned int*)(0x42A7A43CUL)))
#define bM4_PORT_PFSRE8_FSEL0                     (*((volatile unsigned int*)(0x42A7A440UL)))
#define bM4_PORT_PFSRE8_FSEL1                     (*((volatile unsigned int*)(0x42A7A444UL)))
#define bM4_PORT_PFSRE8_FSEL2                     (*((volatile unsigned int*)(0x42A7A448UL)))
#define bM4_PORT_PFSRE8_FSEL3                     (*((volatile unsigned int*)(0x42A7A44CUL)))
#define bM4_PORT_PFSRE8_FSEL4                     (*((volatile unsigned int*)(0x42A7A450UL)))
#define bM4_PORT_PFSRE8_FSEL5                     (*((volatile unsigned int*)(0x42A7A454UL)))
#define bM4_PORT_PFSRE8_BFE                       (*((volatile unsigned int*)(0x42A7A460UL)))
#define bM4_PORT_PCRE9_POUT                       (*((volatile unsigned int*)(0x42A7A480UL)))
#define bM4_PORT_PCRE9_POUTE                      (*((volatile unsigned int*)(0x42A7A484UL)))
#define bM4_PORT_PCRE9_NOD                        (*((volatile unsigned int*)(0x42A7A488UL)))
#define bM4_PORT_PCRE9_DRV0                       (*((volatile unsigned int*)(0x42A7A490UL)))
#define bM4_PORT_PCRE9_DRV1                       (*((volatile unsigned int*)(0x42A7A494UL)))
#define bM4_PORT_PCRE9_PUU                        (*((volatile unsigned int*)(0x42A7A498UL)))
#define bM4_PORT_PCRE9_PIN                        (*((volatile unsigned int*)(0x42A7A4A0UL)))
#define bM4_PORT_PCRE9_INVE                       (*((volatile unsigned int*)(0x42A7A4A4UL)))
#define bM4_PORT_PCRE9_INTE                       (*((volatile unsigned int*)(0x42A7A4B0UL)))
#define bM4_PORT_PCRE9_LTE                        (*((volatile unsigned int*)(0x42A7A4B8UL)))
#define bM4_PORT_PCRE9_DDIS                       (*((volatile unsigned int*)(0x42A7A4BCUL)))
#define bM4_PORT_PFSRE9_FSEL0                     (*((volatile unsigned int*)(0x42A7A4C0UL)))
#define bM4_PORT_PFSRE9_FSEL1                     (*((volatile unsigned int*)(0x42A7A4C4UL)))
#define bM4_PORT_PFSRE9_FSEL2                     (*((volatile unsigned int*)(0x42A7A4C8UL)))
#define bM4_PORT_PFSRE9_FSEL3                     (*((volatile unsigned int*)(0x42A7A4CCUL)))
#define bM4_PORT_PFSRE9_FSEL4                     (*((volatile unsigned int*)(0x42A7A4D0UL)))
#define bM4_PORT_PFSRE9_FSEL5                     (*((volatile unsigned int*)(0x42A7A4D4UL)))
#define bM4_PORT_PFSRE9_BFE                       (*((volatile unsigned int*)(0x42A7A4E0UL)))
#define bM4_PORT_PCRE10_POUT                      (*((volatile unsigned int*)(0x42A7A500UL)))
#define bM4_PORT_PCRE10_POUTE                     (*((volatile unsigned int*)(0x42A7A504UL)))
#define bM4_PORT_PCRE10_NOD                       (*((volatile unsigned int*)(0x42A7A508UL)))
#define bM4_PORT_PCRE10_DRV0                      (*((volatile unsigned int*)(0x42A7A510UL)))
#define bM4_PORT_PCRE10_DRV1                      (*((volatile unsigned int*)(0x42A7A514UL)))
#define bM4_PORT_PCRE10_PUU                       (*((volatile unsigned int*)(0x42A7A518UL)))
#define bM4_PORT_PCRE10_PIN                       (*((volatile unsigned int*)(0x42A7A520UL)))
#define bM4_PORT_PCRE10_INVE                      (*((volatile unsigned int*)(0x42A7A524UL)))
#define bM4_PORT_PCRE10_INTE                      (*((volatile unsigned int*)(0x42A7A530UL)))
#define bM4_PORT_PCRE10_LTE                       (*((volatile unsigned int*)(0x42A7A538UL)))
#define bM4_PORT_PCRE10_DDIS                      (*((volatile unsigned int*)(0x42A7A53CUL)))
#define bM4_PORT_PFSRE10_FSEL0                    (*((volatile unsigned int*)(0x42A7A540UL)))
#define bM4_PORT_PFSRE10_FSEL1                    (*((volatile unsigned int*)(0x42A7A544UL)))
#define bM4_PORT_PFSRE10_FSEL2                    (*((volatile unsigned int*)(0x42A7A548UL)))
#define bM4_PORT_PFSRE10_FSEL3                    (*((volatile unsigned int*)(0x42A7A54CUL)))
#define bM4_PORT_PFSRE10_FSEL4                    (*((volatile unsigned int*)(0x42A7A550UL)))
#define bM4_PORT_PFSRE10_FSEL5                    (*((volatile unsigned int*)(0x42A7A554UL)))
#define bM4_PORT_PFSRE10_BFE                      (*((volatile unsigned int*)(0x42A7A560UL)))
#define bM4_PORT_PCRE11_POUT                      (*((volatile unsigned int*)(0x42A7A580UL)))
#define bM4_PORT_PCRE11_POUTE                     (*((volatile unsigned int*)(0x42A7A584UL)))
#define bM4_PORT_PCRE11_NOD                       (*((volatile unsigned int*)(0x42A7A588UL)))
#define bM4_PORT_PCRE11_DRV0                      (*((volatile unsigned int*)(0x42A7A590UL)))
#define bM4_PORT_PCRE11_DRV1                      (*((volatile unsigned int*)(0x42A7A594UL)))
#define bM4_PORT_PCRE11_PUU                       (*((volatile unsigned int*)(0x42A7A598UL)))
#define bM4_PORT_PCRE11_PIN                       (*((volatile unsigned int*)(0x42A7A5A0UL)))
#define bM4_PORT_PCRE11_INVE                      (*((volatile unsigned int*)(0x42A7A5A4UL)))
