patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_SYSREG_PWR_FPRC_FPRCWE7               (*((volatile unsigned int*)(0x42A87FFCUL)))
#define bM4_SYSREG_PWR_PWRC0_PDMDS0               (*((volatile unsigned int*)(0x42A88000UL)))
#define bM4_SYSREG_PWR_PWRC0_PDMDS1               (*((volatile unsigned int*)(0x42A88004UL)))
#define bM4_SYSREG_PWR_PWRC0_VVDRSD               (*((volatile unsigned int*)(0x42A88008UL)))
#define bM4_SYSREG_PWR_PWRC0_RETRAMSD             (*((volatile unsigned int*)(0x42A8800CUL)))
#define bM4_SYSREG_PWR_PWRC0_IORTN0               (*((volatile unsigned int*)(0x42A88010UL)))
#define bM4_SYSREG_PWR_PWRC0_IORTN1               (*((volatile unsigned int*)(0x42A88014UL)))
#define bM4_SYSREG_PWR_PWRC0_PWDN                 (*((volatile unsigned int*)(0x42A8801CUL)))
#define bM4_SYSREG_PWR_PWRC1_VPLLSD               (*((volatile unsigned int*)(0x42A88020UL)))
#define bM4_SYSREG_PWR_PWRC1_VHRCSD               (*((volatile unsigned int*)(0x42A88024UL)))
#define bM4_SYSREG_PWR_PWRC1_STPDAS0              (*((volatile unsigned int*)(0x42A88038UL)))
#define bM4_SYSREG_PWR_PWRC1_STPDAS1              (*((volatile unsigned int*)(0x42A8803CUL)))
#define bM4_SYSREG_PWR_PWRC2_DDAS0                (*((volatile unsigned int*)(0x42A88040UL)))
#define bM4_SYSREG_PWR_PWRC2_DDAS1                (*((volatile unsigned int*)(0x42A88044UL)))
#define bM4_SYSREG_PWR_PWRC2_DDAS2                (*((volatile unsigned int*)(0x42A88048UL)))
#define bM4_SYSREG_PWR_PWRC2_DDAS3                (*((volatile unsigned int*)(0x42A8804CUL)))
#define bM4_SYSREG_PWR_PWRC2_DVS0                 (*((volatile unsigned int*)(0x42A88050UL)))
#define bM4_SYSREG_PWR_PWRC2_DVS1                 (*((volatile unsigned int*)(0x42A88054UL)))
#define bM4_SYSREG_PWR_PWRC3_PDTS                 (*((volatile unsigned int*)(0x42A88068UL)))
#define bM4_SYSREG_PWR_PDWKE0_WKE00               (*((volatile unsigned int*)(0x42A88080UL)))
#define bM4_SYSREG_PWR_PDWKE0_WKE01               (*((volatile unsigned int*)(0x42A88084UL)))
#define bM4_SYSREG_PWR_PDWKE0_WKE02               (*((volatile unsigned int*)(0x42A88088UL)))
#define bM4_SYSREG_PWR_PDWKE0_WKE03               (*((volatile unsigned int*)(0x42A8808CUL)))
#define bM4_SYSREG_PWR_PDWKE0_WKE10               (*((volatile unsigned int*)(0x42A88090UL)))
#define bM4_SYSREG_PWR_PDWKE0_WKE11               (*((volatile unsigned int*)(0x42A88094UL)))
#define bM4_SYSREG_PWR_PDWKE0_WKE12               (*((volatile unsigned int*)(0x42A88098UL)))
#define bM4_SYSREG_PWR_PDWKE0_WKE13               (*((volatile unsigned int*)(0x42A8809CUL)))
#define bM4_SYSREG_PWR_PDWKE1_WKE20               (*((volatile unsigned int*)(0x42A880A0UL)))
#define bM4_SYSREG_PWR_PDWKE1_WKE21               (*((volatile unsigned int*)(0x42A880A4UL)))
#define bM4_SYSREG_PWR_PDWKE1_WKE22               (*((volatile unsigned int*)(0x42A880A8UL)))
#define bM4_SYSREG_PWR_PDWKE1_WKE23               (*((volatile unsigned int*)(0x42A880ACUL)))
#define bM4_SYSREG_PWR_PDWKE1_WKE30               (*((volatile unsigned int*)(0x42A880B0UL)))
#define bM4_SYSREG_PWR_PDWKE1_WKE31               (*((volatile unsigned int*)(0x42A880B4UL)))
#define bM4_SYSREG_PWR_PDWKE1_WKE32               (*((volatile unsigned int*)(0x42A880B8UL)))
#define bM4_SYSREG_PWR_PDWKE1_WKE33               (*((volatile unsigned int*)(0x42A880BCUL)))
#define bM4_SYSREG_PWR_PDWKE2_VD1WKE              (*((volatile unsigned int*)(0x42A880C0UL)))
#define bM4_SYSREG_PWR_PDWKE2_VD2WKE              (*((volatile unsigned int*)(0x42A880C4UL)))
#define bM4_SYSREG_PWR_PDWKE2_NMIWKE              (*((volatile unsigned int*)(0x42A880C8UL)))
#define bM4_SYSREG_PWR_PDWKE2_RTCPRDWKE           (*((volatile unsigned int*)(0x42A880D0UL)))
#define bM4_SYSREG_PWR_PDWKE2_RTCALMWKE           (*((volatile unsigned int*)(0x42A880D4UL)))
#define bM4_SYSREG_PWR_PDWKE2_WKTMWKE             (*((volatile unsigned int*)(0x42A880DCUL)))
#define bM4_SYSREG_PWR_PDWKES_WK0EGS              (*((volatile unsigned int*)(0x42A880E0UL)))
#define bM4_SYSREG_PWR_PDWKES_WK1EGS              (*((volatile unsigned int*)(0x42A880E4UL)))
#define bM4_SYSREG_PWR_PDWKES_WK2EGS              (*((volatile unsigned int*)(0x42A880E8UL)))
#define bM4_SYSREG_PWR_PDWKES_WK3EGS              (*((volatile unsigned int*)(0x42A880ECUL)))
#define bM4_SYSREG_PWR_PDWKES_VD1EGS              (*((volatile unsigned int*)(0x42A880F0UL)))
#define bM4_SYSREG_PWR_PDWKES_VD2EGS              (*((volatile unsigned int*)(0x42A880F4UL)))
#define bM4_SYSREG_PWR_PDWKES_NMIEGS              (*((volatile unsigned int*)(0x42A880F8UL)))
#define bM4_SYSREG_PWR_PDWKF0_PTWK0F              (*((volatile unsigned int*)(0x42A88100UL)))
#define bM4_SYSREG_PWR_PDWKF0_PTWK1F              (*((volatile unsigned int*)(0x42A88104UL)))
#define bM4_SYSREG_PWR_PDWKF0_PTWK2F              (*((volatile unsigned int*)(0x42A88108UL)))
#define bM4_SYSREG_PWR_PDWKF0_PTWK3F              (*((volatile unsigned int*)(0x42A8810CUL)))
#define bM4_SYSREG_PWR_PDWKF0_VD1WKF              (*((volatile unsigned int*)(0x42A88110UL)))
#define bM4_SYSREG_PWR_PDWKF0_VD2WKF              (*((volatile unsigned int*)(0x42A88114UL)))
#define bM4_SYSREG_PWR_PDWKF0_NMIWKF              (*((volatile unsigned int*)(0x42A88118UL)))
#define bM4_SYSREG_PWR_PDWKF1_RXD0WKF             (*((volatile unsigned int*)(0x42A8812CUL)))
#define bM4_SYSREG_PWR_PDWKF1_RTCPRDWKF           (*((volatile unsigned int*)(0x42A88130UL)))
#define bM4_SYSREG_PWR_PDWKF1_RTCALMWKF           (*((volatile unsigned int*)(0x42A88134UL)))
#define bM4_SYSREG_PWR_PDWKF1_WKTMWKF             (*((volatile unsigned int*)(0x42A8813CUL)))
#define bM4_SYSREG_PWR_PWCMR_ADBUFE               (*((volatile unsigned int*)(0x42A8815CUL)))
#define bM4_SYSREG_CMU_XTALCFGR_XTALDRV0          (*((volatile unsigned int*)(0x42A88210UL)))
#define bM4_SYSREG_CMU_XTALCFGR_XTALDRV1          (*((volatile unsigned int*)(0x42A88214UL)))
#define bM4_SYSREG_CMU_XTALCFGR_XTALMS            (*((volatile unsigned int*)(0x42A88218UL)))
#define bM4_SYSREG_CMU_XTALCFGR_SUPDRV            (*((volatile unsigned int*)(0x42A8821CUL)))
#define bM4_SYSREG_PWR_PVDCR0_EXVCCINEN           (*((volatile unsigned int*)(0x42A88240UL)))
#define bM4_SYSREG_PWR_PVDCR0_PVD1EN              (*((volatile unsigned int*)(0x42A88254UL)))
#define bM4_SYSREG_PWR_PVDCR0_PVD2EN              (*((volatile unsigned int*)(0x42A88258UL)))
#define bM4_SYSREG_PWR_PVDCR1_PVD1IRE             (*((volatile unsigned int*)(0x42A88260UL)))
#define bM4_SYSREG_PWR_PVDCR1_PVD1IRS             (*((volatile unsigned int*)(0x42A88264UL)))
#define bM4_SYSREG_PWR_PVDCR1_PVD1CMPOE           (*((volatile unsigned int*)(0x42A88268UL)))
#define bM4_SYSREG_PWR_PVDCR1_PVD2IRE             (*((volatile unsigned int*)(0x42A88270UL)))
#define bM4_SYSREG_PWR_PVDCR1_PVD2IRS             (*((volatile unsigned int*)(0x42A88274UL)))
#define bM4_SYSREG_PWR_PVDCR1_PVD2CMPOE           (*((volatile unsigned int*)(0x42A88278UL)))
#define bM4_SYSREG_PWR_PVDFCR_PVD1NFDIS           (*((volatile unsigned int*)(0x42A88280UL)))
#define bM4_SYSREG_PWR_PVDFCR_PVD1NFCKS0          (*((volatile unsigned int*)(0x42A88284UL)))
#define bM4_SYSREG_PWR_PVDFCR_PVD1NFCKS1          (*((volatile unsigned int*)(0x42A88288UL)))
#define bM4_SYSREG_PWR_PVDFCR_PVD2NFDIS           (*((volatile unsigned int*)(0x42A88290UL)))
#define bM4_SYSREG_PWR_PVDFCR_PVD2NFCKS0          (*((volatile unsigned int*)(0x42A88294UL)))
#define bM4_SYSREG_PWR_PVDFCR_PVD2NFCKS1          (*((volatile unsigned int*)(0x42A88298UL)))
#define bM4_SYSREG_PWR_PVDLCR_PVD1LVL0            (*((volatile unsigned int*)(0x42A882A0UL)))
#define bM4_SYSREG_PWR_PVDLCR_PVD1LVL1            (*((volatile unsigned int*)(0x42A882A4UL)))
#define bM4_SYSREG_PWR_PVDLCR_PVD1LVL2            (*((volatile unsigned int*)(0x42A882A8UL)))
#define bM4_SYSREG_PWR_PVDLCR_PVD2LVL0            (*((volatile unsigned int*)(0x42A882B0UL)))
#define bM4_SYSREG_PWR_PVDLCR_PVD2LVL1            (*((volatile unsigned int*)(0x42A882B4UL)))
#define bM4_SYSREG_PWR_PVDLCR_PVD2LVL2            (*((volatile unsigned int*)(0x42A882B8UL)))
#define bM4_SYSREG_CMU_XTAL32CR_XTAL32STP         (*((volatile unsigned int*)(0x42A88400UL)))
#define bM4_SYSREG_CMU_XTAL32CFGR_XTAL32DRV0      (*((volatile unsigned int*)(0x42A88420UL)))
#define bM4_SYSREG_CMU_XTAL32CFGR_XTAL32DRV1      (*((volatile unsigned int*)(0x42A88424UL)))
#define bM4_SYSREG_CMU_XTAL32CFGR_XTAL32DRV2      (*((volatile unsigned int*)(0x42A88428UL)))
#define bM4_SYSREG_CMU_XTAL32NFR_XTAL32NF0        (*((volatile unsigned int*)(0x42A884A0UL)))
#define bM4_SYSREG_CMU_XTAL32NFR_XTAL32NF1        (*((volatile unsigned int*)(0x42A884A4UL)))
#define bM4_SYSREG_CMU_LRCCR_LRCSTP               (*((volatile unsigned int*)(0x42A884E0UL)))
#define bM4_SYSREG_PWR_XTAL32CS_CSDIS             (*((volatile unsigned int*)(0x42A8857CUL)))
#define bM4_TMR01_CNTAR_CNTA0                     (*((volatile unsigned int*)(0x42480000UL)))
#define bM4_TMR01_CNTAR_CNTA1                     (*((volatile unsigned int*)(0x42480004UL)))
#define bM4_TMR01_CNTAR_CNTA2                     (*((volatile unsigned int*)(0x42480008UL)))
#define bM4_TMR01_CNTAR_CNTA3                     (*((volatile unsigned int*)(0x4248000CUL)))
#define bM4_TMR01_CNTAR_CNTA4                     (*((volatile unsigned int*)(0x42480010UL)))
#define bM4_TMR01_CNTAR_CNTA5                     (*((volatile unsigned int*)(0x42480014UL)))
#define bM4_TMR01_CNTAR_CNTA6                     (*((volatile unsigned int*)(0x42480018UL)))
#define bM4_TMR01_CNTAR_CNTA7                     (*((volatile unsigned int*)(0x4248001CUL)))
#define bM4_TMR01_CNTAR_CNTA8                     (*((volatile unsigned int*)(0x42480020UL)))
#define bM4_TMR01_CNTAR_CNTA9                     (*((volatile unsigned int*)(0x42480024UL)))
#define bM4_TMR01_CNTAR_CNTA10                    (*((volatile unsigned int*)(0x42480028UL)))
#define bM4_TMR01_CNTAR_CNTA11                    (*((volatile unsigned int*)(0x4248002CUL)))
#define bM4_TMR01_CNTAR_CNTA12                    (*((volatile unsigned int*)(0x42480030UL)))
#define bM4_TMR01_CNTAR_CNTA13                    (*((volatile unsigned int*)(0x42480034UL)))
#define bM4_TMR01_CNTAR_CNTA14                    (*((volatile unsigned int*)(0x42480038UL)))
#define bM4_TMR01_CNTAR_CNTA15                    (*((volatile unsigned int*)(0x4248003CUL)))
#define bM4_TMR01_CNTBR_CNTB0                     (*((volatile unsigned int*)(0x42480080UL)))
#define bM4_TMR01_CNTBR_CNTB1                     (*((volatile unsigned int*)(0x42480084UL)))
#define bM4_TMR01_CNTBR_CNTB2                     (*((volatile unsigned int*)(0x42480088UL)))
#define bM4_TMR01_CNTBR_CNTB3                     (*((volatile unsigned int*)(0x4248008CUL)))
#define bM4_TMR01_CNTBR_CNTB4                     (*((volatile unsigned int*)(0x42480090UL)))
#define bM4_TMR01_CNTBR_CNTB5                     (*((volatile unsigned int*)(0x42480094UL)))
#define bM4_TMR01_CNTBR_CNTB6                     (*((volatile unsigned int*)(0x42480098UL)))
#define bM4_TMR01_CNTBR_CNTB7                     (*((volatile unsigned int*)(0x4248009CUL)))
#define bM4_TMR01_CNTBR_CNTB8                     (*((volatile unsigned int*)(0x424800A0UL)))
#define bM4_TMR01_CNTBR_CNTB9                     (*((volatile unsigned int*)(0x424800A4UL)))
#define bM4_TMR01_CNTBR_CNTB10                    (*((volatile unsigned int*)(0x424800A8UL)))
#define bM4_TMR01_CNTBR_CNTB11                    (*((volatile unsigned int*)(0x424800ACUL)))
#define bM4_TMR01_CNTBR_CNTB12                    (*((volatile unsigned int*)(0x424800B0UL)))
#define bM4_TMR01_CNTBR_CNTB13                    (*((volatile unsigned int*)(0x424800B4UL)))
#define bM4_TMR01_CNTBR_CNTB14                    (*((volatile unsigned int*)(0x424800B8UL)))
#define bM4_TMR01_CNTBR_CNTB15                    (*((volatile unsigned int*)(0x424800BCUL)))
#define bM4_TMR01_CMPAR_CMPA0                     (*((volatile unsigned int*)(0x42480100UL)))
#define bM4_TMR01_CMPAR_CMPA1                     (*((volatile unsigned int*)(0x42480104UL)))
#define bM4_TMR01_CMPAR_CMPA2                     (*((volatile unsigned int*)(0x42480108UL)))
#define bM4_TMR01_CMPAR_CMPA3                     (*((volatile unsigned int*)(0x4248010CUL)))
#define bM4_TMR01_CMPAR_CMPA4                     (*((volatile unsigned int*)(0x42480110UL)))
#define bM4_TMR01_CMPAR_CMPA5                     (*((volatile unsigned int*)(0x42480114UL)))
#define bM4_TMR01_CMPAR_CMPA6                     (*((volatile unsigned int*)(0x42480118UL)))
#define bM4_TMR01_CMPAR_CMPA7                     (*((volatile unsigned int*)(0x4248011CUL)))
#define bM4_TMR01_CMPAR_CMPA8                     (*((volatile unsigned int*)(0x42480120UL)))
#define bM4_TMR01_CMPAR_CMPA9                     (*((volatile unsigned int*)(0x42480124UL)))
#define bM4_TMR01_CMPAR_CMPA10                    (*((volatile unsigned int*)(0x42480128UL)))
#define bM4_TMR01_CMPAR_CMPA11                    (*((volatile unsigned int*)(0x4248012CUL)))
#define bM4_TMR01_CMPAR_CMPA12                    (*((volatile unsigned int*)(0x42480130UL)))
#define bM4_TMR01_CMPAR_CMPA13                    (*((volatile unsigned int*)(0x42480134UL)))
#define bM4_TMR01_CMPAR_CMPA14                    (*((volatile unsigned int*)(0x42480138UL)))
#define bM4_TMR01_CMPAR_CMPA15                    (*((volatile unsigned int*)(0x4248013CUL)))
#define bM4_TMR01_CMPBR_CMPB0                     (*((volatile unsigned int*)(0x42480180UL)))
#define bM4_TMR01_CMPBR_CMPB1                     (*((volatile unsigned int*)(0x42480184UL)))
#define bM4_TMR01_CMPBR_CMPB2                     (*((volatile unsigned int*)(0x42480188UL)))
#define bM4_TMR01_CMPBR_CMPB3                     (*((volatile unsigned int*)(0x4248018CUL)))
#define bM4_TMR01_CMPBR_CMPB4                     (*((volatile unsigned int*)(0x42480190UL)))
#define bM4_TMR01_CMPBR_CMPB5                     (*((volatile unsigned int*)(0x42480194UL)))
#define bM4_TMR01_CMPBR_CMPB6                     (*((volatile unsigned int*)(0x42480198UL)))
#define bM4_TMR01_CMPBR_CMPB7                     (*((volatile unsigned int*)(0x4248019CUL)))
#define bM4_TMR01_CMPBR_CMPB8                     (*((volatile unsigned int*)(0x424801A0UL)))
#define bM4_TMR01_CMPBR_CMPB9                     (*((volatile unsigned int*)(0x424801A4UL)))
#define bM4_TMR01_CMPBR_CMPB10                    (*((volatile unsigned int*)(0x424801A8UL)))
#define bM4_TMR01_CMPBR_CMPB11                    (*((volatile unsigned int*)(0x424801ACUL)))
#define bM4_TMR01_CMPBR_CMPB12                    (*((volatile unsigned int*)(0x424801B0UL)))
#define bM4_TMR01_CMPBR_CMPB13                    (*((volatile unsigned int*)(0x424801B4UL)))
#define bM4_TMR01_CMPBR_CMPB14                    (*((volatile unsigned int*)(0x424801B8UL)))
#define bM4_TMR01_CMPBR_CMPB15                    (*((volatile unsigned int*)(0x424801BCUL)))
#define bM4_TMR01_BCONR_CSTA                      (*((volatile unsigned int*)(0x42480200UL)))
#define bM4_TMR01_BCONR_CAPMDA                    (*((volatile unsigned int*)(0x42480204UL)))
#define bM4_TMR01_BCONR_INTENA                    (*((volatile unsigned int*)(0x42480208UL)))
#define bM4_TMR01_BCONR_CKDIVA0                   (*((volatile unsigned int*)(0x42480210UL)))
#define bM4_TMR01_BCONR_CKDIVA1                   (*((volatile unsigned int*)(0x42480214UL)))
#define bM4_TMR01_BCONR_CKDIVA2                   (*((volatile unsigned int*)(0x42480218UL)))
#define bM4_TMR01_BCONR_CKDIVA3                   (*((volatile unsigned int*)(0x4248021CUL)))
#define bM4_TMR01_BCONR_SYNSA                     (*((volatile unsigned int*)(0x42480220UL)))
#define bM4_TMR01_BCONR_SYNCLKA                   (*((volatile unsigned int*)(0x42480224UL)))
#define bM4_TMR01_BCONR_ASYNCLKA                  (*((volatile unsigned int*)(0x42480228UL)))
#define bM4_TMR01_BCONR_HSTAA                     (*((volatile unsigned int*)(0x42480230UL)))
#define bM4_TMR01_BCONR_HSTPA                     (*((volatile unsigned int*)(0x42480234UL)))
#define bM4_TMR01_BCONR_HCLEA                     (*((volatile unsigned int*)(0x42480238UL)))
#define bM4_TMR01_BCONR_HICPA                     (*((volatile unsigned int*)(0x4248023CUL)))
#define bM4_TMR01_BCONR_CSTB                      (*((volatile unsigned int*)(0x42480240UL)))
#define bM4_TMR01_BCONR_CAPMDB                    (*((volatile unsigned int*)(0x42480244UL)))
#define bM4_TMR01_BCONR_INTENB                    (*((volatile unsigned int*)(0x42480248UL)))
#define bM4_TMR01_BCONR_CKDIVB0                   (*((volatile unsigned int*)(0x42480250UL)))
#define bM4_TMR01_BCONR_CKDIVB1                   (*((volatile unsigned int*)(0x42480254UL)))
#define bM4_TMR01_BCONR_CKDIVB2                   (*((volatile unsigned int*)(0x42480258UL)))
#define bM4_TMR01_BCONR_CKDIVB3                   (*((volatile unsigned int*)(0x4248025CUL)))
#define bM4_TMR01_BCONR_SYNSB                     (*((volatile unsigned int*)(0x42480260UL)))
#define bM4_TMR01_BCONR_SYNCLKB                   (*((volatile unsigned int*)(0x42480264UL)))
#define bM4_TMR01_BCONR_ASYNCLKB                  (*((volatile unsigned int*)(0x42480268UL)))
#define bM4_TMR01_BCONR_HSTAB                     (*((volatile unsigned int*)(0x42480270UL)))
#define bM4_TMR01_BCONR_HSTPB                     (*((volatile unsigned int*)(0x42480274UL)))
#define bM4_TMR01_BCONR_HCLEB                     (*((volatile unsigned int*)(0x42480278UL)))
#define bM4_TMR01_BCONR_HICPB                     (*((volatile unsigned int*)(0x4248027CUL)))
#define bM4_TMR01_STFLR_CMAF                      (*((volatile unsigned int*)(0x42480280UL)))
#define bM4_TMR01_STFLR_CMBF                      (*((volatile unsigned int*)(0x424802C0UL)))
#define bM4_TMR02_CNTAR_CNTA0                     (*((volatile unsigned int*)(0x42488000UL)))
#define bM4_TMR02_CNTAR_CNTA1                     (*((volatile unsigned int*)(0x42488004UL)))
#define bM4_TMR02_CNTAR_CNTA2                     (*((volatile unsigned int*)(0x42488008UL)))
#define bM4_TMR02_CNTAR_CNTA3                     (*((volatile unsigned int*)(0x4248800CUL)))
#define bM4_TMR02_CNTAR_CNTA4                     (*((volatile unsigned int*)(0x42488010UL)))
#define bM4_TMR02_CNTAR_CNTA5                     (*((volatile unsigned int*)(0x42488014UL)))
#define bM4_TMR02_CNTAR_CNTA6                     (*((volatile unsigned int*)(0x42488018UL)))
#define bM4_TMR02_CNTAR_CNTA7                     (*((volatile unsigned int*)(0x4248801CUL)))
#define bM4_TMR02_CNTAR_CNTA8                     (*((volatile unsigned int*)(0x42488020UL)))
#define bM4_TMR02_CNTAR_CNTA9                     (*((volatile unsigned int*)(0x42488024UL)))
#define bM4_TMR02_CNTAR_CNTA10                    (*((volatile unsigned int*)(0x42488028UL)))
#define bM4_TMR02_CNTAR_CNTA11                    (*((volatile unsigned int*)(0x4248802CUL)))
#define bM4_TMR02_CNTAR_CNTA12                    (*((volatile unsigned int*)(0x42488030UL)))
#define bM4_TMR02_CNTAR_CNTA13                    (*((volatile unsigned int*)(0x42488034UL)))
#define bM4_TMR02_CNTAR_CNTA14                    (*((volatile unsigned int*)(0x42488038UL)))
#define bM4_TMR02_CNTAR_CNTA15                    (*((volatile unsigned int*)(0x4248803CUL)))
#define bM4_TMR02_CNTBR_CNTB0                     (*((volatile unsigned int*)(0x42488080UL)))
#define bM4_TMR02_CNTBR_CNTB1                     (*((volatile unsigned int*)(0x42488084UL)))
#define bM4_TMR02_CNTBR_CNTB2                     (*((volatile unsigned int*)(0x42488088UL)))
#define bM4_TMR02_CNTBR_CNTB3                     (*((volatile unsigned int*)(0x4248808CUL)))
#define bM4_TMR02_CNTBR_CNTB4                     (*((volatile unsigned int*)(0x42488090UL)))
#define bM4_TMR02_CNTBR_CNTB5                     (*((volatile unsigned int*)(0x42488094UL)))
#define bM4_TMR02_CNTBR_CNTB6                     (*((volatile unsigned int*)(0x42488098UL)))
#define bM4_TMR02_CNTBR_CNTB7                     (*((volatile unsigned int*)(0x4248809CUL)))
#define bM4_TMR02_CNTBR_CNTB8                     (*((volatile unsigned int*)(0x424880A0UL)))
#define bM4_TMR02_CNTBR_CNTB9                     (*((volatile unsigned int*)(0x424880A4UL)))
#define bM4_TMR02_CNTBR_CNTB10                    (*((volatile unsigned int*)(0x424880A8UL)))
#define bM4_TMR02_CNTBR_CNTB11                    (*((volatile unsigned int*)(0x424880ACUL)))
#define bM4_TMR02_CNTBR_CNTB12                    (*((volatile unsigned int*)(0x424880B0UL)))
#define bM4_TMR02_CNTBR_CNTB13                    (*((volatile unsigned int*)(0x424880B4UL)))
#define bM4_TMR02_CNTBR_CNTB14                    (*((volatile unsigned int*)(0x424880B8UL)))
#define bM4_TMR02_CNTBR_CNTB15                    (*((volatile unsigned int*)(0x424880BCUL)))
#define bM4_TMR02_CMPAR_CMPA0                     (*((volatile unsigned int*)(0x42488100UL)))
#define bM4_TMR02_CMPAR_CMPA1                     (*((volatile unsigned int*)(0x42488104UL)))
#define bM4_TMR02_CMPAR_CMPA2                     (*((volatile unsigned int*)(0x42488108UL)))
#define bM4_TMR02_CMPAR_CMPA3                     (*((volatile unsigned int*)(0x4248810CUL)))
#define bM4_TMR02_CMPAR_CMPA4                     (*((volatile unsigned int*)(0x42488110UL)))
#define bM4_TMR02_CMPAR_CMPA5                     (*((volatile unsigned int*)(0x42488114UL)))
#define bM4_TMR02_CMPAR_CMPA6                     (*((volatile unsigned int*)(0x42488118UL)))
#define bM4_TMR02_CMPAR_CMPA7                     (*((volatile unsigned int*)(0x4248811CUL)))
#define bM4_TMR02_CMPAR_CMPA8                     (*((volatile unsigned int*)(0x42488120UL)))
#define bM4_TMR02_CMPAR_CMPA9                     (*((volatile unsigned int*)(0x42488124UL)))
#define bM4_TMR02_CMPAR_CMPA10                    (*((volatile unsigned int*)(0x42488128UL)))
#define bM4_TMR02_CMPAR_CMPA11                    (*((volatile unsigned int*)(0x4248812CUL)))
#define bM4_TMR02_CMPAR_CMPA12                    (*((volatile unsigned int*)(0x42488130UL)))
#define bM4_TMR02_CMPAR_CMPA13                    (*((volatile unsigned int*)(0x42488134UL)))
#define bM4_TMR02_CMPAR_CMPA14                    (*((volatile unsigned int*)(0x42488138UL)))
#define bM4_TMR02_CMPAR_CMPA15                    (*((volatile unsigned int*)(0x4248813CUL)))
#define bM4_TMR02_CMPBR_CMPB0                     (*((volatile unsigned int*)(0x42488180UL)))
#define bM4_TMR02_CMPBR_CMPB1                     (*((volatile unsigned int*)(0x42488184UL)))
#define bM4_TMR02_CMPBR_CMPB2                     (*((volatile unsigned int*)(0x42488188UL)))
#define bM4_TMR02_CMPBR_CMPB3                     (*((volatile unsigned int*)(0x4248818CUL)))
#define bM4_TMR02_CMPBR_CMPB4                     (*((volatile unsigned int*)(0x42488190UL)))
#define bM4_TMR02_CMPBR_CMPB5                     (*((volatile unsigned int*)(0x42488194UL)))
#define bM4_TMR02_CMPBR_CMPB6                     (*((volatile unsigned int*)(0x42488198UL)))
#define bM4_TMR02_CMPBR_CMPB7                     (*((volatile unsigned int*)(0x4248819CUL)))
#define bM4_TMR02_CMPBR_CMPB8                     (*((volatile unsigned int*)(0x424881A0UL)))
#define bM4_TMR02_CMPBR_CMPB9                     (*((volatile unsigned int*)(0x424881A4UL)))
#define bM4_TMR02_CMPBR_CMPB10                    (*((volatile unsigned int*)(0x424881A8UL)))
#define bM4_TMR02_CMPBR_CMPB11                    (*((volatile unsigned int*)(0x424881ACUL)))
#define bM4_TMR02_CMPBR_CMPB12                    (*((volatile unsigned int*)(0x424881B0UL)))
#define bM4_TMR02_CMPBR_CMPB13                    (*((volatile unsigned int*)(0x424881B4UL)))
#define bM4_TMR02_CMPBR_CMPB14                    (*((volatile unsigned int*)(0x424881B8UL)))
#define bM4_TMR02_CMPBR_CMPB15                    (*((volatile unsigned int*)(0x424881BCUL)))
#define bM4_TMR02_BCONR_CSTA                      (*((volatile unsigned int*)(0x42488200UL)))
#define bM4_TMR02_BCONR_CAPMDA                    (*((volatile unsigned int*)(0x42488204UL)))
#define bM4_TMR02_BCONR_INTENA                    (*((volatile unsigned int*)(0x42488208UL)))
#define bM4_TMR02_BCONR_CKDIVA0                   (*((volatile unsigned int*)(0x42488210UL)))
