patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_TMR41_CVPR_PIM2                       (*((volatile unsigned int*)(0x422E0958UL)))
#define bM4_TMR41_CVPR_PIM3                       (*((volatile unsigned int*)(0x422E095CUL)))
#define bM4_TMR41_CVPR_ZIC0                       (*((volatile unsigned int*)(0x422E0960UL)))
#define bM4_TMR41_CVPR_ZIC1                       (*((volatile unsigned int*)(0x422E0964UL)))
#define bM4_TMR41_CVPR_ZIC2                       (*((volatile unsigned int*)(0x422E0968UL)))
#define bM4_TMR41_CVPR_ZIC3                       (*((volatile unsigned int*)(0x422E096CUL)))
#define bM4_TMR41_CVPR_PIC0                       (*((volatile unsigned int*)(0x422E0970UL)))
#define bM4_TMR41_CVPR_PIC1                       (*((volatile unsigned int*)(0x422E0974UL)))
#define bM4_TMR41_CVPR_PIC2                       (*((volatile unsigned int*)(0x422E0978UL)))
#define bM4_TMR41_CVPR_PIC3                       (*((volatile unsigned int*)(0x422E097CUL)))
#define bM4_TMR41_POCRU_DIVCK0                    (*((volatile unsigned int*)(0x422E1300UL)))
#define bM4_TMR41_POCRU_DIVCK1                    (*((volatile unsigned int*)(0x422E1304UL)))
#define bM4_TMR41_POCRU_DIVCK2                    (*((volatile unsigned int*)(0x422E1308UL)))
#define bM4_TMR41_POCRU_DIVCK3                    (*((volatile unsigned int*)(0x422E130CUL)))
#define bM4_TMR41_POCRU_PWMMD0                    (*((volatile unsigned int*)(0x422E1310UL)))
#define bM4_TMR41_POCRU_PWMMD1                    (*((volatile unsigned int*)(0x422E1314UL)))
#define bM4_TMR41_POCRU_LVLS0                     (*((volatile unsigned int*)(0x422E1318UL)))
#define bM4_TMR41_POCRU_LVLS1                     (*((volatile unsigned int*)(0x422E131CUL)))
#define bM4_TMR41_POCRV_DIVCK0                    (*((volatile unsigned int*)(0x422E1380UL)))
#define bM4_TMR41_POCRV_DIVCK1                    (*((volatile unsigned int*)(0x422E1384UL)))
#define bM4_TMR41_POCRV_DIVCK2                    (*((volatile unsigned int*)(0x422E1388UL)))
#define bM4_TMR41_POCRV_DIVCK3                    (*((volatile unsigned int*)(0x422E138CUL)))
#define bM4_TMR41_POCRV_PWMMD0                    (*((volatile unsigned int*)(0x422E1390UL)))
#define bM4_TMR41_POCRV_PWMMD1                    (*((volatile unsigned int*)(0x422E1394UL)))
#define bM4_TMR41_POCRV_LVLS0                     (*((volatile unsigned int*)(0x422E1398UL)))
#define bM4_TMR41_POCRV_LVLS1                     (*((volatile unsigned int*)(0x422E139CUL)))
#define bM4_TMR41_POCRW_DIVCK0                    (*((volatile unsigned int*)(0x422E1400UL)))
#define bM4_TMR41_POCRW_DIVCK1                    (*((volatile unsigned int*)(0x422E1404UL)))
#define bM4_TMR41_POCRW_DIVCK2                    (*((volatile unsigned int*)(0x422E1408UL)))
#define bM4_TMR41_POCRW_DIVCK3                    (*((volatile unsigned int*)(0x422E140CUL)))
#define bM4_TMR41_POCRW_PWMMD0                    (*((volatile unsigned int*)(0x422E1410UL)))
#define bM4_TMR41_POCRW_PWMMD1                    (*((volatile unsigned int*)(0x422E1414UL)))
#define bM4_TMR41_POCRW_LVLS0                     (*((volatile unsigned int*)(0x422E1418UL)))
#define bM4_TMR41_POCRW_LVLS1                     (*((volatile unsigned int*)(0x422E141CUL)))
#define bM4_TMR41_RCSR_RTIDU                      (*((volatile unsigned int*)(0x422E1480UL)))
#define bM4_TMR41_RCSR_RTIDV                      (*((volatile unsigned int*)(0x422E1484UL)))
#define bM4_TMR41_RCSR_RTIDW                      (*((volatile unsigned int*)(0x422E1488UL)))
#define bM4_TMR41_RCSR_RTIFU                      (*((volatile unsigned int*)(0x422E1490UL)))
#define bM4_TMR41_RCSR_RTICU                      (*((volatile unsigned int*)(0x422E1494UL)))
#define bM4_TMR41_RCSR_RTEU                       (*((volatile unsigned int*)(0x422E1498UL)))
#define bM4_TMR41_RCSR_RTSU                       (*((volatile unsigned int*)(0x422E149CUL)))
#define bM4_TMR41_RCSR_RTIFV                      (*((volatile unsigned int*)(0x422E14A0UL)))
#define bM4_TMR41_RCSR_RTICV                      (*((volatile unsigned int*)(0x422E14A4UL)))
#define bM4_TMR41_RCSR_RTEV                       (*((volatile unsigned int*)(0x422E14A8UL)))
#define bM4_TMR41_RCSR_RTSV                       (*((volatile unsigned int*)(0x422E14ACUL)))
#define bM4_TMR41_RCSR_RTIFW                      (*((volatile unsigned int*)(0x422E14B0UL)))
#define bM4_TMR41_RCSR_RTICW                      (*((volatile unsigned int*)(0x422E14B4UL)))
#define bM4_TMR41_RCSR_RTEW                       (*((volatile unsigned int*)(0x422E14B8UL)))
#define bM4_TMR41_RCSR_RTSW                       (*((volatile unsigned int*)(0x422E14BCUL)))
#define bM4_TMR41_SCSRUH_BUFEN0                   (*((volatile unsigned int*)(0x422E1900UL)))
#define bM4_TMR41_SCSRUH_BUFEN1                   (*((volatile unsigned int*)(0x422E1904UL)))
#define bM4_TMR41_SCSRUH_EVTOS0                   (*((volatile unsigned int*)(0x422E1908UL)))
#define bM4_TMR41_SCSRUH_EVTOS1                   (*((volatile unsigned int*)(0x422E190CUL)))
#define bM4_TMR41_SCSRUH_EVTOS2                   (*((volatile unsigned int*)(0x422E1910UL)))
#define bM4_TMR41_SCSRUH_LMC                      (*((volatile unsigned int*)(0x422E1914UL)))
#define bM4_TMR41_SCSRUH_EVTMS                    (*((volatile unsigned int*)(0x422E1920UL)))
#define bM4_TMR41_SCSRUH_EVTDS                    (*((volatile unsigned int*)(0x422E1924UL)))
#define bM4_TMR41_SCSRUH_DEN                      (*((volatile unsigned int*)(0x422E1930UL)))
#define bM4_TMR41_SCSRUH_PEN                      (*((volatile unsigned int*)(0x422E1934UL)))
#define bM4_TMR41_SCSRUH_UEN                      (*((volatile unsigned int*)(0x422E1938UL)))
#define bM4_TMR41_SCSRUH_ZEN                      (*((volatile unsigned int*)(0x422E193CUL)))
#define bM4_TMR41_SCMRUH_AMC0                     (*((volatile unsigned int*)(0x422E1940UL)))
#define bM4_TMR41_SCMRUH_AMC1                     (*((volatile unsigned int*)(0x422E1944UL)))
#define bM4_TMR41_SCMRUH_AMC2                     (*((volatile unsigned int*)(0x422E1948UL)))
#define bM4_TMR41_SCMRUH_AMC3                     (*((volatile unsigned int*)(0x422E194CUL)))
#define bM4_TMR41_SCMRUH_MZCE                     (*((volatile unsigned int*)(0x422E1958UL)))
#define bM4_TMR41_SCMRUH_MPCE                     (*((volatile unsigned int*)(0x422E195CUL)))
#define bM4_TMR41_SCSRUL_BUFEN0                   (*((volatile unsigned int*)(0x422E1980UL)))
#define bM4_TMR41_SCSRUL_BUFEN1                   (*((volatile unsigned int*)(0x422E1984UL)))
#define bM4_TMR41_SCSRUL_EVTOS0                   (*((volatile unsigned int*)(0x422E1988UL)))
#define bM4_TMR41_SCSRUL_EVTOS1                   (*((volatile unsigned int*)(0x422E198CUL)))
#define bM4_TMR41_SCSRUL_EVTOS2                   (*((volatile unsigned int*)(0x422E1990UL)))
#define bM4_TMR41_SCSRUL_LMC                      (*((volatile unsigned int*)(0x422E1994UL)))
#define bM4_TMR41_SCSRUL_EVTMS                    (*((volatile unsigned int*)(0x422E19A0UL)))
#define bM4_TMR41_SCSRUL_EVTDS                    (*((volatile unsigned int*)(0x422E19A4UL)))
#define bM4_TMR41_SCSRUL_DEN                      (*((volatile unsigned int*)(0x422E19B0UL)))
#define bM4_TMR41_SCSRUL_PEN                      (*((volatile unsigned int*)(0x422E19B4UL)))
#define bM4_TMR41_SCSRUL_UEN                      (*((volatile unsigned int*)(0x422E19B8UL)))
#define bM4_TMR41_SCSRUL_ZEN                      (*((volatile unsigned int*)(0x422E19BCUL)))
#define bM4_TMR41_SCMRUL_AMC0                     (*((volatile unsigned int*)(0x422E19C0UL)))
#define bM4_TMR41_SCMRUL_AMC1                     (*((volatile unsigned int*)(0x422E19C4UL)))
#define bM4_TMR41_SCMRUL_AMC2                     (*((volatile unsigned int*)(0x422E19C8UL)))
#define bM4_TMR41_SCMRUL_AMC3                     (*((volatile unsigned int*)(0x422E19CCUL)))
#define bM4_TMR41_SCMRUL_MZCE                     (*((volatile unsigned int*)(0x422E19D8UL)))
#define bM4_TMR41_SCMRUL_MPCE                     (*((volatile unsigned int*)(0x422E19DCUL)))
#define bM4_TMR41_SCSRVH_BUFEN0                   (*((volatile unsigned int*)(0x422E1A00UL)))
#define bM4_TMR41_SCSRVH_BUFEN1                   (*((volatile unsigned int*)(0x422E1A04UL)))
#define bM4_TMR41_SCSRVH_EVTOS0                   (*((volatile unsigned int*)(0x422E1A08UL)))
#define bM4_TMR41_SCSRVH_EVTOS1                   (*((volatile unsigned int*)(0x422E1A0CUL)))
#define bM4_TMR41_SCSRVH_EVTOS2                   (*((volatile unsigned int*)(0x422E1A10UL)))
#define bM4_TMR41_SCSRVH_LMC                      (*((volatile unsigned int*)(0x422E1A14UL)))
#define bM4_TMR41_SCSRVH_EVTMS                    (*((volatile unsigned int*)(0x422E1A20UL)))
#define bM4_TMR41_SCSRVH_EVTDS                    (*((volatile unsigned int*)(0x422E1A24UL)))
#define bM4_TMR41_SCSRVH_DEN                      (*((volatile unsigned int*)(0x422E1A30UL)))
#define bM4_TMR41_SCSRVH_PEN                      (*((volatile unsigned int*)(0x422E1A34UL)))
#define bM4_TMR41_SCSRVH_UEN                      (*((volatile unsigned int*)(0x422E1A38UL)))
#define bM4_TMR41_SCSRVH_ZEN                      (*((volatile unsigned int*)(0x422E1A3CUL)))
#define bM4_TMR41_SCMRVH_AMC0                     (*((volatile unsigned int*)(0x422E1A40UL)))
#define bM4_TMR41_SCMRVH_AMC1                     (*((volatile unsigned int*)(0x422E1A44UL)))
#define bM4_TMR41_SCMRVH_AMC2                     (*((volatile unsigned int*)(0x422E1A48UL)))
#define bM4_TMR41_SCMRVH_AMC3                     (*((volatile unsigned int*)(0x422E1A4CUL)))
#define bM4_TMR41_SCMRVH_MZCE                     (*((volatile unsigned int*)(0x422E1A58UL)))
#define bM4_TMR41_SCMRVH_MPCE                     (*((volatile unsigned int*)(0x422E1A5CUL)))
#define bM4_TMR41_SCSRVL_BUFEN0                   (*((volatile unsigned int*)(0x422E1A80UL)))
#define bM4_TMR41_SCSRVL_BUFEN1                   (*((volatile unsigned int*)(0x422E1A84UL)))
#define bM4_TMR41_SCSRVL_EVTOS0                   (*((volatile unsigned int*)(0x422E1A88UL)))
#define bM4_TMR41_SCSRVL_EVTOS1                   (*((volatile unsigned int*)(0x422E1A8CUL)))
#define bM4_TMR41_SCSRVL_EVTOS2                   (*((volatile unsigned int*)(0x422E1A90UL)))
#define bM4_TMR41_SCSRVL_LMC                      (*((volatile unsigned int*)(0x422E1A94UL)))
#define bM4_TMR41_SCSRVL_EVTMS                    (*((volatile unsigned int*)(0x422E1AA0UL)))
#define bM4_TMR41_SCSRVL_EVTDS                    (*((volatile unsigned int*)(0x422E1AA4UL)))
#define bM4_TMR41_SCSRVL_DEN                      (*((volatile unsigned int*)(0x422E1AB0UL)))
#define bM4_TMR41_SCSRVL_PEN                      (*((volatile unsigned int*)(0x422E1AB4UL)))
#define bM4_TMR41_SCSRVL_UEN                      (*((volatile unsigned int*)(0x422E1AB8UL)))
#define bM4_TMR41_SCSRVL_ZEN                      (*((volatile unsigned int*)(0x422E1ABCUL)))
#define bM4_TMR41_SCMRVL_AMC0                     (*((volatile unsigned int*)(0x422E1AC0UL)))
#define bM4_TMR41_SCMRVL_AMC1                     (*((volatile unsigned int*)(0x422E1AC4UL)))
#define bM4_TMR41_SCMRVL_AMC2                     (*((volatile unsigned int*)(0x422E1AC8UL)))
#define bM4_TMR41_SCMRVL_AMC3                     (*((volatile unsigned int*)(0x422E1ACCUL)))
#define bM4_TMR41_SCMRVL_MZCE                     (*((volatile unsigned int*)(0x422E1AD8UL)))
#define bM4_TMR41_SCMRVL_MPCE                     (*((volatile unsigned int*)(0x422E1ADCUL)))
#define bM4_TMR41_SCSRWH_BUFEN0                   (*((volatile unsigned int*)(0x422E1B00UL)))
#define bM4_TMR41_SCSRWH_BUFEN1                   (*((volatile unsigned int*)(0x422E1B04UL)))
#define bM4_TMR41_SCSRWH_EVTOS0                   (*((volatile unsigned int*)(0x422E1B08UL)))
#define bM4_TMR41_SCSRWH_EVTOS1                   (*((volatile unsigned int*)(0x422E1B0CUL)))
#define bM4_TMR41_SCSRWH_EVTOS2                   (*((volatile unsigned int*)(0x422E1B10UL)))
#define bM4_TMR41_SCSRWH_LMC                      (*((volatile unsigned int*)(0x422E1B14UL)))
#define bM4_TMR41_SCSRWH_EVTMS                    (*((volatile unsigned int*)(0x422E1B20UL)))
#define bM4_TMR41_SCSRWH_EVTDS                    (*((volatile unsigned int*)(0x422E1B24UL)))
#define bM4_TMR41_SCSRWH_DEN                      (*((volatile unsigned int*)(0x422E1B30UL)))
#define bM4_TMR41_SCSRWH_PEN                      (*((volatile unsigned int*)(0x422E1B34UL)))
#define bM4_TMR41_SCSRWH_UEN                      (*((volatile unsigned int*)(0x422E1B38UL)))
#define bM4_TMR41_SCSRWH_ZEN                      (*((volatile unsigned int*)(0x422E1B3CUL)))
#define bM4_TMR41_SCMRWH_AMC0                     (*((volatile unsigned int*)(0x422E1B40UL)))
#define bM4_TMR41_SCMRWH_AMC1                     (*((volatile unsigned int*)(0x422E1B44UL)))
#define bM4_TMR41_SCMRWH_AMC2                     (*((volatile unsigned int*)(0x422E1B48UL)))
#define bM4_TMR41_SCMRWH_AMC3                     (*((volatile unsigned int*)(0x422E1B4CUL)))
#define bM4_TMR41_SCMRWH_MZCE                     (*((volatile unsigned int*)(0x422E1B58UL)))
#define bM4_TMR41_SCMRWH_MPCE                     (*((volatile unsigned int*)(0x422E1B5CUL)))
#define bM4_TMR41_SCSRWL_BUFEN0                   (*((volatile unsigned int*)(0x422E1B80UL)))
#define bM4_TMR41_SCSRWL_BUFEN1                   (*((volatile unsigned int*)(0x422E1B84UL)))
#define bM4_TMR41_SCSRWL_EVTOS0                   (*((volatile unsigned int*)(0x422E1B88UL)))
#define bM4_TMR41_SCSRWL_EVTOS1                   (*((volatile unsigned int*)(0x422E1B8CUL)))
#define bM4_TMR41_SCSRWL_EVTOS2                   (*((volatile unsigned int*)(0x422E1B90UL)))
#define bM4_TMR41_SCSRWL_LMC                      (*((volatile unsigned int*)(0x422E1B94UL)))
#define bM4_TMR41_SCSRWL_EVTMS                    (*((volatile unsigned int*)(0x422E1BA0UL)))
#define bM4_TMR41_SCSRWL_EVTDS                    (*((volatile unsigned int*)(0x422E1BA4UL)))
#define bM4_TMR41_SCSRWL_DEN                      (*((volatile unsigned int*)(0x422E1BB0UL)))
#define bM4_TMR41_SCSRWL_PEN                      (*((volatile unsigned int*)(0x422E1BB4UL)))
#define bM4_TMR41_SCSRWL_UEN                      (*((volatile unsigned int*)(0x422E1BB8UL)))
#define bM4_TMR41_SCSRWL_ZEN                      (*((volatile unsigned int*)(0x422E1BBCUL)))
#define bM4_TMR41_SCMRWL_AMC0                     (*((volatile unsigned int*)(0x422E1BC0UL)))
#define bM4_TMR41_SCMRWL_AMC1                     (*((volatile unsigned int*)(0x422E1BC4UL)))
#define bM4_TMR41_SCMRWL_AMC2                     (*((volatile unsigned int*)(0x422E1BC8UL)))
#define bM4_TMR41_SCMRWL_AMC3                     (*((volatile unsigned int*)(0x422E1BCCUL)))
#define bM4_TMR41_SCMRWL_MZCE                     (*((volatile unsigned int*)(0x422E1BD8UL)))
#define bM4_TMR41_SCMRWL_MPCE                     (*((volatile unsigned int*)(0x422E1BDCUL)))
#define bM4_TMR41_ECSR_HOLD                       (*((volatile unsigned int*)(0x422E1E1CUL)))
#define bM4_TMR42_OCSRU_OCEH                      (*((volatile unsigned int*)(0x42490300UL)))
#define bM4_TMR42_OCSRU_OCEL                      (*((volatile unsigned int*)(0x42490304UL)))
#define bM4_TMR42_OCSRU_OCPH                      (*((volatile unsigned int*)(0x42490308UL)))
#define bM4_TMR42_OCSRU_OCPL                      (*((volatile unsigned int*)(0x4249030CUL)))
#define bM4_TMR42_OCSRU_OCIEH                     (*((volatile unsigned int*)(0x42490310UL)))
#define bM4_TMR42_OCSRU_OCIEL                     (*((volatile unsigned int*)(0x42490314UL)))
#define bM4_TMR42_OCSRU_OCFH                      (*((volatile unsigned int*)(0x42490318UL)))
#define bM4_TMR42_OCSRU_OCFL                      (*((volatile unsigned int*)(0x4249031CUL)))
#define bM4_TMR42_OCERU_CHBUFEN0                  (*((volatile unsigned int*)(0x42490340UL)))
#define bM4_TMR42_OCERU_CHBUFEN1                  (*((volatile unsigned int*)(0x42490344UL)))
#define bM4_TMR42_OCERU_CLBUFEN0                  (*((volatile unsigned int*)(0x42490348UL)))
#define bM4_TMR42_OCERU_CLBUFEN1                  (*((volatile unsigned int*)(0x4249034CUL)))
#define bM4_TMR42_OCERU_MHBUFEN0                  (*((volatile unsigned int*)(0x42490350UL)))
#define bM4_TMR42_OCERU_MHBUFEN1                  (*((volatile unsigned int*)(0x42490354UL)))
#define bM4_TMR42_OCERU_MLBUFEN0                  (*((volatile unsigned int*)(0x42490358UL)))
#define bM4_TMR42_OCERU_MLBUFEN1                  (*((volatile unsigned int*)(0x4249035CUL)))
#define bM4_TMR42_OCERU_LMCH                      (*((volatile unsigned int*)(0x42490360UL)))
#define bM4_TMR42_OCERU_LMCL                      (*((volatile unsigned int*)(0x42490364UL)))
#define bM4_TMR42_OCERU_LMMH                      (*((volatile unsigned int*)(0x42490368UL)))
#define bM4_TMR42_OCERU_LMML                      (*((volatile unsigned int*)(0x4249036CUL)))
#define bM4_TMR42_OCERU_MCECH                     (*((volatile unsigned int*)(0x42490370UL)))
#define bM4_TMR42_OCERU_MCECL                     (*((volatile unsigned int*)(0x42490374UL)))
#define bM4_TMR42_OCSRV_OCEH                      (*((volatile unsigned int*)(0x42490380UL)))
#define bM4_TMR42_OCSRV_OCEL                      (*((volatile unsigned int*)(0x42490384UL)))
#define bM4_TMR42_OCSRV_OCPH                      (*((volatile unsigned int*)(0x42490388UL)))
#define bM4_TMR42_OCSRV_OCPL                      (*((volatile unsigned int*)(0x4249038CUL)))
#define bM4_TMR42_OCSRV_OCIEH                     (*((volatile unsigned int*)(0x42490390UL)))
#define bM4_TMR42_OCSRV_OCIEL                     (*((volatile unsigned int*)(0x42490394UL)))
#define bM4_TMR42_OCSRV_OCFH                      (*((volatile unsigned int*)(0x42490398UL)))
#define bM4_TMR42_OCSRV_OCFL                      (*((volatile unsigned int*)(0x4249039CUL)))
#define bM4_TMR42_OCERV_CHBUFEN0                  (*((volatile unsigned int*)(0x424903C0UL)))
#define bM4_TMR42_OCERV_CHBUFEN1                  (*((volatile unsigned int*)(0x424903C4UL)))
#define bM4_TMR42_OCERV_CLBUFEN0                  (*((volatile unsigned int*)(0x424903C8UL)))
#define bM4_TMR42_OCERV_CLBUFEN1                  (*((volatile unsigned int*)(0x424903CCUL)))
#define bM4_TMR42_OCERV_MHBUFEN0                  (*((volatile unsigned int*)(0x424903D0UL)))
#define bM4_TMR42_OCERV_MHBUFEN1                  (*((volatile unsigned int*)(0x424903D4UL)))
#define bM4_TMR42_OCERV_MLBUFEN0                  (*((volatile unsigned int*)(0x424903D8UL)))
#define bM4_TMR42_OCERV_MLBUFEN1                  (*((volatile unsigned int*)(0x424903DCUL)))
#define bM4_TMR42_OCERV_LMCH                      (*((volatile unsigned int*)(0x424903E0UL)))
#define bM4_TMR42_OCERV_LMCL                      (*((volatile unsigned int*)(0x424903E4UL)))
#define bM4_TMR42_OCERV_LMMH                      (*((volatile unsigned int*)(0x424903E8UL)))
#define bM4_TMR42_OCERV_LMML                      (*((volatile unsigned int*)(0x424903ECUL)))
#define bM4_TMR42_OCERV_MCECH                     (*((volatile unsigned int*)(0x424903F0UL)))
#define bM4_TMR42_OCERV_MCECL                     (*((volatile unsigned int*)(0x424903F4UL)))
#define bM4_TMR42_OCSRW_OCEH                      (*((volatile unsigned int*)(0x42490400UL)))
#define bM4_TMR42_OCSRW_OCEL                      (*((volatile unsigned int*)(0x42490404UL)))
#define bM4_TMR42_OCSRW_OCPH                      (*((volatile unsigned int*)(0x42490408UL)))
#define bM4_TMR42_OCSRW_OCPL                      (*((volatile unsigned int*)(0x4249040CUL)))
#define bM4_TMR42_OCSRW_OCIEH                     (*((volatile unsigned int*)(0x42490410UL)))
#define bM4_TMR42_OCSRW_OCIEL                     (*((volatile unsigned int*)(0x42490414UL)))
#define bM4_TMR42_OCSRW_OCFH                      (*((volatile unsigned int*)(0x42490418UL)))
#define bM4_TMR42_OCSRW_OCFL                      (*((volatile unsigned int*)(0x4249041CUL)))
#define bM4_TMR42_OCERW_CHBUFEN0                  (*((volatile unsigned int*)(0x42490440UL)))
#define bM4_TMR42_OCERW_CHBUFEN1                  (*((volatile unsigned int*)(0x42490444UL)))
#define bM4_TMR42_OCERW_CLBUFEN0                  (*((volatile unsigned int*)(0x42490448UL)))
#define bM4_TMR42_OCERW_CLBUFEN1                  (*((volatile unsigned int*)(0x4249044CUL)))
#define bM4_TMR42_OCERW_MHBUFEN0                  (*((volatile unsigned int*)(0x42490450UL)))
#define bM4_TMR42_OCERW_MHBUFEN1                  (*((volatile unsigned int*)(0x42490454UL)))
#define bM4_TMR42_OCERW_MLBUFEN0                  (*((volatile unsigned int*)(0x42490458UL)))
#define bM4_TMR42_OCERW_MLBUFEN1                  (*((volatile unsigned int*)(0x4249045CUL)))
#define bM4_TMR42_OCERW_LMCH                      (*((volatile unsigned int*)(0x42490460UL)))
#define bM4_TMR42_OCERW_LMCL                      (*((volatile unsigned int*)(0x42490464UL)))
#define bM4_TMR42_OCERW_LMMH                      (*((volatile unsigned int*)(0x42490468UL)))
#define bM4_TMR42_OCERW_LMML                      (*((volatile unsigned int*)(0x4249046CUL)))
#define bM4_TMR42_OCERW_MCECH                     (*((volatile unsigned int*)(0x42490470UL)))
#define bM4_TMR42_OCERW_MCECL                     (*((volatile unsigned int*)(0x42490474UL)))
#define bM4_TMR42_OCMRHUH_OCFDCH                  (*((volatile unsigned int*)(0x42490480UL)))
#define bM4_TMR42_OCMRHUH_OCFPKH                  (*((volatile unsigned int*)(0x42490484UL)))
#define bM4_TMR42_OCMRHUH_OCFUCH                  (*((volatile unsigned int*)(0x42490488UL)))
#define bM4_TMR42_OCMRHUH_OCFZRH                  (*((volatile unsigned int*)(0x4249048CUL)))
#define bM4_TMR42_OCMRHUH_OPDCH0                  (*((volatile unsigned int*)(0x42490490UL)))
#define bM4_TMR42_OCMRHUH_OPDCH1                  (*((volatile unsigned int*)(0x42490494UL)))
#define bM4_TMR42_OCMRHUH_OPPKH0                  (*((volatile unsigned int*)(0x42490498UL)))
#define bM4_TMR42_OCMRHUH_OPPKH1                  (*((volatile unsigned int*)(0x4249049CUL)))
#define bM4_TMR42_OCMRHUH_OPUCH0                  (*((volatile unsigned int*)(0x424904A0UL)))
#define bM4_TMR42_OCMRHUH_OPUCH1                  (*((volatile unsigned int*)(0x424904A4UL)))
#define bM4_TMR42_OCMRHUH_OPZRH0                  (*((volatile unsigned int*)(0x424904A8UL)))
#define bM4_TMR42_OCMRHUH_OPZRH1                  (*((volatile unsigned int*)(0x424904ACUL)))
#define bM4_TMR42_OCMRHUH_OPNPKH0                 (*((volatile unsigned int*)(0x424904B0UL)))
#define bM4_TMR42_OCMRHUH_OPNPKH1                 (*((volatile unsigned int*)(0x424904B4UL)))
#define bM4_TMR42_OCMRHUH_OPNZRH0                 (*((volatile unsigned int*)(0x424904B8UL)))
#define bM4_TMR42_OCMRHUH_OPNZRH1                 (*((volatile unsigned int*)(0x424904BCUL)))
#define bM4_TMR42_OCMRLUL_OCFDCL                  (*((volatile unsigned int*)(0x42490500UL)))
#define bM4_TMR42_OCMRLUL_OCFPKL                  (*((volatile unsigned int*)(0x42490504UL)))
#define bM4_TMR42_OCMRLUL_OCFUCL                  (*((volatile unsigned int*)(0x42490508UL)))
#define bM4_TMR42_OCMRLUL_OCFZRL                  (*((volatile unsigned int*)(0x4249050CUL)))
#define bM4_TMR42_OCMRLUL_OPDCL0                  (*((volatile unsigned int*)(0x42490510UL)))
#define bM4_TMR42_OCMRLUL_OPDCL1                  (*((volatile unsigned int*)(0x42490514UL)))
#define bM4_TMR42_OCMRLUL_OPPKL0                  (*((volatile unsigned int*)(0x42490518UL)))
#define bM4_TMR42_OCMRLUL_OPPKL1                  (*((volatile unsigned int*)(0x4249051CUL)))
#define bM4_TMR42_OCMRLUL_OPUCL0                  (*((volatile unsigned int*)(0x42490520UL)))
#define bM4_TMR42_OCMRLUL_OPUCL1                  (*((volatile unsigned int*)(0x42490524UL)))
#define bM4_TMR42_OCMRLUL_OPZRL0                  (*((volatile unsigned int*)(0x42490528UL)))
#define bM4_TMR42_OCMRLUL_OPZRL1                  (*((volatile unsigned int*)(0x4249052CUL)))
#define bM4_TMR42_OCMRLUL_OPNPKL0                 (*((volatile unsigned int*)(0x42490530UL)))
#define bM4_TMR42_OCMRLUL_OPNPKL1                 (*((volatile unsigned int*)(0x42490534UL)))
#define bM4_TMR42_OCMRLUL_OPNZRL0                 (*((volatile unsigned int*)(0x42490538UL)))
