patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_TMR43_CCSR_IRQZEN                     (*((volatile unsigned int*)(0x42498934UL)))
#define bM4_TMR43_CCSR_IRQZF                      (*((volatile unsigned int*)(0x42498938UL)))
#define bM4_TMR43_CCSR_ECKEN                      (*((volatile unsigned int*)(0x4249893CUL)))
#define bM4_TMR43_CVPR_ZIM0                       (*((volatile unsigned int*)(0x42498940UL)))
#define bM4_TMR43_CVPR_ZIM1                       (*((volatile unsigned int*)(0x42498944UL)))
#define bM4_TMR43_CVPR_ZIM2                       (*((volatile unsigned int*)(0x42498948UL)))
#define bM4_TMR43_CVPR_ZIM3                       (*((volatile unsigned int*)(0x4249894CUL)))
#define bM4_TMR43_CVPR_PIM0                       (*((volatile unsigned int*)(0x42498950UL)))
#define bM4_TMR43_CVPR_PIM1                       (*((volatile unsigned int*)(0x42498954UL)))
#define bM4_TMR43_CVPR_PIM2                       (*((volatile unsigned int*)(0x42498958UL)))
#define bM4_TMR43_CVPR_PIM3                       (*((volatile unsigned int*)(0x4249895CUL)))
#define bM4_TMR43_CVPR_ZIC0                       (*((volatile unsigned int*)(0x42498960UL)))
#define bM4_TMR43_CVPR_ZIC1                       (*((volatile unsigned int*)(0x42498964UL)))
#define bM4_TMR43_CVPR_ZIC2                       (*((volatile unsigned int*)(0x42498968UL)))
#define bM4_TMR43_CVPR_ZIC3                       (*((volatile unsigned int*)(0x4249896CUL)))
#define bM4_TMR43_CVPR_PIC0                       (*((volatile unsigned int*)(0x42498970UL)))
#define bM4_TMR43_CVPR_PIC1                       (*((volatile unsigned int*)(0x42498974UL)))
#define bM4_TMR43_CVPR_PIC2                       (*((volatile unsigned int*)(0x42498978UL)))
#define bM4_TMR43_CVPR_PIC3                       (*((volatile unsigned int*)(0x4249897CUL)))
#define bM4_TMR43_POCRU_DIVCK0                    (*((volatile unsigned int*)(0x42499300UL)))
#define bM4_TMR43_POCRU_DIVCK1                    (*((volatile unsigned int*)(0x42499304UL)))
#define bM4_TMR43_POCRU_DIVCK2                    (*((volatile unsigned int*)(0x42499308UL)))
#define bM4_TMR43_POCRU_DIVCK3                    (*((volatile unsigned int*)(0x4249930CUL)))
#define bM4_TMR43_POCRU_PWMMD0                    (*((volatile unsigned int*)(0x42499310UL)))
#define bM4_TMR43_POCRU_PWMMD1                    (*((volatile unsigned int*)(0x42499314UL)))
#define bM4_TMR43_POCRU_LVLS0                     (*((volatile unsigned int*)(0x42499318UL)))
#define bM4_TMR43_POCRU_LVLS1                     (*((volatile unsigned int*)(0x4249931CUL)))
#define bM4_TMR43_POCRV_DIVCK0                    (*((volatile unsigned int*)(0x42499380UL)))
#define bM4_TMR43_POCRV_DIVCK1                    (*((volatile unsigned int*)(0x42499384UL)))
#define bM4_TMR43_POCRV_DIVCK2                    (*((volatile unsigned int*)(0x42499388UL)))
#define bM4_TMR43_POCRV_DIVCK3                    (*((volatile unsigned int*)(0x4249938CUL)))
#define bM4_TMR43_POCRV_PWMMD0                    (*((volatile unsigned int*)(0x42499390UL)))
#define bM4_TMR43_POCRV_PWMMD1                    (*((volatile unsigned int*)(0x42499394UL)))
#define bM4_TMR43_POCRV_LVLS0                     (*((volatile unsigned int*)(0x42499398UL)))
#define bM4_TMR43_POCRV_LVLS1                     (*((volatile unsigned int*)(0x4249939CUL)))
#define bM4_TMR43_POCRW_DIVCK0                    (*((volatile unsigned int*)(0x42499400UL)))
#define bM4_TMR43_POCRW_DIVCK1                    (*((volatile unsigned int*)(0x42499404UL)))
#define bM4_TMR43_POCRW_DIVCK2                    (*((volatile unsigned int*)(0x42499408UL)))
#define bM4_TMR43_POCRW_DIVCK3                    (*((volatile unsigned int*)(0x4249940CUL)))
#define bM4_TMR43_POCRW_PWMMD0                    (*((volatile unsigned int*)(0x42499410UL)))
#define bM4_TMR43_POCRW_PWMMD1                    (*((volatile unsigned int*)(0x42499414UL)))
#define bM4_TMR43_POCRW_LVLS0                     (*((volatile unsigned int*)(0x42499418UL)))
#define bM4_TMR43_POCRW_LVLS1                     (*((volatile unsigned int*)(0x4249941CUL)))
#define bM4_TMR43_RCSR_RTIDU                      (*((volatile unsigned int*)(0x42499480UL)))
#define bM4_TMR43_RCSR_RTIDV                      (*((volatile unsigned int*)(0x42499484UL)))
#define bM4_TMR43_RCSR_RTIDW                      (*((volatile unsigned int*)(0x42499488UL)))
#define bM4_TMR43_RCSR_RTIFU                      (*((volatile unsigned int*)(0x42499490UL)))
#define bM4_TMR43_RCSR_RTICU                      (*((volatile unsigned int*)(0x42499494UL)))
#define bM4_TMR43_RCSR_RTEU                       (*((volatile unsigned int*)(0x42499498UL)))
#define bM4_TMR43_RCSR_RTSU                       (*((volatile unsigned int*)(0x4249949CUL)))
#define bM4_TMR43_RCSR_RTIFV                      (*((volatile unsigned int*)(0x424994A0UL)))
#define bM4_TMR43_RCSR_RTICV                      (*((volatile unsigned int*)(0x424994A4UL)))
#define bM4_TMR43_RCSR_RTEV                       (*((volatile unsigned int*)(0x424994A8UL)))
#define bM4_TMR43_RCSR_RTSV                       (*((volatile unsigned int*)(0x424994ACUL)))
#define bM4_TMR43_RCSR_RTIFW                      (*((volatile unsigned int*)(0x424994B0UL)))
#define bM4_TMR43_RCSR_RTICW                      (*((volatile unsigned int*)(0x424994B4UL)))
#define bM4_TMR43_RCSR_RTEW                       (*((volatile unsigned int*)(0x424994B8UL)))
#define bM4_TMR43_RCSR_RTSW                       (*((volatile unsigned int*)(0x424994BCUL)))
#define bM4_TMR43_SCSRUH_BUFEN0                   (*((volatile unsigned int*)(0x42499900UL)))
#define bM4_TMR43_SCSRUH_BUFEN1                   (*((volatile unsigned int*)(0x42499904UL)))
#define bM4_TMR43_SCSRUH_EVTOS0                   (*((volatile unsigned int*)(0x42499908UL)))
#define bM4_TMR43_SCSRUH_EVTOS1                   (*((volatile unsigned int*)(0x4249990CUL)))
#define bM4_TMR43_SCSRUH_EVTOS2                   (*((volatile unsigned int*)(0x42499910UL)))
#define bM4_TMR43_SCSRUH_LMC                      (*((volatile unsigned int*)(0x42499914UL)))
#define bM4_TMR43_SCSRUH_EVTMS                    (*((volatile unsigned int*)(0x42499920UL)))
#define bM4_TMR43_SCSRUH_EVTDS                    (*((volatile unsigned int*)(0x42499924UL)))
#define bM4_TMR43_SCSRUH_DEN                      (*((volatile unsigned int*)(0x42499930UL)))
#define bM4_TMR43_SCSRUH_PEN                      (*((volatile unsigned int*)(0x42499934UL)))
#define bM4_TMR43_SCSRUH_UEN                      (*((volatile unsigned int*)(0x42499938UL)))
#define bM4_TMR43_SCSRUH_ZEN                      (*((volatile unsigned int*)(0x4249993CUL)))
#define bM4_TMR43_SCMRUH_AMC0                     (*((volatile unsigned int*)(0x42499940UL)))
#define bM4_TMR43_SCMRUH_AMC1                     (*((volatile unsigned int*)(0x42499944UL)))
#define bM4_TMR43_SCMRUH_AMC2                     (*((volatile unsigned int*)(0x42499948UL)))
#define bM4_TMR43_SCMRUH_AMC3                     (*((volatile unsigned int*)(0x4249994CUL)))
#define bM4_TMR43_SCMRUH_MZCE                     (*((volatile unsigned int*)(0x42499958UL)))
#define bM4_TMR43_SCMRUH_MPCE                     (*((volatile unsigned int*)(0x4249995CUL)))
#define bM4_TMR43_SCSRUL_BUFEN0                   (*((volatile unsigned int*)(0x42499980UL)))
#define bM4_TMR43_SCSRUL_BUFEN1                   (*((volatile unsigned int*)(0x42499984UL)))
#define bM4_TMR43_SCSRUL_EVTOS0                   (*((volatile unsigned int*)(0x42499988UL)))
#define bM4_TMR43_SCSRUL_EVTOS1                   (*((volatile unsigned int*)(0x4249998CUL)))
#define bM4_TMR43_SCSRUL_EVTOS2                   (*((volatile unsigned int*)(0x42499990UL)))
#define bM4_TMR43_SCSRUL_LMC                      (*((volatile unsigned int*)(0x42499994UL)))
#define bM4_TMR43_SCSRUL_EVTMS                    (*((volatile unsigned int*)(0x424999A0UL)))
#define bM4_TMR43_SCSRUL_EVTDS                    (*((volatile unsigned int*)(0x424999A4UL)))
#define bM4_TMR43_SCSRUL_DEN                      (*((volatile unsigned int*)(0x424999B0UL)))
#define bM4_TMR43_SCSRUL_PEN                      (*((volatile unsigned int*)(0x424999B4UL)))
#define bM4_TMR43_SCSRUL_UEN                      (*((volatile unsigned int*)(0x424999B8UL)))
#define bM4_TMR43_SCSRUL_ZEN                      (*((volatile unsigned int*)(0x424999BCUL)))
#define bM4_TMR43_SCMRUL_AMC0                     (*((volatile unsigned int*)(0x424999C0UL)))
#define bM4_TMR43_SCMRUL_AMC1                     (*((volatile unsigned int*)(0x424999C4UL)))
#define bM4_TMR43_SCMRUL_AMC2                     (*((volatile unsigned int*)(0x424999C8UL)))
#define bM4_TMR43_SCMRUL_AMC3                     (*((volatile unsigned int*)(0x424999CCUL)))
#define bM4_TMR43_SCMRUL_MZCE                     (*((volatile unsigned int*)(0x424999D8UL)))
#define bM4_TMR43_SCMRUL_MPCE                     (*((volatile unsigned int*)(0x424999DCUL)))
#define bM4_TMR43_SCSRVH_BUFEN0                   (*((volatile unsigned int*)(0x42499A00UL)))
#define bM4_TMR43_SCSRVH_BUFEN1                   (*((volatile unsigned int*)(0x42499A04UL)))
#define bM4_TMR43_SCSRVH_EVTOS0                   (*((volatile unsigned int*)(0x42499A08UL)))
#define bM4_TMR43_SCSRVH_EVTOS1                   (*((volatile unsigned int*)(0x42499A0CUL)))
#define bM4_TMR43_SCSRVH_EVTOS2                   (*((volatile unsigned int*)(0x42499A10UL)))
#define bM4_TMR43_SCSRVH_LMC                      (*((volatile unsigned int*)(0x42499A14UL)))
#define bM4_TMR43_SCSRVH_EVTMS                    (*((volatile unsigned int*)(0x42499A20UL)))
#define bM4_TMR43_SCSRVH_EVTDS                    (*((volatile unsigned int*)(0x42499A24UL)))
#define bM4_TMR43_SCSRVH_DEN                      (*((volatile unsigned int*)(0x42499A30UL)))
#define bM4_TMR43_SCSRVH_PEN                      (*((volatile unsigned int*)(0x42499A34UL)))
#define bM4_TMR43_SCSRVH_UEN                      (*((volatile unsigned int*)(0x42499A38UL)))
#define bM4_TMR43_SCSRVH_ZEN                      (*((volatile unsigned int*)(0x42499A3CUL)))
#define bM4_TMR43_SCMRVH_AMC0                     (*((volatile unsigned int*)(0x42499A40UL)))
#define bM4_TMR43_SCMRVH_AMC1                     (*((volatile unsigned int*)(0x42499A44UL)))
#define bM4_TMR43_SCMRVH_AMC2                     (*((volatile unsigned int*)(0x42499A48UL)))
#define bM4_TMR43_SCMRVH_AMC3                     (*((volatile unsigned int*)(0x42499A4CUL)))
#define bM4_TMR43_SCMRVH_MZCE                     (*((volatile unsigned int*)(0x42499A58UL)))
#define bM4_TMR43_SCMRVH_MPCE                     (*((volatile unsigned int*)(0x42499A5CUL)))
#define bM4_TMR43_SCSRVL_BUFEN0                   (*((volatile unsigned int*)(0x42499A80UL)))
#define bM4_TMR43_SCSRVL_BUFEN1                   (*((volatile unsigned int*)(0x42499A84UL)))
#define bM4_TMR43_SCSRVL_EVTOS0                   (*((volatile unsigned int*)(0x42499A88UL)))
#define bM4_TMR43_SCSRVL_EVTOS1                   (*((volatile unsigned int*)(0x42499A8CUL)))
#define bM4_TMR43_SCSRVL_EVTOS2                   (*((volatile unsigned int*)(0x42499A90UL)))
#define bM4_TMR43_SCSRVL_LMC                      (*((volatile unsigned int*)(0x42499A94UL)))
#define bM4_TMR43_SCSRVL_EVTMS                    (*((volatile unsigned int*)(0x42499AA0UL)))
#define bM4_TMR43_SCSRVL_EVTDS                    (*((volatile unsigned int*)(0x42499AA4UL)))
#define bM4_TMR43_SCSRVL_DEN                      (*((volatile unsigned int*)(0x42499AB0UL)))
#define bM4_TMR43_SCSRVL_PEN                      (*((volatile unsigned int*)(0x42499AB4UL)))
#define bM4_TMR43_SCSRVL_UEN                      (*((volatile unsigned int*)(0x42499AB8UL)))
#define bM4_TMR43_SCSRVL_ZEN                      (*((volatile unsigned int*)(0x42499ABCUL)))
#define bM4_TMR43_SCMRVL_AMC0                     (*((volatile unsigned int*)(0x42499AC0UL)))
#define bM4_TMR43_SCMRVL_AMC1                     (*((volatile unsigned int*)(0x42499AC4UL)))
#define bM4_TMR43_SCMRVL_AMC2                     (*((volatile unsigned int*)(0x42499AC8UL)))
#define bM4_TMR43_SCMRVL_AMC3                     (*((volatile unsigned int*)(0x42499ACCUL)))
#define bM4_TMR43_SCMRVL_MZCE                     (*((volatile unsigned int*)(0x42499AD8UL)))
#define bM4_TMR43_SCMRVL_MPCE                     (*((volatile unsigned int*)(0x42499ADCUL)))
#define bM4_TMR43_SCSRWH_BUFEN0                   (*((volatile unsigned int*)(0x42499B00UL)))
#define bM4_TMR43_SCSRWH_BUFEN1                   (*((volatile unsigned int*)(0x42499B04UL)))
#define bM4_TMR43_SCSRWH_EVTOS0                   (*((volatile unsigned int*)(0x42499B08UL)))
#define bM4_TMR43_SCSRWH_EVTOS1                   (*((volatile unsigned int*)(0x42499B0CUL)))
#define bM4_TMR43_SCSRWH_EVTOS2                   (*((volatile unsigned int*)(0x42499B10UL)))
#define bM4_TMR43_SCSRWH_LMC                      (*((volatile unsigned int*)(0x42499B14UL)))
#define bM4_TMR43_SCSRWH_EVTMS                    (*((volatile unsigned int*)(0x42499B20UL)))
#define bM4_TMR43_SCSRWH_EVTDS                    (*((volatile unsigned int*)(0x42499B24UL)))
#define bM4_TMR43_SCSRWH_DEN                      (*((volatile unsigned int*)(0x42499B30UL)))
#define bM4_TMR43_SCSRWH_PEN                      (*((volatile unsigned int*)(0x42499B34UL)))
#define bM4_TMR43_SCSRWH_UEN                      (*((volatile unsigned int*)(0x42499B38UL)))
#define bM4_TMR43_SCSRWH_ZEN                      (*((volatile unsigned int*)(0x42499B3CUL)))
#define bM4_TMR43_SCMRWH_AMC0                     (*((volatile unsigned int*)(0x42499B40UL)))
#define bM4_TMR43_SCMRWH_AMC1                     (*((volatile unsigned int*)(0x42499B44UL)))
#define bM4_TMR43_SCMRWH_AMC2                     (*((volatile unsigned int*)(0x42499B48UL)))
#define bM4_TMR43_SCMRWH_AMC3                     (*((volatile unsigned int*)(0x42499B4CUL)))
#define bM4_TMR43_SCMRWH_MZCE                     (*((volatile unsigned int*)(0x42499B58UL)))
#define bM4_TMR43_SCMRWH_MPCE                     (*((volatile unsigned int*)(0x42499B5CUL)))
#define bM4_TMR43_SCSRWL_BUFEN0                   (*((volatile unsigned int*)(0x42499B80UL)))
#define bM4_TMR43_SCSRWL_BUFEN1                   (*((volatile unsigned int*)(0x42499B84UL)))
#define bM4_TMR43_SCSRWL_EVTOS0                   (*((volatile unsigned int*)(0x42499B88UL)))
#define bM4_TMR43_SCSRWL_EVTOS1                   (*((volatile unsigned int*)(0x42499B8CUL)))
#define bM4_TMR43_SCSRWL_EVTOS2                   (*((volatile unsigned int*)(0x42499B90UL)))
#define bM4_TMR43_SCSRWL_LMC                      (*((volatile unsigned int*)(0x42499B94UL)))
#define bM4_TMR43_SCSRWL_EVTMS                    (*((volatile unsigned int*)(0x42499BA0UL)))
#define bM4_TMR43_SCSRWL_EVTDS                    (*((volatile unsigned int*)(0x42499BA4UL)))
#define bM4_TMR43_SCSRWL_DEN                      (*((volatile unsigned int*)(0x42499BB0UL)))
#define bM4_TMR43_SCSRWL_PEN                      (*((volatile unsigned int*)(0x42499BB4UL)))
#define bM4_TMR43_SCSRWL_UEN                      (*((volatile unsigned int*)(0x42499BB8UL)))
#define bM4_TMR43_SCSRWL_ZEN                      (*((volatile unsigned int*)(0x42499BBCUL)))
#define bM4_TMR43_SCMRWL_AMC0                     (*((volatile unsigned int*)(0x42499BC0UL)))
#define bM4_TMR43_SCMRWL_AMC1                     (*((volatile unsigned int*)(0x42499BC4UL)))
#define bM4_TMR43_SCMRWL_AMC2                     (*((volatile unsigned int*)(0x42499BC8UL)))
#define bM4_TMR43_SCMRWL_AMC3                     (*((volatile unsigned int*)(0x42499BCCUL)))
#define bM4_TMR43_SCMRWL_MZCE                     (*((volatile unsigned int*)(0x42499BD8UL)))
#define bM4_TMR43_SCMRWL_MPCE                     (*((volatile unsigned int*)(0x42499BDCUL)))
#define bM4_TMR43_ECSR_HOLD                       (*((volatile unsigned int*)(0x42499E1CUL)))
#define bM4_TMR4_CR_ECER1_EMBVAL0                 (*((volatile unsigned int*)(0x42AA8100UL)))
#define bM4_TMR4_CR_ECER1_EMBVAL1                 (*((volatile unsigned int*)(0x42AA8104UL)))
#define bM4_TMR4_CR_ECER2_EMBVAL0                 (*((volatile unsigned int*)(0x42AA8180UL)))
#define bM4_TMR4_CR_ECER2_EMBVAL1                 (*((volatile unsigned int*)(0x42AA8184UL)))
#define bM4_TMR4_CR_ECER3_EMBVAL0                 (*((volatile unsigned int*)(0x42AA8200UL)))
#define bM4_TMR4_CR_ECER3_EMBVAL1                 (*((volatile unsigned int*)(0x42AA8204UL)))
#define bM4_TMR61_CNTER_CNT0                      (*((volatile unsigned int*)(0x42300000UL)))
#define bM4_TMR61_CNTER_CNT1                      (*((volatile unsigned int*)(0x42300004UL)))
#define bM4_TMR61_CNTER_CNT2                      (*((volatile unsigned int*)(0x42300008UL)))
#define bM4_TMR61_CNTER_CNT3                      (*((volatile unsigned int*)(0x4230000CUL)))
#define bM4_TMR61_CNTER_CNT4                      (*((volatile unsigned int*)(0x42300010UL)))
#define bM4_TMR61_CNTER_CNT5                      (*((volatile unsigned int*)(0x42300014UL)))
#define bM4_TMR61_CNTER_CNT6                      (*((volatile unsigned int*)(0x42300018UL)))
#define bM4_TMR61_CNTER_CNT7                      (*((volatile unsigned int*)(0x4230001CUL)))
#define bM4_TMR61_CNTER_CNT8                      (*((volatile unsigned int*)(0x42300020UL)))
#define bM4_TMR61_CNTER_CNT9                      (*((volatile unsigned int*)(0x42300024UL)))
#define bM4_TMR61_CNTER_CNT10                     (*((volatile unsigned int*)(0x42300028UL)))
#define bM4_TMR61_CNTER_CNT11                     (*((volatile unsigned int*)(0x4230002CUL)))
#define bM4_TMR61_CNTER_CNT12                     (*((volatile unsigned int*)(0x42300030UL)))
#define bM4_TMR61_CNTER_CNT13                     (*((volatile unsigned int*)(0x42300034UL)))
#define bM4_TMR61_CNTER_CNT14                     (*((volatile unsigned int*)(0x42300038UL)))
#define bM4_TMR61_CNTER_CNT15                     (*((volatile unsigned int*)(0x4230003CUL)))
#define bM4_TMR61_PERAR_PERA0                     (*((volatile unsigned int*)(0x42300080UL)))
#define bM4_TMR61_PERAR_PERA1                     (*((volatile unsigned int*)(0x42300084UL)))
#define bM4_TMR61_PERAR_PERA2                     (*((volatile unsigned int*)(0x42300088UL)))
#define bM4_TMR61_PERAR_PERA3                     (*((volatile unsigned int*)(0x4230008CUL)))
#define bM4_TMR61_PERAR_PERA4                     (*((volatile unsigned int*)(0x42300090UL)))
#define bM4_TMR61_PERAR_PERA5                     (*((volatile unsigned int*)(0x42300094UL)))
#define bM4_TMR61_PERAR_PERA6                     (*((volatile unsigned int*)(0x42300098UL)))
#define bM4_TMR61_PERAR_PERA7                     (*((volatile unsigned int*)(0x4230009CUL)))
#define bM4_TMR61_PERAR_PERA8                     (*((volatile unsigned int*)(0x423000A0UL)))
#define bM4_TMR61_PERAR_PERA9                     (*((volatile unsigned int*)(0x423000A4UL)))
#define bM4_TMR61_PERAR_PERA10                    (*((volatile unsigned int*)(0x423000A8UL)))
#define bM4_TMR61_PERAR_PERA11                    (*((volatile unsigned int*)(0x423000ACUL)))
#define bM4_TMR61_PERAR_PERA12                    (*((volatile unsigned int*)(0x423000B0UL)))
#define bM4_TMR61_PERAR_PERA13                    (*((volatile unsigned int*)(0x423000B4UL)))
#define bM4_TMR61_PERAR_PERA14                    (*((volatile unsigned int*)(0x423000B8UL)))
#define bM4_TMR61_PERAR_PERA15                    (*((volatile unsigned int*)(0x423000BCUL)))
#define bM4_TMR61_PERBR_PERB0                     (*((volatile unsigned int*)(0x42300100UL)))
#define bM4_TMR61_PERBR_PERB1                     (*((volatile unsigned int*)(0x42300104UL)))
#define bM4_TMR61_PERBR_PERB2                     (*((volatile unsigned int*)(0x42300108UL)))
#define bM4_TMR61_PERBR_PERB3                     (*((volatile unsigned int*)(0x4230010CUL)))
#define bM4_TMR61_PERBR_PERB4                     (*((volatile unsigned int*)(0x42300110UL)))
#define bM4_TMR61_PERBR_PERB5                     (*((volatile unsigned int*)(0x42300114UL)))
#define bM4_TMR61_PERBR_PERB6                     (*((volatile unsigned int*)(0x42300118UL)))
#define bM4_TMR61_PERBR_PERB7                     (*((volatile unsigned int*)(0x4230011CUL)))
#define bM4_TMR61_PERBR_PERB8                     (*((volatile unsigned int*)(0x42300120UL)))
#define bM4_TMR61_PERBR_PERB9                     (*((volatile unsigned int*)(0x42300124UL)))
#define bM4_TMR61_PERBR_PERB10                    (*((volatile unsigned int*)(0x42300128UL)))
#define bM4_TMR61_PERBR_PERB11                    (*((volatile unsigned int*)(0x4230012CUL)))
#define bM4_TMR61_PERBR_PERB12                    (*((volatile unsigned int*)(0x42300130UL)))
#define bM4_TMR61_PERBR_PERB13                    (*((volatile unsigned int*)(0x42300134UL)))
#define bM4_TMR61_PERBR_PERB14                    (*((volatile unsigned int*)(0x42300138UL)))
#define bM4_TMR61_PERBR_PERB15                    (*((volatile unsigned int*)(0x4230013CUL)))
#define bM4_TMR61_PERCR_PERC0                     (*((volatile unsigned int*)(0x42300180UL)))
#define bM4_TMR61_PERCR_PERC1                     (*((volatile unsigned int*)(0x42300184UL)))
#define bM4_TMR61_PERCR_PERC2                     (*((volatile unsigned int*)(0x42300188UL)))
#define bM4_TMR61_PERCR_PERC3                     (*((volatile unsigned int*)(0x4230018CUL)))
#define bM4_TMR61_PERCR_PERC4                     (*((volatile unsigned int*)(0x42300190UL)))
#define bM4_TMR61_PERCR_PERC5                     (*((volatile unsigned int*)(0x42300194UL)))
#define bM4_TMR61_PERCR_PERC6                     (*((volatile unsigned int*)(0x42300198UL)))
#define bM4_TMR61_PERCR_PERC7                     (*((volatile unsigned int*)(0x4230019CUL)))
#define bM4_TMR61_PERCR_PERC8                     (*((volatile unsigned int*)(0x423001A0UL)))
#define bM4_TMR61_PERCR_PERC9                     (*((volatile unsigned int*)(0x423001A4UL)))
#define bM4_TMR61_PERCR_PERC10                    (*((volatile unsigned int*)(0x423001A8UL)))
#define bM4_TMR61_PERCR_PERC11                    (*((volatile unsigned int*)(0x423001ACUL)))
#define bM4_TMR61_PERCR_PERC12                    (*((volatile unsigned int*)(0x423001B0UL)))
#define bM4_TMR61_PERCR_PERC13                    (*((volatile unsigned int*)(0x423001B4UL)))
#define bM4_TMR61_PERCR_PERC14                    (*((volatile unsigned int*)(0x423001B8UL)))
#define bM4_TMR61_PERCR_PERC15                    (*((volatile unsigned int*)(0x423001BCUL)))
#define bM4_TMR61_GCMAR_GCMA0                     (*((volatile unsigned int*)(0x42300200UL)))
#define bM4_TMR61_GCMAR_GCMA1                     (*((volatile unsigned int*)(0x42300204UL)))
#define bM4_TMR61_GCMAR_GCMA2                     (*((volatile unsigned int*)(0x42300208UL)))
#define bM4_TMR61_GCMAR_GCMA3                     (*((volatile unsigned int*)(0x4230020CUL)))
#define bM4_TMR61_GCMAR_GCMA4                     (*((volatile unsigned int*)(0x42300210UL)))
#define bM4_TMR61_GCMAR_GCMA5                     (*((volatile unsigned int*)(0x42300214UL)))
#define bM4_TMR61_GCMAR_GCMA6                     (*((volatile unsigned int*)(0x42300218UL)))
#define bM4_TMR61_GCMAR_GCMA7                     (*((volatile unsigned int*)(0x4230021CUL)))
#define bM4_TMR61_GCMAR_GCMA8                     (*((volatile unsigned int*)(0x42300220UL)))
#define bM4_TMR61_GCMAR_GCMA9                     (*((volatile unsigned int*)(0x42300224UL)))
#define bM4_TMR61_GCMAR_GCMA10                    (*((volatile unsigned int*)(0x42300228UL)))
#define bM4_TMR61_GCMAR_GCMA11                    (*((volatile unsigned int*)(0x4230022CUL)))
#define bM4_TMR61_GCMAR_GCMA12                    (*((volatile unsigned int*)(0x42300230UL)))
#define bM4_TMR61_GCMAR_GCMA13                    (*((volatile unsigned int*)(0x42300234UL)))
#define bM4_TMR61_GCMAR_GCMA14                    (*((volatile unsigned int*)(0x42300238UL)))
#define bM4_TMR61_GCMAR_GCMA15                    (*((volatile unsigned int*)(0x4230023CUL)))
#define bM4_TMR61_GCMBR_GCMB0                     (*((volatile unsigned int*)(0x42300280UL)))
#define bM4_TMR61_GCMBR_GCMB1                     (*((volatile unsigned int*)(0x42300284UL)))
