patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_TMR61_GCMBR_GCMB2                     (*((volatile unsigned int*)(0x42300288UL)))
#define bM4_TMR61_GCMBR_GCMB3                     (*((volatile unsigned int*)(0x4230028CUL)))
#define bM4_TMR61_GCMBR_GCMB4                     (*((volatile unsigned int*)(0x42300290UL)))
#define bM4_TMR61_GCMBR_GCMB5                     (*((volatile unsigned int*)(0x42300294UL)))
#define bM4_TMR61_GCMBR_GCMB6                     (*((volatile unsigned int*)(0x42300298UL)))
#define bM4_TMR61_GCMBR_GCMB7                     (*((volatile unsigned int*)(0x4230029CUL)))
#define bM4_TMR61_GCMBR_GCMB8                     (*((volatile unsigned int*)(0x423002A0UL)))
#define bM4_TMR61_GCMBR_GCMB9                     (*((volatile unsigned int*)(0x423002A4UL)))
#define bM4_TMR61_GCMBR_GCMB10                    (*((volatile unsigned int*)(0x423002A8UL)))
#define bM4_TMR61_GCMBR_GCMB11                    (*((volatile unsigned int*)(0x423002ACUL)))
#define bM4_TMR61_GCMBR_GCMB12                    (*((volatile unsigned int*)(0x423002B0UL)))
#define bM4_TMR61_GCMBR_GCMB13                    (*((volatile unsigned int*)(0x423002B4UL)))
#define bM4_TMR61_GCMBR_GCMB14                    (*((volatile unsigned int*)(0x423002B8UL)))
#define bM4_TMR61_GCMBR_GCMB15                    (*((volatile unsigned int*)(0x423002BCUL)))
#define bM4_TMR61_GCMCR_GCMC0                     (*((volatile unsigned int*)(0x42300300UL)))
#define bM4_TMR61_GCMCR_GCMC1                     (*((volatile unsigned int*)(0x42300304UL)))
#define bM4_TMR61_GCMCR_GCMC2                     (*((volatile unsigned int*)(0x42300308UL)))
#define bM4_TMR61_GCMCR_GCMC3                     (*((volatile unsigned int*)(0x4230030CUL)))
#define bM4_TMR61_GCMCR_GCMC4                     (*((volatile unsigned int*)(0x42300310UL)))
#define bM4_TMR61_GCMCR_GCMC5                     (*((volatile unsigned int*)(0x42300314UL)))
#define bM4_TMR61_GCMCR_GCMC6                     (*((volatile unsigned int*)(0x42300318UL)))
#define bM4_TMR61_GCMCR_GCMC7                     (*((volatile unsigned int*)(0x4230031CUL)))
#define bM4_TMR61_GCMCR_GCMC8                     (*((volatile unsigned int*)(0x42300320UL)))
#define bM4_TMR61_GCMCR_GCMC9                     (*((volatile unsigned int*)(0x42300324UL)))
#define bM4_TMR61_GCMCR_GCMC10                    (*((volatile unsigned int*)(0x42300328UL)))
#define bM4_TMR61_GCMCR_GCMC11                    (*((volatile unsigned int*)(0x4230032CUL)))
#define bM4_TMR61_GCMCR_GCMC12                    (*((volatile unsigned int*)(0x42300330UL)))
#define bM4_TMR61_GCMCR_GCMC13                    (*((volatile unsigned int*)(0x42300334UL)))
#define bM4_TMR61_GCMCR_GCMC14                    (*((volatile unsigned int*)(0x42300338UL)))
#define bM4_TMR61_GCMCR_GCMC15                    (*((volatile unsigned int*)(0x4230033CUL)))
#define bM4_TMR61_GCMDR_GCMD0                     (*((volatile unsigned int*)(0x42300380UL)))
#define bM4_TMR61_GCMDR_GCMD1                     (*((volatile unsigned int*)(0x42300384UL)))
#define bM4_TMR61_GCMDR_GCMD2                     (*((volatile unsigned int*)(0x42300388UL)))
#define bM4_TMR61_GCMDR_GCMD3                     (*((volatile unsigned int*)(0x4230038CUL)))
#define bM4_TMR61_GCMDR_GCMD4                     (*((volatile unsigned int*)(0x42300390UL)))
#define bM4_TMR61_GCMDR_GCMD5                     (*((volatile unsigned int*)(0x42300394UL)))
#define bM4_TMR61_GCMDR_GCMD6                     (*((volatile unsigned int*)(0x42300398UL)))
#define bM4_TMR61_GCMDR_GCMD7                     (*((volatile unsigned int*)(0x4230039CUL)))
#define bM4_TMR61_GCMDR_GCMD8                     (*((volatile unsigned int*)(0x423003A0UL)))
#define bM4_TMR61_GCMDR_GCMD9                     (*((volatile unsigned int*)(0x423003A4UL)))
#define bM4_TMR61_GCMDR_GCMD10                    (*((volatile unsigned int*)(0x423003A8UL)))
#define bM4_TMR61_GCMDR_GCMD11                    (*((volatile unsigned int*)(0x423003ACUL)))
#define bM4_TMR61_GCMDR_GCMD12                    (*((volatile unsigned int*)(0x423003B0UL)))
#define bM4_TMR61_GCMDR_GCMD13                    (*((volatile unsigned int*)(0x423003B4UL)))
#define bM4_TMR61_GCMDR_GCMD14                    (*((volatile unsigned int*)(0x423003B8UL)))
#define bM4_TMR61_GCMDR_GCMD15                    (*((volatile unsigned int*)(0x423003BCUL)))
#define bM4_TMR61_GCMER_GCME0                     (*((volatile unsigned int*)(0x42300400UL)))
#define bM4_TMR61_GCMER_GCME1                     (*((volatile unsigned int*)(0x42300404UL)))
#define bM4_TMR61_GCMER_GCME2                     (*((volatile unsigned int*)(0x42300408UL)))
#define bM4_TMR61_GCMER_GCME3                     (*((volatile unsigned int*)(0x4230040CUL)))
#define bM4_TMR61_GCMER_GCME4                     (*((volatile unsigned int*)(0x42300410UL)))
#define bM4_TMR61_GCMER_GCME5                     (*((volatile unsigned int*)(0x42300414UL)))
#define bM4_TMR61_GCMER_GCME6                     (*((volatile unsigned int*)(0x42300418UL)))
#define bM4_TMR61_GCMER_GCME7                     (*((volatile unsigned int*)(0x4230041CUL)))
#define bM4_TMR61_GCMER_GCME8                     (*((volatile unsigned int*)(0x42300420UL)))
#define bM4_TMR61_GCMER_GCME9                     (*((volatile unsigned int*)(0x42300424UL)))
#define bM4_TMR61_GCMER_GCME10                    (*((volatile unsigned int*)(0x42300428UL)))
#define bM4_TMR61_GCMER_GCME11                    (*((volatile unsigned int*)(0x4230042CUL)))
#define bM4_TMR61_GCMER_GCME12                    (*((volatile unsigned int*)(0x42300430UL)))
#define bM4_TMR61_GCMER_GCME13                    (*((volatile unsigned int*)(0x42300434UL)))
#define bM4_TMR61_GCMER_GCME14                    (*((volatile unsigned int*)(0x42300438UL)))
#define bM4_TMR61_GCMER_GCME15                    (*((volatile unsigned int*)(0x4230043CUL)))
#define bM4_TMR61_GCMFR_GCMF0                     (*((volatile unsigned int*)(0x42300480UL)))
#define bM4_TMR61_GCMFR_GCMF1                     (*((volatile unsigned int*)(0x42300484UL)))
#define bM4_TMR61_GCMFR_GCMF2                     (*((volatile unsigned int*)(0x42300488UL)))
#define bM4_TMR61_GCMFR_GCMF3                     (*((volatile unsigned int*)(0x4230048CUL)))
#define bM4_TMR61_GCMFR_GCMF4                     (*((volatile unsigned int*)(0x42300490UL)))
#define bM4_TMR61_GCMFR_GCMF5                     (*((volatile unsigned int*)(0x42300494UL)))
#define bM4_TMR61_GCMFR_GCMF6                     (*((volatile unsigned int*)(0x42300498UL)))
#define bM4_TMR61_GCMFR_GCMF7                     (*((volatile unsigned int*)(0x4230049CUL)))
#define bM4_TMR61_GCMFR_GCMF8                     (*((volatile unsigned int*)(0x423004A0UL)))
#define bM4_TMR61_GCMFR_GCMF9                     (*((volatile unsigned int*)(0x423004A4UL)))
#define bM4_TMR61_GCMFR_GCMF10                    (*((volatile unsigned int*)(0x423004A8UL)))
#define bM4_TMR61_GCMFR_GCMF11                    (*((volatile unsigned int*)(0x423004ACUL)))
#define bM4_TMR61_GCMFR_GCMF12                    (*((volatile unsigned int*)(0x423004B0UL)))
#define bM4_TMR61_GCMFR_GCMF13                    (*((volatile unsigned int*)(0x423004B4UL)))
#define bM4_TMR61_GCMFR_GCMF14                    (*((volatile unsigned int*)(0x423004B8UL)))
#define bM4_TMR61_GCMFR_GCMF15                    (*((volatile unsigned int*)(0x423004BCUL)))
#define bM4_TMR61_SCMAR_SCMA0                     (*((volatile unsigned int*)(0x42300500UL)))
#define bM4_TMR61_SCMAR_SCMA1                     (*((volatile unsigned int*)(0x42300504UL)))
#define bM4_TMR61_SCMAR_SCMA2                     (*((volatile unsigned int*)(0x42300508UL)))
#define bM4_TMR61_SCMAR_SCMA3                     (*((volatile unsigned int*)(0x4230050CUL)))
#define bM4_TMR61_SCMAR_SCMA4                     (*((volatile unsigned int*)(0x42300510UL)))
#define bM4_TMR61_SCMAR_SCMA5                     (*((volatile unsigned int*)(0x42300514UL)))
#define bM4_TMR61_SCMAR_SCMA6                     (*((volatile unsigned int*)(0x42300518UL)))
#define bM4_TMR61_SCMAR_SCMA7                     (*((volatile unsigned int*)(0x4230051CUL)))
#define bM4_TMR61_SCMAR_SCMA8                     (*((volatile unsigned int*)(0x42300520UL)))
#define bM4_TMR61_SCMAR_SCMA9                     (*((volatile unsigned int*)(0x42300524UL)))
#define bM4_TMR61_SCMAR_SCMA10                    (*((volatile unsigned int*)(0x42300528UL)))
#define bM4_TMR61_SCMAR_SCMA11                    (*((volatile unsigned int*)(0x4230052CUL)))
#define bM4_TMR61_SCMAR_SCMA12                    (*((volatile unsigned int*)(0x42300530UL)))
#define bM4_TMR61_SCMAR_SCMA13                    (*((volatile unsigned int*)(0x42300534UL)))
#define bM4_TMR61_SCMAR_SCMA14                    (*((volatile unsigned int*)(0x42300538UL)))
#define bM4_TMR61_SCMAR_SCMA15                    (*((volatile unsigned int*)(0x4230053CUL)))
#define bM4_TMR61_SCMBR_SCMB0                     (*((volatile unsigned int*)(0x42300580UL)))
#define bM4_TMR61_SCMBR_SCMB1                     (*((volatile unsigned int*)(0x42300584UL)))
#define bM4_TMR61_SCMBR_SCMB2                     (*((volatile unsigned int*)(0x42300588UL)))
#define bM4_TMR61_SCMBR_SCMB3                     (*((volatile unsigned int*)(0x4230058CUL)))
#define bM4_TMR61_SCMBR_SCMB4                     (*((volatile unsigned int*)(0x42300590UL)))
#define bM4_TMR61_SCMBR_SCMB5                     (*((volatile unsigned int*)(0x42300594UL)))
#define bM4_TMR61_SCMBR_SCMB6                     (*((volatile unsigned int*)(0x42300598UL)))
#define bM4_TMR61_SCMBR_SCMB7                     (*((volatile unsigned int*)(0x4230059CUL)))
#define bM4_TMR61_SCMBR_SCMB8                     (*((volatile unsigned int*)(0x423005A0UL)))
#define bM4_TMR61_SCMBR_SCMB9                     (*((volatile unsigned int*)(0x423005A4UL)))
#define bM4_TMR61_SCMBR_SCMB10                    (*((volatile unsigned int*)(0x423005A8UL)))
#define bM4_TMR61_SCMBR_SCMB11                    (*((volatile unsigned int*)(0x423005ACUL)))
#define bM4_TMR61_SCMBR_SCMB12                    (*((volatile unsigned int*)(0x423005B0UL)))
#define bM4_TMR61_SCMBR_SCMB13                    (*((volatile unsigned int*)(0x423005B4UL)))
#define bM4_TMR61_SCMBR_SCMB14                    (*((volatile unsigned int*)(0x423005B8UL)))
#define bM4_TMR61_SCMBR_SCMB15                    (*((volatile unsigned int*)(0x423005BCUL)))
#define bM4_TMR61_SCMCR_SCMC0                     (*((volatile unsigned int*)(0x42300600UL)))
#define bM4_TMR61_SCMCR_SCMC1                     (*((volatile unsigned int*)(0x42300604UL)))
#define bM4_TMR61_SCMCR_SCMC2                     (*((volatile unsigned int*)(0x42300608UL)))
#define bM4_TMR61_SCMCR_SCMC3                     (*((volatile unsigned int*)(0x4230060CUL)))
#define bM4_TMR61_SCMCR_SCMC4                     (*((volatile unsigned int*)(0x42300610UL)))
#define bM4_TMR61_SCMCR_SCMC5                     (*((volatile unsigned int*)(0x42300614UL)))
#define bM4_TMR61_SCMCR_SCMC6                     (*((volatile unsigned int*)(0x42300618UL)))
#define bM4_TMR61_SCMCR_SCMC7                     (*((volatile unsigned int*)(0x4230061CUL)))
#define bM4_TMR61_SCMCR_SCMC8                     (*((volatile unsigned int*)(0x42300620UL)))
#define bM4_TMR61_SCMCR_SCMC9                     (*((volatile unsigned int*)(0x42300624UL)))
#define bM4_TMR61_SCMCR_SCMC10                    (*((volatile unsigned int*)(0x42300628UL)))
#define bM4_TMR61_SCMCR_SCMC11                    (*((volatile unsigned int*)(0x4230062CUL)))
#define bM4_TMR61_SCMCR_SCMC12                    (*((volatile unsigned int*)(0x42300630UL)))
#define bM4_TMR61_SCMCR_SCMC13                    (*((volatile unsigned int*)(0x42300634UL)))
#define bM4_TMR61_SCMCR_SCMC14                    (*((volatile unsigned int*)(0x42300638UL)))
#define bM4_TMR61_SCMCR_SCMC15                    (*((volatile unsigned int*)(0x4230063CUL)))
#define bM4_TMR61_SCMDR_SCMD0                     (*((volatile unsigned int*)(0x42300680UL)))
#define bM4_TMR61_SCMDR_SCMD1                     (*((volatile unsigned int*)(0x42300684UL)))
#define bM4_TMR61_SCMDR_SCMD2                     (*((volatile unsigned int*)(0x42300688UL)))
#define bM4_TMR61_SCMDR_SCMD3                     (*((volatile unsigned int*)(0x4230068CUL)))
#define bM4_TMR61_SCMDR_SCMD4                     (*((volatile unsigned int*)(0x42300690UL)))
#define bM4_TMR61_SCMDR_SCMD5                     (*((volatile unsigned int*)(0x42300694UL)))
#define bM4_TMR61_SCMDR_SCMD6                     (*((volatile unsigned int*)(0x42300698UL)))
#define bM4_TMR61_SCMDR_SCMD7                     (*((volatile unsigned int*)(0x4230069CUL)))
#define bM4_TMR61_SCMDR_SCMD8                     (*((volatile unsigned int*)(0x423006A0UL)))
#define bM4_TMR61_SCMDR_SCMD9                     (*((volatile unsigned int*)(0x423006A4UL)))
#define bM4_TMR61_SCMDR_SCMD10                    (*((volatile unsigned int*)(0x423006A8UL)))
#define bM4_TMR61_SCMDR_SCMD11                    (*((volatile unsigned int*)(0x423006ACUL)))
#define bM4_TMR61_SCMDR_SCMD12                    (*((volatile unsigned int*)(0x423006B0UL)))
#define bM4_TMR61_SCMDR_SCMD13                    (*((volatile unsigned int*)(0x423006B4UL)))
#define bM4_TMR61_SCMDR_SCMD14                    (*((volatile unsigned int*)(0x423006B8UL)))
#define bM4_TMR61_SCMDR_SCMD15                    (*((volatile unsigned int*)(0x423006BCUL)))
#define bM4_TMR61_SCMER_SCME0                     (*((volatile unsigned int*)(0x42300700UL)))
#define bM4_TMR61_SCMER_SCME1                     (*((volatile unsigned int*)(0x42300704UL)))
#define bM4_TMR61_SCMER_SCME2                     (*((volatile unsigned int*)(0x42300708UL)))
#define bM4_TMR61_SCMER_SCME3                     (*((volatile unsigned int*)(0x4230070CUL)))
#define bM4_TMR61_SCMER_SCME4                     (*((volatile unsigned int*)(0x42300710UL)))
#define bM4_TMR61_SCMER_SCME5                     (*((volatile unsigned int*)(0x42300714UL)))
#define bM4_TMR61_SCMER_SCME6                     (*((volatile unsigned int*)(0x42300718UL)))
#define bM4_TMR61_SCMER_SCME7                     (*((volatile unsigned int*)(0x4230071CUL)))
#define bM4_TMR61_SCMER_SCME8                     (*((volatile unsigned int*)(0x42300720UL)))
#define bM4_TMR61_SCMER_SCME9                     (*((volatile unsigned int*)(0x42300724UL)))
#define bM4_TMR61_SCMER_SCME10                    (*((volatile unsigned int*)(0x42300728UL)))
#define bM4_TMR61_SCMER_SCME11                    (*((volatile unsigned int*)(0x4230072CUL)))
#define bM4_TMR61_SCMER_SCME12                    (*((volatile unsigned int*)(0x42300730UL)))
#define bM4_TMR61_SCMER_SCME13                    (*((volatile unsigned int*)(0x42300734UL)))
#define bM4_TMR61_SCMER_SCME14                    (*((volatile unsigned int*)(0x42300738UL)))
#define bM4_TMR61_SCMER_SCME15                    (*((volatile unsigned int*)(0x4230073CUL)))
#define bM4_TMR61_SCMFR_SCMF0                     (*((volatile unsigned int*)(0x42300780UL)))
#define bM4_TMR61_SCMFR_SCMF1                     (*((volatile unsigned int*)(0x42300784UL)))
#define bM4_TMR61_SCMFR_SCMF2                     (*((volatile unsigned int*)(0x42300788UL)))
#define bM4_TMR61_SCMFR_SCMF3                     (*((volatile unsigned int*)(0x4230078CUL)))
#define bM4_TMR61_SCMFR_SCMF4                     (*((volatile unsigned int*)(0x42300790UL)))
#define bM4_TMR61_SCMFR_SCMF5                     (*((volatile unsigned int*)(0x42300794UL)))
#define bM4_TMR61_SCMFR_SCMF6                     (*((volatile unsigned int*)(0x42300798UL)))
#define bM4_TMR61_SCMFR_SCMF7                     (*((volatile unsigned int*)(0x4230079CUL)))
#define bM4_TMR61_SCMFR_SCMF8                     (*((volatile unsigned int*)(0x423007A0UL)))
#define bM4_TMR61_SCMFR_SCMF9                     (*((volatile unsigned int*)(0x423007A4UL)))
#define bM4_TMR61_SCMFR_SCMF10                    (*((volatile unsigned int*)(0x423007A8UL)))
#define bM4_TMR61_SCMFR_SCMF11                    (*((volatile unsigned int*)(0x423007ACUL)))
#define bM4_TMR61_SCMFR_SCMF12                    (*((volatile unsigned int*)(0x423007B0UL)))
#define bM4_TMR61_SCMFR_SCMF13                    (*((volatile unsigned int*)(0x423007B4UL)))
#define bM4_TMR61_SCMFR_SCMF14                    (*((volatile unsigned int*)(0x423007B8UL)))
#define bM4_TMR61_SCMFR_SCMF15                    (*((volatile unsigned int*)(0x423007BCUL)))
#define bM4_TMR61_DTUAR_DTUA0                     (*((volatile unsigned int*)(0x42300800UL)))
#define bM4_TMR61_DTUAR_DTUA1                     (*((volatile unsigned int*)(0x42300804UL)))
#define bM4_TMR61_DTUAR_DTUA2                     (*((volatile unsigned int*)(0x42300808UL)))
#define bM4_TMR61_DTUAR_DTUA3                     (*((volatile unsigned int*)(0x4230080CUL)))
#define bM4_TMR61_DTUAR_DTUA4                     (*((volatile unsigned int*)(0x42300810UL)))
#define bM4_TMR61_DTUAR_DTUA5                     (*((volatile unsigned int*)(0x42300814UL)))
#define bM4_TMR61_DTUAR_DTUA6                     (*((volatile unsigned int*)(0x42300818UL)))
#define bM4_TMR61_DTUAR_DTUA7                     (*((volatile unsigned int*)(0x4230081CUL)))
#define bM4_TMR61_DTUAR_DTUA8                     (*((volatile unsigned int*)(0x42300820UL)))
#define bM4_TMR61_DTUAR_DTUA9                     (*((volatile unsigned int*)(0x42300824UL)))
#define bM4_TMR61_DTUAR_DTUA10                    (*((volatile unsigned int*)(0x42300828UL)))
#define bM4_TMR61_DTUAR_DTUA11                    (*((volatile unsigned int*)(0x4230082CUL)))
#define bM4_TMR61_DTUAR_DTUA12                    (*((volatile unsigned int*)(0x42300830UL)))
#define bM4_TMR61_DTUAR_DTUA13                    (*((volatile unsigned int*)(0x42300834UL)))
#define bM4_TMR61_DTUAR_DTUA14                    (*((volatile unsigned int*)(0x42300838UL)))
#define bM4_TMR61_DTUAR_DTUA15                    (*((volatile unsigned int*)(0x4230083CUL)))
#define bM4_TMR61_DTDAR_DTDA0                     (*((volatile unsigned int*)(0x42300880UL)))
#define bM4_TMR61_DTDAR_DTDA1                     (*((volatile unsigned int*)(0x42300884UL)))
#define bM4_TMR61_DTDAR_DTDA2                     (*((volatile unsigned int*)(0x42300888UL)))
#define bM4_TMR61_DTDAR_DTDA3                     (*((volatile unsigned int*)(0x4230088CUL)))
#define bM4_TMR61_DTDAR_DTDA4                     (*((volatile unsigned int*)(0x42300890UL)))
#define bM4_TMR61_DTDAR_DTDA5                     (*((volatile unsigned int*)(0x42300894UL)))
#define bM4_TMR61_DTDAR_DTDA6                     (*((volatile unsigned int*)(0x42300898UL)))
#define bM4_TMR61_DTDAR_DTDA7                     (*((volatile unsigned int*)(0x4230089CUL)))
#define bM4_TMR61_DTDAR_DTDA8                     (*((volatile unsigned int*)(0x423008A0UL)))
#define bM4_TMR61_DTDAR_DTDA9                     (*((volatile unsigned int*)(0x423008A4UL)))
#define bM4_TMR61_DTDAR_DTDA10                    (*((volatile unsigned int*)(0x423008A8UL)))
#define bM4_TMR61_DTDAR_DTDA11                    (*((volatile unsigned int*)(0x423008ACUL)))
#define bM4_TMR61_DTDAR_DTDA12                    (*((volatile unsigned int*)(0x423008B0UL)))
#define bM4_TMR61_DTDAR_DTDA13                    (*((volatile unsigned int*)(0x423008B4UL)))
#define bM4_TMR61_DTDAR_DTDA14                    (*((volatile unsigned int*)(0x423008B8UL)))
#define bM4_TMR61_DTDAR_DTDA15                    (*((volatile unsigned int*)(0x423008BCUL)))
#define bM4_TMR61_DTUBR_DTUB0                     (*((volatile unsigned int*)(0x42300900UL)))
#define bM4_TMR61_DTUBR_DTUB1                     (*((volatile unsigned int*)(0x42300904UL)))
#define bM4_TMR61_DTUBR_DTUB2                     (*((volatile unsigned int*)(0x42300908UL)))
#define bM4_TMR61_DTUBR_DTUB3                     (*((volatile unsigned int*)(0x4230090CUL)))
#define bM4_TMR61_DTUBR_DTUB4                     (*((volatile unsigned int*)(0x42300910UL)))
#define bM4_TMR61_DTUBR_DTUB5                     (*((volatile unsigned int*)(0x42300914UL)))
#define bM4_TMR61_DTUBR_DTUB6                     (*((volatile unsigned int*)(0x42300918UL)))
#define bM4_TMR61_DTUBR_DTUB7                     (*((volatile unsigned int*)(0x4230091CUL)))
#define bM4_TMR61_DTUBR_DTUB8                     (*((volatile unsigned int*)(0x42300920UL)))
#define bM4_TMR61_DTUBR_DTUB9                     (*((volatile unsigned int*)(0x42300924UL)))
#define bM4_TMR61_DTUBR_DTUB10                    (*((volatile unsigned int*)(0x42300928UL)))
#define bM4_TMR61_DTUBR_DTUB11                    (*((volatile unsigned int*)(0x4230092CUL)))
#define bM4_TMR61_DTUBR_DTUB12                    (*((volatile unsigned int*)(0x42300930UL)))
#define bM4_TMR61_DTUBR_DTUB13                    (*((volatile unsigned int*)(0x42300934UL)))
#define bM4_TMR61_DTUBR_DTUB14                    (*((volatile unsigned int*)(0x42300938UL)))
#define bM4_TMR61_DTUBR_DTUB15                    (*((volatile unsigned int*)(0x4230093CUL)))
#define bM4_TMR61_DTDBR_DTDB0                     (*((volatile unsigned int*)(0x42300980UL)))
#define bM4_TMR61_DTDBR_DTDB1                     (*((volatile unsigned int*)(0x42300984UL)))
#define bM4_TMR61_DTDBR_DTDB2                     (*((volatile unsigned int*)(0x42300988UL)))
#define bM4_TMR61_DTDBR_DTDB3                     (*((volatile unsigned int*)(0x4230098CUL)))
#define bM4_TMR61_DTDBR_DTDB4                     (*((volatile unsigned int*)(0x42300990UL)))
#define bM4_TMR61_DTDBR_DTDB5                     (*((volatile unsigned int*)(0x42300994UL)))
#define bM4_TMR61_DTDBR_DTDB6                     (*((volatile unsigned int*)(0x42300998UL)))
#define bM4_TMR61_DTDBR_DTDB7                     (*((volatile unsigned int*)(0x4230099CUL)))
#define bM4_TMR61_DTDBR_DTDB8                     (*((volatile unsigned int*)(0x423009A0UL)))
#define bM4_TMR61_DTDBR_DTDB9                     (*((volatile unsigned int*)(0x423009A4UL)))
#define bM4_TMR61_DTDBR_DTDB10                    (*((volatile unsigned int*)(0x423009A8UL)))
#define bM4_TMR61_DTDBR_DTDB11                    (*((volatile unsigned int*)(0x423009ACUL)))
#define bM4_TMR61_DTDBR_DTDB12                    (*((volatile unsigned int*)(0x423009B0UL)))
#define bM4_TMR61_DTDBR_DTDB13                    (*((volatile unsigned int*)(0x423009B4UL)))
#define bM4_TMR61_DTDBR_DTDB14                    (*((volatile unsigned int*)(0x423009B8UL)))
#define bM4_TMR61_DTDBR_DTDB15                    (*((volatile unsigned int*)(0x423009BCUL)))
#define bM4_TMR61_GCONR_START                     (*((volatile unsigned int*)(0x42300A00UL)))
#define bM4_TMR61_GCONR_MODE0                     (*((volatile unsigned int*)(0x42300A04UL)))
#define bM4_TMR61_GCONR_MODE1                     (*((volatile unsigned int*)(0x42300A08UL)))
#define bM4_TMR61_GCONR_MODE2                     (*((volatile unsigned int*)(0x42300A0CUL)))
#define bM4_TMR61_GCONR_CKDIV0                    (*((volatile unsigned int*)(0x42300A10UL)))
#define bM4_TMR61_GCONR_CKDIV1                    (*((volatile unsigned int*)(0x42300A14UL)))
#define bM4_TMR61_GCONR_CKDIV2                    (*((volatile unsigned int*)(0x42300A18UL)))
#define bM4_TMR61_GCONR_DIR                       (*((volatile unsigned int*)(0x42300A20UL)))
#define bM4_TMR61_GCONR_ZMSKREV                   (*((volatile unsigned int*)(0x42300A40UL)))
#define bM4_TMR61_GCONR_ZMSKPOS                   (*((volatile unsigned int*)(0x42300A44UL)))
#define bM4_TMR61_GCONR_ZMSKVAL0                  (*((volatile unsigned int*)(0x42300A48UL)))
#define bM4_TMR61_GCONR_ZMSKVAL1                  (*((volatile unsigned int*)(0x42300A4CUL)))
#define bM4_TMR61_ICONR_INTENA                    (*((volatile unsigned int*)(0x42300A80UL)))
#define bM4_TMR61_ICONR_INTENB                    (*((volatile unsigned int*)(0x42300A84UL)))
#define bM4_TMR61_ICONR_INTENC                    (*((volatile unsigned int*)(0x42300A88UL)))
#define bM4_TMR61_ICONR_INTEND                    (*((volatile unsigned int*)(0x42300A8CUL)))
#define bM4_TMR61_ICONR_INTENE                    (*((volatile unsigned int*)(0x42300A90UL)))
