patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_TMR63_GCMCR_GCMC2                     (*((volatile unsigned int*)(0x42310308UL)))
#define bM4_TMR63_GCMCR_GCMC3                     (*((volatile unsigned int*)(0x4231030CUL)))
#define bM4_TMR63_GCMCR_GCMC4                     (*((volatile unsigned int*)(0x42310310UL)))
#define bM4_TMR63_GCMCR_GCMC5                     (*((volatile unsigned int*)(0x42310314UL)))
#define bM4_TMR63_GCMCR_GCMC6                     (*((volatile unsigned int*)(0x42310318UL)))
#define bM4_TMR63_GCMCR_GCMC7                     (*((volatile unsigned int*)(0x4231031CUL)))
#define bM4_TMR63_GCMCR_GCMC8                     (*((volatile unsigned int*)(0x42310320UL)))
#define bM4_TMR63_GCMCR_GCMC9                     (*((volatile unsigned int*)(0x42310324UL)))
#define bM4_TMR63_GCMCR_GCMC10                    (*((volatile unsigned int*)(0x42310328UL)))
#define bM4_TMR63_GCMCR_GCMC11                    (*((volatile unsigned int*)(0x4231032CUL)))
#define bM4_TMR63_GCMCR_GCMC12                    (*((volatile unsigned int*)(0x42310330UL)))
#define bM4_TMR63_GCMCR_GCMC13                    (*((volatile unsigned int*)(0x42310334UL)))
#define bM4_TMR63_GCMCR_GCMC14                    (*((volatile unsigned int*)(0x42310338UL)))
#define bM4_TMR63_GCMCR_GCMC15                    (*((volatile unsigned int*)(0x4231033CUL)))
#define bM4_TMR63_GCMDR_GCMD0                     (*((volatile unsigned int*)(0x42310380UL)))
#define bM4_TMR63_GCMDR_GCMD1                     (*((volatile unsigned int*)(0x42310384UL)))
#define bM4_TMR63_GCMDR_GCMD2                     (*((volatile unsigned int*)(0x42310388UL)))
#define bM4_TMR63_GCMDR_GCMD3                     (*((volatile unsigned int*)(0x4231038CUL)))
#define bM4_TMR63_GCMDR_GCMD4                     (*((volatile unsigned int*)(0x42310390UL)))
#define bM4_TMR63_GCMDR_GCMD5                     (*((volatile unsigned int*)(0x42310394UL)))
#define bM4_TMR63_GCMDR_GCMD6                     (*((volatile unsigned int*)(0x42310398UL)))
#define bM4_TMR63_GCMDR_GCMD7                     (*((volatile unsigned int*)(0x4231039CUL)))
#define bM4_TMR63_GCMDR_GCMD8                     (*((volatile unsigned int*)(0x423103A0UL)))
#define bM4_TMR63_GCMDR_GCMD9                     (*((volatile unsigned int*)(0x423103A4UL)))
#define bM4_TMR63_GCMDR_GCMD10                    (*((volatile unsigned int*)(0x423103A8UL)))
#define bM4_TMR63_GCMDR_GCMD11                    (*((volatile unsigned int*)(0x423103ACUL)))
#define bM4_TMR63_GCMDR_GCMD12                    (*((volatile unsigned int*)(0x423103B0UL)))
#define bM4_TMR63_GCMDR_GCMD13                    (*((volatile unsigned int*)(0x423103B4UL)))
#define bM4_TMR63_GCMDR_GCMD14                    (*((volatile unsigned int*)(0x423103B8UL)))
#define bM4_TMR63_GCMDR_GCMD15                    (*((volatile unsigned int*)(0x423103BCUL)))
#define bM4_TMR63_GCMER_GCME0                     (*((volatile unsigned int*)(0x42310400UL)))
#define bM4_TMR63_GCMER_GCME1                     (*((volatile unsigned int*)(0x42310404UL)))
#define bM4_TMR63_GCMER_GCME2                     (*((volatile unsigned int*)(0x42310408UL)))
#define bM4_TMR63_GCMER_GCME3                     (*((volatile unsigned int*)(0x4231040CUL)))
#define bM4_TMR63_GCMER_GCME4                     (*((volatile unsigned int*)(0x42310410UL)))
#define bM4_TMR63_GCMER_GCME5                     (*((volatile unsigned int*)(0x42310414UL)))
#define bM4_TMR63_GCMER_GCME6                     (*((volatile unsigned int*)(0x42310418UL)))
#define bM4_TMR63_GCMER_GCME7                     (*((volatile unsigned int*)(0x4231041CUL)))
#define bM4_TMR63_GCMER_GCME8                     (*((volatile unsigned int*)(0x42310420UL)))
#define bM4_TMR63_GCMER_GCME9                     (*((volatile unsigned int*)(0x42310424UL)))
#define bM4_TMR63_GCMER_GCME10                    (*((volatile unsigned int*)(0x42310428UL)))
#define bM4_TMR63_GCMER_GCME11                    (*((volatile unsigned int*)(0x4231042CUL)))
#define bM4_TMR63_GCMER_GCME12                    (*((volatile unsigned int*)(0x42310430UL)))
#define bM4_TMR63_GCMER_GCME13                    (*((volatile unsigned int*)(0x42310434UL)))
#define bM4_TMR63_GCMER_GCME14                    (*((volatile unsigned int*)(0x42310438UL)))
#define bM4_TMR63_GCMER_GCME15                    (*((volatile unsigned int*)(0x4231043CUL)))
#define bM4_TMR63_GCMFR_GCMF0                     (*((volatile unsigned int*)(0x42310480UL)))
#define bM4_TMR63_GCMFR_GCMF1                     (*((volatile unsigned int*)(0x42310484UL)))
#define bM4_TMR63_GCMFR_GCMF2                     (*((volatile unsigned int*)(0x42310488UL)))
#define bM4_TMR63_GCMFR_GCMF3                     (*((volatile unsigned int*)(0x4231048CUL)))
#define bM4_TMR63_GCMFR_GCMF4                     (*((volatile unsigned int*)(0x42310490UL)))
#define bM4_TMR63_GCMFR_GCMF5                     (*((volatile unsigned int*)(0x42310494UL)))
#define bM4_TMR63_GCMFR_GCMF6                     (*((volatile unsigned int*)(0x42310498UL)))
#define bM4_TMR63_GCMFR_GCMF7                     (*((volatile unsigned int*)(0x4231049CUL)))
#define bM4_TMR63_GCMFR_GCMF8                     (*((volatile unsigned int*)(0x423104A0UL)))
#define bM4_TMR63_GCMFR_GCMF9                     (*((volatile unsigned int*)(0x423104A4UL)))
#define bM4_TMR63_GCMFR_GCMF10                    (*((volatile unsigned int*)(0x423104A8UL)))
#define bM4_TMR63_GCMFR_GCMF11                    (*((volatile unsigned int*)(0x423104ACUL)))
#define bM4_TMR63_GCMFR_GCMF12                    (*((volatile unsigned int*)(0x423104B0UL)))
#define bM4_TMR63_GCMFR_GCMF13                    (*((volatile unsigned int*)(0x423104B4UL)))
#define bM4_TMR63_GCMFR_GCMF14                    (*((volatile unsigned int*)(0x423104B8UL)))
#define bM4_TMR63_GCMFR_GCMF15                    (*((volatile unsigned int*)(0x423104BCUL)))
#define bM4_TMR63_SCMAR_SCMA0                     (*((volatile unsigned int*)(0x42310500UL)))
#define bM4_TMR63_SCMAR_SCMA1                     (*((volatile unsigned int*)(0x42310504UL)))
#define bM4_TMR63_SCMAR_SCMA2                     (*((volatile unsigned int*)(0x42310508UL)))
#define bM4_TMR63_SCMAR_SCMA3                     (*((volatile unsigned int*)(0x4231050CUL)))
#define bM4_TMR63_SCMAR_SCMA4                     (*((volatile unsigned int*)(0x42310510UL)))
#define bM4_TMR63_SCMAR_SCMA5                     (*((volatile unsigned int*)(0x42310514UL)))
#define bM4_TMR63_SCMAR_SCMA6                     (*((volatile unsigned int*)(0x42310518UL)))
#define bM4_TMR63_SCMAR_SCMA7                     (*((volatile unsigned int*)(0x4231051CUL)))
#define bM4_TMR63_SCMAR_SCMA8                     (*((volatile unsigned int*)(0x42310520UL)))
#define bM4_TMR63_SCMAR_SCMA9                     (*((volatile unsigned int*)(0x42310524UL)))
#define bM4_TMR63_SCMAR_SCMA10                    (*((volatile unsigned int*)(0x42310528UL)))
#define bM4_TMR63_SCMAR_SCMA11                    (*((volatile unsigned int*)(0x4231052CUL)))
#define bM4_TMR63_SCMAR_SCMA12                    (*((volatile unsigned int*)(0x42310530UL)))
#define bM4_TMR63_SCMAR_SCMA13                    (*((volatile unsigned int*)(0x42310534UL)))
#define bM4_TMR63_SCMAR_SCMA14                    (*((volatile unsigned int*)(0x42310538UL)))
#define bM4_TMR63_SCMAR_SCMA15                    (*((volatile unsigned int*)(0x4231053CUL)))
#define bM4_TMR63_SCMBR_SCMB0                     (*((volatile unsigned int*)(0x42310580UL)))
#define bM4_TMR63_SCMBR_SCMB1                     (*((volatile unsigned int*)(0x42310584UL)))
#define bM4_TMR63_SCMBR_SCMB2                     (*((volatile unsigned int*)(0x42310588UL)))
#define bM4_TMR63_SCMBR_SCMB3                     (*((volatile unsigned int*)(0x4231058CUL)))
#define bM4_TMR63_SCMBR_SCMB4                     (*((volatile unsigned int*)(0x42310590UL)))
#define bM4_TMR63_SCMBR_SCMB5                     (*((volatile unsigned int*)(0x42310594UL)))
#define bM4_TMR63_SCMBR_SCMB6                     (*((volatile unsigned int*)(0x42310598UL)))
#define bM4_TMR63_SCMBR_SCMB7                     (*((volatile unsigned int*)(0x4231059CUL)))
#define bM4_TMR63_SCMBR_SCMB8                     (*((volatile unsigned int*)(0x423105A0UL)))
#define bM4_TMR63_SCMBR_SCMB9                     (*((volatile unsigned int*)(0x423105A4UL)))
#define bM4_TMR63_SCMBR_SCMB10                    (*((volatile unsigned int*)(0x423105A8UL)))
#define bM4_TMR63_SCMBR_SCMB11                    (*((volatile unsigned int*)(0x423105ACUL)))
#define bM4_TMR63_SCMBR_SCMB12                    (*((volatile unsigned int*)(0x423105B0UL)))
#define bM4_TMR63_SCMBR_SCMB13                    (*((volatile unsigned int*)(0x423105B4UL)))
#define bM4_TMR63_SCMBR_SCMB14                    (*((volatile unsigned int*)(0x423105B8UL)))
#define bM4_TMR63_SCMBR_SCMB15                    (*((volatile unsigned int*)(0x423105BCUL)))
#define bM4_TMR63_SCMCR_SCMC0                     (*((volatile unsigned int*)(0x42310600UL)))
#define bM4_TMR63_SCMCR_SCMC1                     (*((volatile unsigned int*)(0x42310604UL)))
#define bM4_TMR63_SCMCR_SCMC2                     (*((volatile unsigned int*)(0x42310608UL)))
#define bM4_TMR63_SCMCR_SCMC3                     (*((volatile unsigned int*)(0x4231060CUL)))
#define bM4_TMR63_SCMCR_SCMC4                     (*((volatile unsigned int*)(0x42310610UL)))
#define bM4_TMR63_SCMCR_SCMC5                     (*((volatile unsigned int*)(0x42310614UL)))
#define bM4_TMR63_SCMCR_SCMC6                     (*((volatile unsigned int*)(0x42310618UL)))
#define bM4_TMR63_SCMCR_SCMC7                     (*((volatile unsigned int*)(0x4231061CUL)))
#define bM4_TMR63_SCMCR_SCMC8                     (*((volatile unsigned int*)(0x42310620UL)))
#define bM4_TMR63_SCMCR_SCMC9                     (*((volatile unsigned int*)(0x42310624UL)))
#define bM4_TMR63_SCMCR_SCMC10                    (*((volatile unsigned int*)(0x42310628UL)))
#define bM4_TMR63_SCMCR_SCMC11                    (*((volatile unsigned int*)(0x4231062CUL)))
#define bM4_TMR63_SCMCR_SCMC12                    (*((volatile unsigned int*)(0x42310630UL)))
#define bM4_TMR63_SCMCR_SCMC13                    (*((volatile unsigned int*)(0x42310634UL)))
#define bM4_TMR63_SCMCR_SCMC14                    (*((volatile unsigned int*)(0x42310638UL)))
#define bM4_TMR63_SCMCR_SCMC15                    (*((volatile unsigned int*)(0x4231063CUL)))
#define bM4_TMR63_SCMDR_SCMD0                     (*((volatile unsigned int*)(0x42310680UL)))
#define bM4_TMR63_SCMDR_SCMD1                     (*((volatile unsigned int*)(0x42310684UL)))
#define bM4_TMR63_SCMDR_SCMD2                     (*((volatile unsigned int*)(0x42310688UL)))
#define bM4_TMR63_SCMDR_SCMD3                     (*((volatile unsigned int*)(0x4231068CUL)))
#define bM4_TMR63_SCMDR_SCMD4                     (*((volatile unsigned int*)(0x42310690UL)))
#define bM4_TMR63_SCMDR_SCMD5                     (*((volatile unsigned int*)(0x42310694UL)))
#define bM4_TMR63_SCMDR_SCMD6                     (*((volatile unsigned int*)(0x42310698UL)))
#define bM4_TMR63_SCMDR_SCMD7                     (*((volatile unsigned int*)(0x4231069CUL)))
#define bM4_TMR63_SCMDR_SCMD8                     (*((volatile unsigned int*)(0x423106A0UL)))
#define bM4_TMR63_SCMDR_SCMD9                     (*((volatile unsigned int*)(0x423106A4UL)))
#define bM4_TMR63_SCMDR_SCMD10                    (*((volatile unsigned int*)(0x423106A8UL)))
#define bM4_TMR63_SCMDR_SCMD11                    (*((volatile unsigned int*)(0x423106ACUL)))
#define bM4_TMR63_SCMDR_SCMD12                    (*((volatile unsigned int*)(0x423106B0UL)))
#define bM4_TMR63_SCMDR_SCMD13                    (*((volatile unsigned int*)(0x423106B4UL)))
#define bM4_TMR63_SCMDR_SCMD14                    (*((volatile unsigned int*)(0x423106B8UL)))
#define bM4_TMR63_SCMDR_SCMD15                    (*((volatile unsigned int*)(0x423106BCUL)))
#define bM4_TMR63_SCMER_SCME0                     (*((volatile unsigned int*)(0x42310700UL)))
#define bM4_TMR63_SCMER_SCME1                     (*((volatile unsigned int*)(0x42310704UL)))
#define bM4_TMR63_SCMER_SCME2                     (*((volatile unsigned int*)(0x42310708UL)))
#define bM4_TMR63_SCMER_SCME3                     (*((volatile unsigned int*)(0x4231070CUL)))
#define bM4_TMR63_SCMER_SCME4                     (*((volatile unsigned int*)(0x42310710UL)))
#define bM4_TMR63_SCMER_SCME5                     (*((volatile unsigned int*)(0x42310714UL)))
#define bM4_TMR63_SCMER_SCME6                     (*((volatile unsigned int*)(0x42310718UL)))
#define bM4_TMR63_SCMER_SCME7                     (*((volatile unsigned int*)(0x4231071CUL)))
#define bM4_TMR63_SCMER_SCME8                     (*((volatile unsigned int*)(0x42310720UL)))
#define bM4_TMR63_SCMER_SCME9                     (*((volatile unsigned int*)(0x42310724UL)))
#define bM4_TMR63_SCMER_SCME10                    (*((volatile unsigned int*)(0x42310728UL)))
#define bM4_TMR63_SCMER_SCME11                    (*((volatile unsigned int*)(0x4231072CUL)))
#define bM4_TMR63_SCMER_SCME12                    (*((volatile unsigned int*)(0x42310730UL)))
#define bM4_TMR63_SCMER_SCME13                    (*((volatile unsigned int*)(0x42310734UL)))
#define bM4_TMR63_SCMER_SCME14                    (*((volatile unsigned int*)(0x42310738UL)))
#define bM4_TMR63_SCMER_SCME15                    (*((volatile unsigned int*)(0x4231073CUL)))
#define bM4_TMR63_SCMFR_SCMF0                     (*((volatile unsigned int*)(0x42310780UL)))
#define bM4_TMR63_SCMFR_SCMF1                     (*((volatile unsigned int*)(0x42310784UL)))
#define bM4_TMR63_SCMFR_SCMF2                     (*((volatile unsigned int*)(0x42310788UL)))
#define bM4_TMR63_SCMFR_SCMF3                     (*((volatile unsigned int*)(0x4231078CUL)))
#define bM4_TMR63_SCMFR_SCMF4                     (*((volatile unsigned int*)(0x42310790UL)))
#define bM4_TMR63_SCMFR_SCMF5                     (*((volatile unsigned int*)(0x42310794UL)))
#define bM4_TMR63_SCMFR_SCMF6                     (*((volatile unsigned int*)(0x42310798UL)))
#define bM4_TMR63_SCMFR_SCMF7                     (*((volatile unsigned int*)(0x4231079CUL)))
#define bM4_TMR63_SCMFR_SCMF8                     (*((volatile unsigned int*)(0x423107A0UL)))
#define bM4_TMR63_SCMFR_SCMF9                     (*((volatile unsigned int*)(0x423107A4UL)))
#define bM4_TMR63_SCMFR_SCMF10                    (*((volatile unsigned int*)(0x423107A8UL)))
#define bM4_TMR63_SCMFR_SCMF11                    (*((volatile unsigned int*)(0x423107ACUL)))
#define bM4_TMR63_SCMFR_SCMF12                    (*((volatile unsigned int*)(0x423107B0UL)))
#define bM4_TMR63_SCMFR_SCMF13                    (*((volatile unsigned int*)(0x423107B4UL)))
#define bM4_TMR63_SCMFR_SCMF14                    (*((volatile unsigned int*)(0x423107B8UL)))
#define bM4_TMR63_SCMFR_SCMF15                    (*((volatile unsigned int*)(0x423107BCUL)))
#define bM4_TMR63_DTUAR_DTUA0                     (*((volatile unsigned int*)(0x42310800UL)))
#define bM4_TMR63_DTUAR_DTUA1                     (*((volatile unsigned int*)(0x42310804UL)))
#define bM4_TMR63_DTUAR_DTUA2                     (*((volatile unsigned int*)(0x42310808UL)))
#define bM4_TMR63_DTUAR_DTUA3                     (*((volatile unsigned int*)(0x4231080CUL)))
#define bM4_TMR63_DTUAR_DTUA4                     (*((volatile unsigned int*)(0x42310810UL)))
#define bM4_TMR63_DTUAR_DTUA5                     (*((volatile unsigned int*)(0x42310814UL)))
#define bM4_TMR63_DTUAR_DTUA6                     (*((volatile unsigned int*)(0x42310818UL)))
#define bM4_TMR63_DTUAR_DTUA7                     (*((volatile unsigned int*)(0x4231081CUL)))
#define bM4_TMR63_DTUAR_DTUA8                     (*((volatile unsigned int*)(0x42310820UL)))
#define bM4_TMR63_DTUAR_DTUA9                     (*((volatile unsigned int*)(0x42310824UL)))
#define bM4_TMR63_DTUAR_DTUA10                    (*((volatile unsigned int*)(0x42310828UL)))
#define bM4_TMR63_DTUAR_DTUA11                    (*((volatile unsigned int*)(0x4231082CUL)))
#define bM4_TMR63_DTUAR_DTUA12                    (*((volatile unsigned int*)(0x42310830UL)))
#define bM4_TMR63_DTUAR_DTUA13                    (*((volatile unsigned int*)(0x42310834UL)))
#define bM4_TMR63_DTUAR_DTUA14                    (*((volatile unsigned int*)(0x42310838UL)))
#define bM4_TMR63_DTUAR_DTUA15                    (*((volatile unsigned int*)(0x4231083CUL)))
#define bM4_TMR63_DTDAR_DTDA0                     (*((volatile unsigned int*)(0x42310880UL)))
#define bM4_TMR63_DTDAR_DTDA1                     (*((volatile unsigned int*)(0x42310884UL)))
#define bM4_TMR63_DTDAR_DTDA2                     (*((volatile unsigned int*)(0x42310888UL)))
#define bM4_TMR63_DTDAR_DTDA3                     (*((volatile unsigned int*)(0x4231088CUL)))
#define bM4_TMR63_DTDAR_DTDA4                     (*((volatile unsigned int*)(0x42310890UL)))
#define bM4_TMR63_DTDAR_DTDA5                     (*((volatile unsigned int*)(0x42310894UL)))
#define bM4_TMR63_DTDAR_DTDA6                     (*((volatile unsigned int*)(0x42310898UL)))
#define bM4_TMR63_DTDAR_DTDA7                     (*((volatile unsigned int*)(0x4231089CUL)))
#define bM4_TMR63_DTDAR_DTDA8                     (*((volatile unsigned int*)(0x423108A0UL)))
#define bM4_TMR63_DTDAR_DTDA9                     (*((volatile unsigned int*)(0x423108A4UL)))
#define bM4_TMR63_DTDAR_DTDA10                    (*((volatile unsigned int*)(0x423108A8UL)))
#define bM4_TMR63_DTDAR_DTDA11                    (*((volatile unsigned int*)(0x423108ACUL)))
#define bM4_TMR63_DTDAR_DTDA12                    (*((volatile unsigned int*)(0x423108B0UL)))
#define bM4_TMR63_DTDAR_DTDA13                    (*((volatile unsigned int*)(0x423108B4UL)))
#define bM4_TMR63_DTDAR_DTDA14                    (*((volatile unsigned int*)(0x423108B8UL)))
#define bM4_TMR63_DTDAR_DTDA15                    (*((volatile unsigned int*)(0x423108BCUL)))
#define bM4_TMR63_DTUBR_DTUB0                     (*((volatile unsigned int*)(0x42310900UL)))
#define bM4_TMR63_DTUBR_DTUB1                     (*((volatile unsigned int*)(0x42310904UL)))
#define bM4_TMR63_DTUBR_DTUB2                     (*((volatile unsigned int*)(0x42310908UL)))
#define bM4_TMR63_DTUBR_DTUB3                     (*((volatile unsigned int*)(0x4231090CUL)))
#define bM4_TMR63_DTUBR_DTUB4                     (*((volatile unsigned int*)(0x42310910UL)))
#define bM4_TMR63_DTUBR_DTUB5                     (*((volatile unsigned int*)(0x42310914UL)))
#define bM4_TMR63_DTUBR_DTUB6                     (*((volatile unsigned int*)(0x42310918UL)))
#define bM4_TMR63_DTUBR_DTUB7                     (*((volatile unsigned int*)(0x4231091CUL)))
#define bM4_TMR63_DTUBR_DTUB8                     (*((volatile unsigned int*)(0x42310920UL)))
#define bM4_TMR63_DTUBR_DTUB9                     (*((volatile unsigned int*)(0x42310924UL)))
#define bM4_TMR63_DTUBR_DTUB10                    (*((volatile unsigned int*)(0x42310928UL)))
#define bM4_TMR63_DTUBR_DTUB11                    (*((volatile unsigned int*)(0x4231092CUL)))
#define bM4_TMR63_DTUBR_DTUB12                    (*((volatile unsigned int*)(0x42310930UL)))
#define bM4_TMR63_DTUBR_DTUB13                    (*((volatile unsigned int*)(0x42310934UL)))
#define bM4_TMR63_DTUBR_DTUB14                    (*((volatile unsigned int*)(0x42310938UL)))
#define bM4_TMR63_DTUBR_DTUB15                    (*((volatile unsigned int*)(0x4231093CUL)))
#define bM4_TMR63_DTDBR_DTDB0                     (*((volatile unsigned int*)(0x42310980UL)))
#define bM4_TMR63_DTDBR_DTDB1                     (*((volatile unsigned int*)(0x42310984UL)))
#define bM4_TMR63_DTDBR_DTDB2                     (*((volatile unsigned int*)(0x42310988UL)))
#define bM4_TMR63_DTDBR_DTDB3                     (*((volatile unsigned int*)(0x4231098CUL)))
#define bM4_TMR63_DTDBR_DTDB4                     (*((volatile unsigned int*)(0x42310990UL)))
#define bM4_TMR63_DTDBR_DTDB5                     (*((volatile unsigned int*)(0x42310994UL)))
#define bM4_TMR63_DTDBR_DTDB6                     (*((volatile unsigned int*)(0x42310998UL)))
#define bM4_TMR63_DTDBR_DTDB7                     (*((volatile unsigned int*)(0x4231099CUL)))
#define bM4_TMR63_DTDBR_DTDB8                     (*((volatile unsigned int*)(0x423109A0UL)))
#define bM4_TMR63_DTDBR_DTDB9                     (*((volatile unsigned int*)(0x423109A4UL)))
#define bM4_TMR63_DTDBR_DTDB10                    (*((volatile unsigned int*)(0x423109A8UL)))
#define bM4_TMR63_DTDBR_DTDB11                    (*((volatile unsigned int*)(0x423109ACUL)))
#define bM4_TMR63_DTDBR_DTDB12                    (*((volatile unsigned int*)(0x423109B0UL)))
#define bM4_TMR63_DTDBR_DTDB13                    (*((volatile unsigned int*)(0x423109B4UL)))
#define bM4_TMR63_DTDBR_DTDB14                    (*((volatile unsigned int*)(0x423109B8UL)))
#define bM4_TMR63_DTDBR_DTDB15                    (*((volatile unsigned int*)(0x423109BCUL)))
#define bM4_TMR63_GCONR_START                     (*((volatile unsigned int*)(0x42310A00UL)))
#define bM4_TMR63_GCONR_MODE0                     (*((volatile unsigned int*)(0x42310A04UL)))
#define bM4_TMR63_GCONR_MODE1                     (*((volatile unsigned int*)(0x42310A08UL)))
#define bM4_TMR63_GCONR_MODE2                     (*((volatile unsigned int*)(0x42310A0CUL)))
#define bM4_TMR63_GCONR_CKDIV0                    (*((volatile unsigned int*)(0x42310A10UL)))
#define bM4_TMR63_GCONR_CKDIV1                    (*((volatile unsigned int*)(0x42310A14UL)))
#define bM4_TMR63_GCONR_CKDIV2                    (*((volatile unsigned int*)(0x42310A18UL)))
#define bM4_TMR63_GCONR_DIR                       (*((volatile unsigned int*)(0x42310A20UL)))
#define bM4_TMR63_GCONR_ZMSKREV                   (*((volatile unsigned int*)(0x42310A40UL)))
#define bM4_TMR63_GCONR_ZMSKPOS                   (*((volatile unsigned int*)(0x42310A44UL)))
#define bM4_TMR63_GCONR_ZMSKVAL0                  (*((volatile unsigned int*)(0x42310A48UL)))
#define bM4_TMR63_GCONR_ZMSKVAL1                  (*((volatile unsigned int*)(0x42310A4CUL)))
#define bM4_TMR63_ICONR_INTENA                    (*((volatile unsigned int*)(0x42310A80UL)))
#define bM4_TMR63_ICONR_INTENB                    (*((volatile unsigned int*)(0x42310A84UL)))
#define bM4_TMR63_ICONR_INTENC                    (*((volatile unsigned int*)(0x42310A88UL)))
#define bM4_TMR63_ICONR_INTEND                    (*((volatile unsigned int*)(0x42310A8CUL)))
#define bM4_TMR63_ICONR_INTENE                    (*((volatile unsigned int*)(0x42310A90UL)))
#define bM4_TMR63_ICONR_INTENF                    (*((volatile unsigned int*)(0x42310A94UL)))
#define bM4_TMR63_ICONR_INTENOVF                  (*((volatile unsigned int*)(0x42310A98UL)))
#define bM4_TMR63_ICONR_INTENUDF                  (*((volatile unsigned int*)(0x42310A9CUL)))
#define bM4_TMR63_ICONR_INTENDTE                  (*((volatile unsigned int*)(0x42310AA0UL)))
#define bM4_TMR63_ICONR_INTENSAU                  (*((volatile unsigned int*)(0x42310AC0UL)))
#define bM4_TMR63_ICONR_INTENSAD                  (*((volatile unsigned int*)(0x42310AC4UL)))
#define bM4_TMR63_ICONR_INTENSBU                  (*((volatile unsigned int*)(0x42310AC8UL)))
#define bM4_TMR63_ICONR_INTENSBD                  (*((volatile unsigned int*)(0x42310ACCUL)))
#define bM4_TMR63_PCONR_CAPMDA                    (*((volatile unsigned int*)(0x42310B00UL)))
#define bM4_TMR63_PCONR_STACA                     (*((volatile unsigned int*)(0x42310B04UL)))
#define bM4_TMR63_PCONR_STPCA                     (*((volatile unsigned int*)(0x42310B08UL)))
#define bM4_TMR63_PCONR_STASTPSA                  (*((volatile unsigned int*)(0x42310B0CUL)))
#define bM4_TMR63_PCONR_CMPCA0                    (*((volatile unsigned int*)(0x42310B10UL)))
#define bM4_TMR63_PCONR_CMPCA1                    (*((volatile unsigned int*)(0x42310B14UL)))
#define bM4_TMR63_PCONR_PERCA0                    (*((volatile unsigned int*)(0x42310B18UL)))
#define bM4_TMR63_PCONR_PERCA1                    (*((volatile unsigned int*)(0x42310B1CUL)))
