patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_TMR63_PCONR_OUTENA                    (*((volatile unsigned int*)(0x42310B20UL)))
#define bM4_TMR63_PCONR_EMBVALA0                  (*((volatile unsigned int*)(0x42310B2CUL)))
#define bM4_TMR63_PCONR_EMBVALA1                  (*((volatile unsigned int*)(0x42310B30UL)))
#define bM4_TMR63_PCONR_CAPMDB                    (*((volatile unsigned int*)(0x42310B40UL)))
#define bM4_TMR63_PCONR_STACB                     (*((volatile unsigned int*)(0x42310B44UL)))
#define bM4_TMR63_PCONR_STPCB                     (*((volatile unsigned int*)(0x42310B48UL)))
#define bM4_TMR63_PCONR_STASTPSB                  (*((volatile unsigned int*)(0x42310B4CUL)))
#define bM4_TMR63_PCONR_CMPCB0                    (*((volatile unsigned int*)(0x42310B50UL)))
#define bM4_TMR63_PCONR_CMPCB1                    (*((volatile unsigned int*)(0x42310B54UL)))
#define bM4_TMR63_PCONR_PERCB0                    (*((volatile unsigned int*)(0x42310B58UL)))
#define bM4_TMR63_PCONR_PERCB1                    (*((volatile unsigned int*)(0x42310B5CUL)))
#define bM4_TMR63_PCONR_OUTENB                    (*((volatile unsigned int*)(0x42310B60UL)))
#define bM4_TMR63_PCONR_EMBVALB0                  (*((volatile unsigned int*)(0x42310B6CUL)))
#define bM4_TMR63_PCONR_EMBVALB1                  (*((volatile unsigned int*)(0x42310B70UL)))
#define bM4_TMR63_BCONR_BENA                      (*((volatile unsigned int*)(0x42310B80UL)))
#define bM4_TMR63_BCONR_BSEA                      (*((volatile unsigned int*)(0x42310B84UL)))
#define bM4_TMR63_BCONR_BENB                      (*((volatile unsigned int*)(0x42310B88UL)))
#define bM4_TMR63_BCONR_BSEB                      (*((volatile unsigned int*)(0x42310B8CUL)))
#define bM4_TMR63_BCONR_BENP                      (*((volatile unsigned int*)(0x42310BA0UL)))
#define bM4_TMR63_BCONR_BSEP                      (*((volatile unsigned int*)(0x42310BA4UL)))
#define bM4_TMR63_BCONR_BENSPA                    (*((volatile unsigned int*)(0x42310BC0UL)))
#define bM4_TMR63_BCONR_BSESPA                    (*((volatile unsigned int*)(0x42310BC4UL)))
#define bM4_TMR63_BCONR_BTRSPA0                   (*((volatile unsigned int*)(0x42310BD0UL)))
#define bM4_TMR63_BCONR_BTRSPA1                   (*((volatile unsigned int*)(0x42310BD4UL)))
#define bM4_TMR63_BCONR_BENSPB                    (*((volatile unsigned int*)(0x42310BE0UL)))
#define bM4_TMR63_BCONR_BSESPB                    (*((volatile unsigned int*)(0x42310BE4UL)))
#define bM4_TMR63_BCONR_BTRSPB0                   (*((volatile unsigned int*)(0x42310BF0UL)))
#define bM4_TMR63_BCONR_BTRSPB1                   (*((volatile unsigned int*)(0x42310BF4UL)))
#define bM4_TMR63_DCONR_DTCEN                     (*((volatile unsigned int*)(0x42310C00UL)))
#define bM4_TMR63_DCONR_DTBENU                    (*((volatile unsigned int*)(0x42310C10UL)))
#define bM4_TMR63_DCONR_DTBEND                    (*((volatile unsigned int*)(0x42310C14UL)))
#define bM4_TMR63_DCONR_SEPA                      (*((volatile unsigned int*)(0x42310C20UL)))
#define bM4_TMR63_FCONR_NOFIENGA                  (*((volatile unsigned int*)(0x42310D00UL)))
#define bM4_TMR63_FCONR_NOFICKGA0                 (*((volatile unsigned int*)(0x42310D04UL)))
#define bM4_TMR63_FCONR_NOFICKGA1                 (*((volatile unsigned int*)(0x42310D08UL)))
#define bM4_TMR63_FCONR_NOFIENGB                  (*((volatile unsigned int*)(0x42310D10UL)))
#define bM4_TMR63_FCONR_NOFICKGB0                 (*((volatile unsigned int*)(0x42310D14UL)))
#define bM4_TMR63_FCONR_NOFICKGB1                 (*((volatile unsigned int*)(0x42310D18UL)))
#define bM4_TMR63_FCONR_NOFIENTA                  (*((volatile unsigned int*)(0x42310D40UL)))
#define bM4_TMR63_FCONR_NOFICKTA0                 (*((volatile unsigned int*)(0x42310D44UL)))
#define bM4_TMR63_FCONR_NOFICKTA1                 (*((volatile unsigned int*)(0x42310D48UL)))
#define bM4_TMR63_FCONR_NOFIENTB                  (*((volatile unsigned int*)(0x42310D50UL)))
#define bM4_TMR63_FCONR_NOFICKTB0                 (*((volatile unsigned int*)(0x42310D54UL)))
#define bM4_TMR63_FCONR_NOFICKTB1                 (*((volatile unsigned int*)(0x42310D58UL)))
#define bM4_TMR63_VPERR_SPPERIA                   (*((volatile unsigned int*)(0x42310DA0UL)))
#define bM4_TMR63_VPERR_SPPERIB                   (*((volatile unsigned int*)(0x42310DA4UL)))
#define bM4_TMR63_VPERR_PCNTE0                    (*((volatile unsigned int*)(0x42310DC0UL)))
#define bM4_TMR63_VPERR_PCNTE1                    (*((volatile unsigned int*)(0x42310DC4UL)))
#define bM4_TMR63_VPERR_PCNTS0                    (*((volatile unsigned int*)(0x42310DC8UL)))
#define bM4_TMR63_VPERR_PCNTS1                    (*((volatile unsigned int*)(0x42310DCCUL)))
#define bM4_TMR63_VPERR_PCNTS2                    (*((volatile unsigned int*)(0x42310DD0UL)))
#define bM4_TMR63_STFLR_CMAF                      (*((volatile unsigned int*)(0x42310E00UL)))
#define bM4_TMR63_STFLR_CMBF                      (*((volatile unsigned int*)(0x42310E04UL)))
#define bM4_TMR63_STFLR_CMCF                      (*((volatile unsigned int*)(0x42310E08UL)))
#define bM4_TMR63_STFLR_CMDF                      (*((volatile unsigned int*)(0x42310E0CUL)))
#define bM4_TMR63_STFLR_CMEF                      (*((volatile unsigned int*)(0x42310E10UL)))
#define bM4_TMR63_STFLR_CMFF                      (*((volatile unsigned int*)(0x42310E14UL)))
#define bM4_TMR63_STFLR_OVFF                      (*((volatile unsigned int*)(0x42310E18UL)))
#define bM4_TMR63_STFLR_UDFF                      (*((volatile unsigned int*)(0x42310E1CUL)))
#define bM4_TMR63_STFLR_DTEF                      (*((volatile unsigned int*)(0x42310E20UL)))
#define bM4_TMR63_STFLR_CMSAUF                    (*((volatile unsigned int*)(0x42310E24UL)))
#define bM4_TMR63_STFLR_CMSADF                    (*((volatile unsigned int*)(0x42310E28UL)))
#define bM4_TMR63_STFLR_CMSBUF                    (*((volatile unsigned int*)(0x42310E2CUL)))
#define bM4_TMR63_STFLR_CMSBDF                    (*((volatile unsigned int*)(0x42310E30UL)))
#define bM4_TMR63_STFLR_VPERNUM0                  (*((volatile unsigned int*)(0x42310E54UL)))
#define bM4_TMR63_STFLR_VPERNUM1                  (*((volatile unsigned int*)(0x42310E58UL)))
#define bM4_TMR63_STFLR_VPERNUM2                  (*((volatile unsigned int*)(0x42310E5CUL)))
#define bM4_TMR63_STFLR_DIRF                      (*((volatile unsigned int*)(0x42310E7CUL)))
#define bM4_TMR63_HSTAR_HSTA0                     (*((volatile unsigned int*)(0x42310E80UL)))
#define bM4_TMR63_HSTAR_HSTA1                     (*((volatile unsigned int*)(0x42310E84UL)))
#define bM4_TMR63_HSTAR_HSTA4                     (*((volatile unsigned int*)(0x42310E90UL)))
#define bM4_TMR63_HSTAR_HSTA5                     (*((volatile unsigned int*)(0x42310E94UL)))
#define bM4_TMR63_HSTAR_HSTA6                     (*((volatile unsigned int*)(0x42310E98UL)))
#define bM4_TMR63_HSTAR_HSTA7                     (*((volatile unsigned int*)(0x42310E9CUL)))
#define bM4_TMR63_HSTAR_HSTA8                     (*((volatile unsigned int*)(0x42310EA0UL)))
#define bM4_TMR63_HSTAR_HSTA9                     (*((volatile unsigned int*)(0x42310EA4UL)))
#define bM4_TMR63_HSTAR_HSTA10                    (*((volatile unsigned int*)(0x42310EA8UL)))
#define bM4_TMR63_HSTAR_HSTA11                    (*((volatile unsigned int*)(0x42310EACUL)))
#define bM4_TMR63_HSTAR_STARTS                    (*((volatile unsigned int*)(0x42310EFCUL)))
#define bM4_TMR63_HSTPR_HSTP0                     (*((volatile unsigned int*)(0x42310F00UL)))
#define bM4_TMR63_HSTPR_HSTP1                     (*((volatile unsigned int*)(0x42310F04UL)))
#define bM4_TMR63_HSTPR_HSTP4                     (*((volatile unsigned int*)(0x42310F10UL)))
#define bM4_TMR63_HSTPR_HSTP5                     (*((volatile unsigned int*)(0x42310F14UL)))
#define bM4_TMR63_HSTPR_HSTP6                     (*((volatile unsigned int*)(0x42310F18UL)))
#define bM4_TMR63_HSTPR_HSTP7                     (*((volatile unsigned int*)(0x42310F1CUL)))
#define bM4_TMR63_HSTPR_HSTP8                     (*((volatile unsigned int*)(0x42310F20UL)))
#define bM4_TMR63_HSTPR_HSTP9                     (*((volatile unsigned int*)(0x42310F24UL)))
#define bM4_TMR63_HSTPR_HSTP10                    (*((volatile unsigned int*)(0x42310F28UL)))
#define bM4_TMR63_HSTPR_HSTP11                    (*((volatile unsigned int*)(0x42310F2CUL)))
#define bM4_TMR63_HSTPR_STOPS                     (*((volatile unsigned int*)(0x42310F7CUL)))
#define bM4_TMR63_HCLRR_HCLE0                     (*((volatile unsigned int*)(0x42310F80UL)))
#define bM4_TMR63_HCLRR_HCLE1                     (*((volatile unsigned int*)(0x42310F84UL)))
#define bM4_TMR63_HCLRR_HCLE4                     (*((volatile unsigned int*)(0x42310F90UL)))
#define bM4_TMR63_HCLRR_HCLE5                     (*((volatile unsigned int*)(0x42310F94UL)))
#define bM4_TMR63_HCLRR_HCLE6                     (*((volatile unsigned int*)(0x42310F98UL)))
#define bM4_TMR63_HCLRR_HCLE7                     (*((volatile unsigned int*)(0x42310F9CUL)))
#define bM4_TMR63_HCLRR_HCLE8                     (*((volatile unsigned int*)(0x42310FA0UL)))
#define bM4_TMR63_HCLRR_HCLE9                     (*((volatile unsigned int*)(0x42310FA4UL)))
#define bM4_TMR63_HCLRR_HCLE10                    (*((volatile unsigned int*)(0x42310FA8UL)))
#define bM4_TMR63_HCLRR_HCLE11                    (*((volatile unsigned int*)(0x42310FACUL)))
#define bM4_TMR63_HCLRR_CLEARS                    (*((volatile unsigned int*)(0x42310FFCUL)))
#define bM4_TMR63_HCPAR_HCPA0                     (*((volatile unsigned int*)(0x42311000UL)))
#define bM4_TMR63_HCPAR_HCPA1                     (*((volatile unsigned int*)(0x42311004UL)))
#define bM4_TMR63_HCPAR_HCPA4                     (*((volatile unsigned int*)(0x42311010UL)))
#define bM4_TMR63_HCPAR_HCPA5                     (*((volatile unsigned int*)(0x42311014UL)))
#define bM4_TMR63_HCPAR_HCPA6                     (*((volatile unsigned int*)(0x42311018UL)))
#define bM4_TMR63_HCPAR_HCPA7                     (*((volatile unsigned int*)(0x4231101CUL)))
#define bM4_TMR63_HCPAR_HCPA8                     (*((volatile unsigned int*)(0x42311020UL)))
#define bM4_TMR63_HCPAR_HCPA9                     (*((volatile unsigned int*)(0x42311024UL)))
#define bM4_TMR63_HCPAR_HCPA10                    (*((volatile unsigned int*)(0x42311028UL)))
#define bM4_TMR63_HCPAR_HCPA11                    (*((volatile unsigned int*)(0x4231102CUL)))
#define bM4_TMR63_HCPBR_HCPB0                     (*((volatile unsigned int*)(0x42311080UL)))
#define bM4_TMR63_HCPBR_HCPB1                     (*((volatile unsigned int*)(0x42311084UL)))
#define bM4_TMR63_HCPBR_HCPB4                     (*((volatile unsigned int*)(0x42311090UL)))
#define bM4_TMR63_HCPBR_HCPB5                     (*((volatile unsigned int*)(0x42311094UL)))
#define bM4_TMR63_HCPBR_HCPB6                     (*((volatile unsigned int*)(0x42311098UL)))
#define bM4_TMR63_HCPBR_HCPB7                     (*((volatile unsigned int*)(0x4231109CUL)))
#define bM4_TMR63_HCPBR_HCPB8                     (*((volatile unsigned int*)(0x423110A0UL)))
#define bM4_TMR63_HCPBR_HCPB9                     (*((volatile unsigned int*)(0x423110A4UL)))
#define bM4_TMR63_HCPBR_HCPB10                    (*((volatile unsigned int*)(0x423110A8UL)))
#define bM4_TMR63_HCPBR_HCPB11                    (*((volatile unsigned int*)(0x423110ACUL)))
#define bM4_TMR63_HCUPR_HCUP0                     (*((volatile unsigned int*)(0x42311100UL)))
#define bM4_TMR63_HCUPR_HCUP1                     (*((volatile unsigned int*)(0x42311104UL)))
#define bM4_TMR63_HCUPR_HCUP2                     (*((volatile unsigned int*)(0x42311108UL)))
#define bM4_TMR63_HCUPR_HCUP3                     (*((volatile unsigned int*)(0x4231110CUL)))
#define bM4_TMR63_HCUPR_HCUP4                     (*((volatile unsigned int*)(0x42311110UL)))
#define bM4_TMR63_HCUPR_HCUP5                     (*((volatile unsigned int*)(0x42311114UL)))
#define bM4_TMR63_HCUPR_HCUP6                     (*((volatile unsigned int*)(0x42311118UL)))
#define bM4_TMR63_HCUPR_HCUP7                     (*((volatile unsigned int*)(0x4231111CUL)))
#define bM4_TMR63_HCUPR_HCUP8                     (*((volatile unsigned int*)(0x42311120UL)))
#define bM4_TMR63_HCUPR_HCUP9                     (*((volatile unsigned int*)(0x42311124UL)))
#define bM4_TMR63_HCUPR_HCUP10                    (*((volatile unsigned int*)(0x42311128UL)))
#define bM4_TMR63_HCUPR_HCUP11                    (*((volatile unsigned int*)(0x4231112CUL)))
#define bM4_TMR63_HCUPR_HCUP16                    (*((volatile unsigned int*)(0x42311140UL)))
#define bM4_TMR63_HCUPR_HCUP17                    (*((volatile unsigned int*)(0x42311144UL)))
#define bM4_TMR63_HCDOR_HCDO0                     (*((volatile unsigned int*)(0x42311180UL)))
#define bM4_TMR63_HCDOR_HCDO1                     (*((volatile unsigned int*)(0x42311184UL)))
#define bM4_TMR63_HCDOR_HCDO2                     (*((volatile unsigned int*)(0x42311188UL)))
#define bM4_TMR63_HCDOR_HCDO3                     (*((volatile unsigned int*)(0x4231118CUL)))
#define bM4_TMR63_HCDOR_HCDO4                     (*((volatile unsigned int*)(0x42311190UL)))
#define bM4_TMR63_HCDOR_HCDO5                     (*((volatile unsigned int*)(0x42311194UL)))
#define bM4_TMR63_HCDOR_HCDO6                     (*((volatile unsigned int*)(0x42311198UL)))
#define bM4_TMR63_HCDOR_HCDO7                     (*((volatile unsigned int*)(0x4231119CUL)))
#define bM4_TMR63_HCDOR_HCDO8                     (*((volatile unsigned int*)(0x423111A0UL)))
#define bM4_TMR63_HCDOR_HCDO9                     (*((volatile unsigned int*)(0x423111A4UL)))
#define bM4_TMR63_HCDOR_HCDO10                    (*((volatile unsigned int*)(0x423111A8UL)))
#define bM4_TMR63_HCDOR_HCDO11                    (*((volatile unsigned int*)(0x423111ACUL)))
#define bM4_TMR63_HCDOR_HCDO16                    (*((volatile unsigned int*)(0x423111C0UL)))
#define bM4_TMR63_HCDOR_HCDO17                    (*((volatile unsigned int*)(0x423111C4UL)))
#define bM4_TMR6_CR_SSTAR_SSTA1                   (*((volatile unsigned int*)(0x42307E80UL)))
#define bM4_TMR6_CR_SSTAR_SSTA2                   (*((volatile unsigned int*)(0x42307E84UL)))
#define bM4_TMR6_CR_SSTAR_SSTA3                   (*((volatile unsigned int*)(0x42307E88UL)))
#define bM4_TMR6_CR_SSTAR_RESV0                   (*((volatile unsigned int*)(0x42307EC0UL)))
#define bM4_TMR6_CR_SSTAR_RESV                    (*((volatile unsigned int*)(0x42307EE0UL)))
#define bM4_TMR6_CR_SSTPR_SSTP1                   (*((volatile unsigned int*)(0x42307F00UL)))
#define bM4_TMR6_CR_SSTPR_SSTP2                   (*((volatile unsigned int*)(0x42307F04UL)))
#define bM4_TMR6_CR_SSTPR_SSTP3                   (*((volatile unsigned int*)(0x42307F08UL)))
#define bM4_TMR6_CR_SCLRR_SCLE1                   (*((volatile unsigned int*)(0x42307F80UL)))
#define bM4_TMR6_CR_SCLRR_SCLE2                   (*((volatile unsigned int*)(0x42307F84UL)))
#define bM4_TMR6_CR_SCLRR_SCLE3                   (*((volatile unsigned int*)(0x42307F88UL)))
#define bM4_TMRA1_CNTER_CNT0                      (*((volatile unsigned int*)(0x422A0000UL)))
#define bM4_TMRA1_CNTER_CNT1                      (*((volatile unsigned int*)(0x422A0004UL)))
#define bM4_TMRA1_CNTER_CNT2                      (*((volatile unsigned int*)(0x422A0008UL)))
#define bM4_TMRA1_CNTER_CNT3                      (*((volatile unsigned int*)(0x422A000CUL)))
#define bM4_TMRA1_CNTER_CNT4                      (*((volatile unsigned int*)(0x422A0010UL)))
#define bM4_TMRA1_CNTER_CNT5                      (*((volatile unsigned int*)(0x422A0014UL)))
#define bM4_TMRA1_CNTER_CNT6                      (*((volatile unsigned int*)(0x422A0018UL)))
#define bM4_TMRA1_CNTER_CNT7                      (*((volatile unsigned int*)(0x422A001CUL)))
#define bM4_TMRA1_CNTER_CNT8                      (*((volatile unsigned int*)(0x422A0020UL)))
#define bM4_TMRA1_CNTER_CNT9                      (*((volatile unsigned int*)(0x422A0024UL)))
#define bM4_TMRA1_CNTER_CNT10                     (*((volatile unsigned int*)(0x422A0028UL)))
#define bM4_TMRA1_CNTER_CNT11                     (*((volatile unsigned int*)(0x422A002CUL)))
#define bM4_TMRA1_CNTER_CNT12                     (*((volatile unsigned int*)(0x422A0030UL)))
#define bM4_TMRA1_CNTER_CNT13                     (*((volatile unsigned int*)(0x422A0034UL)))
#define bM4_TMRA1_CNTER_CNT14                     (*((volatile unsigned int*)(0x422A0038UL)))
#define bM4_TMRA1_CNTER_CNT15                     (*((volatile unsigned int*)(0x422A003CUL)))
#define bM4_TMRA1_PERAR_PER0                      (*((volatile unsigned int*)(0x422A0080UL)))
#define bM4_TMRA1_PERAR_PER1                      (*((volatile unsigned int*)(0x422A0084UL)))
#define bM4_TMRA1_PERAR_PER2                      (*((volatile unsigned int*)(0x422A0088UL)))
#define bM4_TMRA1_PERAR_PER3                      (*((volatile unsigned int*)(0x422A008CUL)))
#define bM4_TMRA1_PERAR_PER4                      (*((volatile unsigned int*)(0x422A0090UL)))
#define bM4_TMRA1_PERAR_PER5                      (*((volatile unsigned int*)(0x422A0094UL)))
#define bM4_TMRA1_PERAR_PER6                      (*((volatile unsigned int*)(0x422A0098UL)))
#define bM4_TMRA1_PERAR_PER7                      (*((volatile unsigned int*)(0x422A009CUL)))
#define bM4_TMRA1_PERAR_PER8                      (*((volatile unsigned int*)(0x422A00A0UL)))
#define bM4_TMRA1_PERAR_PER9                      (*((volatile unsigned int*)(0x422A00A4UL)))
#define bM4_TMRA1_PERAR_PER10                     (*((volatile unsigned int*)(0x422A00A8UL)))
#define bM4_TMRA1_PERAR_PER11                     (*((volatile unsigned int*)(0x422A00ACUL)))
#define bM4_TMRA1_PERAR_PER12                     (*((volatile unsigned int*)(0x422A00B0UL)))
#define bM4_TMRA1_PERAR_PER13                     (*((volatile unsigned int*)(0x422A00B4UL)))
#define bM4_TMRA1_PERAR_PER14                     (*((volatile unsigned int*)(0x422A00B8UL)))
#define bM4_TMRA1_PERAR_PER15                     (*((volatile unsigned int*)(0x422A00BCUL)))
#define bM4_TMRA1_CMPAR1_CMP0                     (*((volatile unsigned int*)(0x422A0800UL)))
#define bM4_TMRA1_CMPAR1_CMP1                     (*((volatile unsigned int*)(0x422A0804UL)))
#define bM4_TMRA1_CMPAR1_CMP2                     (*((volatile unsigned int*)(0x422A0808UL)))
#define bM4_TMRA1_CMPAR1_CMP3                     (*((volatile unsigned int*)(0x422A080CUL)))
#define bM4_TMRA1_CMPAR1_CMP4                     (*((volatile unsigned int*)(0x422A0810UL)))
#define bM4_TMRA1_CMPAR1_CMP5                     (*((volatile unsigned int*)(0x422A0814UL)))
#define bM4_TMRA1_CMPAR1_CMP6                     (*((volatile unsigned int*)(0x422A0818UL)))
#define bM4_TMRA1_CMPAR1_CMP7                     (*((volatile unsigned int*)(0x422A081CUL)))
#define bM4_TMRA1_CMPAR1_CMP8                     (*((volatile unsigned int*)(0x422A0820UL)))
#define bM4_TMRA1_CMPAR1_CMP9                     (*((volatile unsigned int*)(0x422A0824UL)))
#define bM4_TMRA1_CMPAR1_CMP10                    (*((volatile unsigned int*)(0x422A0828UL)))
#define bM4_TMRA1_CMPAR1_CMP11                    (*((volatile unsigned int*)(0x422A082CUL)))
#define bM4_TMRA1_CMPAR1_CMP12                    (*((volatile unsigned int*)(0x422A0830UL)))
#define bM4_TMRA1_CMPAR1_CMP13                    (*((volatile unsigned int*)(0x422A0834UL)))
#define bM4_TMRA1_CMPAR1_CMP14                    (*((volatile unsigned int*)(0x422A0838UL)))
#define bM4_TMRA1_CMPAR1_CMP15                    (*((volatile unsigned int*)(0x422A083CUL)))
#define bM4_TMRA1_CMPAR2_CMP0                     (*((volatile unsigned int*)(0x422A0880UL)))
#define bM4_TMRA1_CMPAR2_CMP1                     (*((volatile unsigned int*)(0x422A0884UL)))
#define bM4_TMRA1_CMPAR2_CMP2                     (*((volatile unsigned int*)(0x422A0888UL)))
#define bM4_TMRA1_CMPAR2_CMP3                     (*((volatile unsigned int*)(0x422A088CUL)))
#define bM4_TMRA1_CMPAR2_CMP4                     (*((volatile unsigned int*)(0x422A0890UL)))
#define bM4_TMRA1_CMPAR2_CMP5                     (*((volatile unsigned int*)(0x422A0894UL)))
#define bM4_TMRA1_CMPAR2_CMP6                     (*((volatile unsigned int*)(0x422A0898UL)))
#define bM4_TMRA1_CMPAR2_CMP7                     (*((volatile unsigned int*)(0x422A089CUL)))
#define bM4_TMRA1_CMPAR2_CMP8                     (*((volatile unsigned int*)(0x422A08A0UL)))
#define bM4_TMRA1_CMPAR2_CMP9                     (*((volatile unsigned int*)(0x422A08A4UL)))
#define bM4_TMRA1_CMPAR2_CMP10                    (*((volatile unsigned int*)(0x422A08A8UL)))
#define bM4_TMRA1_CMPAR2_CMP11                    (*((volatile unsigned int*)(0x422A08ACUL)))
#define bM4_TMRA1_CMPAR2_CMP12                    (*((volatile unsigned int*)(0x422A08B0UL)))
#define bM4_TMRA1_CMPAR2_CMP13                    (*((volatile unsigned int*)(0x422A08B4UL)))
#define bM4_TMRA1_CMPAR2_CMP14                    (*((volatile unsigned int*)(0x422A08B8UL)))
#define bM4_TMRA1_CMPAR2_CMP15                    (*((volatile unsigned int*)(0x422A08BCUL)))
#define bM4_TMRA1_CMPAR3_CMP0                     (*((volatile unsigned int*)(0x422A0900UL)))
#define bM4_TMRA1_CMPAR3_CMP1                     (*((volatile unsigned int*)(0x422A0904UL)))
#define bM4_TMRA1_CMPAR3_CMP2                     (*((volatile unsigned int*)(0x422A0908UL)))
#define bM4_TMRA1_CMPAR3_CMP3                     (*((volatile unsigned int*)(0x422A090CUL)))
#define bM4_TMRA1_CMPAR3_CMP4                     (*((volatile unsigned int*)(0x422A0910UL)))
#define bM4_TMRA1_CMPAR3_CMP5                     (*((volatile unsigned int*)(0x422A0914UL)))
#define bM4_TMRA1_CMPAR3_CMP6                     (*((volatile unsigned int*)(0x422A0918UL)))
#define bM4_TMRA1_CMPAR3_CMP7                     (*((volatile unsigned int*)(0x422A091CUL)))
#define bM4_TMRA1_CMPAR3_CMP8                     (*((volatile unsigned int*)(0x422A0920UL)))
#define bM4_TMRA1_CMPAR3_CMP9                     (*((volatile unsigned int*)(0x422A0924UL)))
#define bM4_TMRA1_CMPAR3_CMP10                    (*((volatile unsigned int*)(0x422A0928UL)))
#define bM4_TMRA1_CMPAR3_CMP11                    (*((volatile unsigned int*)(0x422A092CUL)))
#define bM4_TMRA1_CMPAR3_CMP12                    (*((volatile unsigned int*)(0x422A0930UL)))
#define bM4_TMRA1_CMPAR3_CMP13                    (*((volatile unsigned int*)(0x422A0934UL)))
#define bM4_TMRA1_CMPAR3_CMP14                    (*((volatile unsigned int*)(0x422A0938UL)))
#define bM4_TMRA1_CMPAR3_CMP15                    (*((volatile unsigned int*)(0x422A093CUL)))
#define bM4_TMRA1_CMPAR4_CMP0                     (*((volatile unsigned int*)(0x422A0980UL)))
#define bM4_TMRA1_CMPAR4_CMP1                     (*((volatile unsigned int*)(0x422A0984UL)))
#define bM4_TMRA1_CMPAR4_CMP2                     (*((volatile unsigned int*)(0x422A0988UL)))
#define bM4_TMRA1_CMPAR4_CMP3                     (*((volatile unsigned int*)(0x422A098CUL)))
#define bM4_TMRA1_CMPAR4_CMP4                     (*((volatile unsigned int*)(0x422A0990UL)))
#define bM4_TMRA1_CMPAR4_CMP5                     (*((volatile unsigned int*)(0x422A0994UL)))
#define bM4_TMRA1_CMPAR4_CMP6                     (*((volatile unsigned int*)(0x422A0998UL)))
#define bM4_TMRA1_CMPAR4_CMP7                     (*((volatile unsigned int*)(0x422A099CUL)))
#define bM4_TMRA1_CMPAR4_CMP8                     (*((volatile unsigned int*)(0x422A09A0UL)))
#define bM4_TMRA1_CMPAR4_CMP9                     (*((volatile unsigned int*)(0x422A09A4UL)))
#define bM4_TMRA1_CMPAR4_CMP10                    (*((volatile unsigned int*)(0x422A09A8UL)))
#define bM4_TMRA1_CMPAR4_CMP11                    (*((volatile unsigned int*)(0x422A09ACUL)))
#define bM4_TMRA1_CMPAR4_CMP12                    (*((volatile unsigned int*)(0x422A09B0UL)))
#define bM4_TMRA1_CMPAR4_CMP13                    (*((volatile unsigned int*)(0x422A09B4UL)))
#define bM4_TMRA1_CMPAR4_CMP14                    (*((volatile unsigned int*)(0x422A09B8UL)))
