patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_TMRA4_CMPAR6_CMP10                    (*((volatile unsigned int*)(0x422B8AA8UL)))
#define bM4_TMRA4_CMPAR6_CMP11                    (*((volatile unsigned int*)(0x422B8AACUL)))
#define bM4_TMRA4_CMPAR6_CMP12                    (*((volatile unsigned int*)(0x422B8AB0UL)))
#define bM4_TMRA4_CMPAR6_CMP13                    (*((volatile unsigned int*)(0x422B8AB4UL)))
#define bM4_TMRA4_CMPAR6_CMP14                    (*((volatile unsigned int*)(0x422B8AB8UL)))
#define bM4_TMRA4_CMPAR6_CMP15                    (*((volatile unsigned int*)(0x422B8ABCUL)))
#define bM4_TMRA4_CMPAR7_CMP0                     (*((volatile unsigned int*)(0x422B8B00UL)))
#define bM4_TMRA4_CMPAR7_CMP1                     (*((volatile unsigned int*)(0x422B8B04UL)))
#define bM4_TMRA4_CMPAR7_CMP2                     (*((volatile unsigned int*)(0x422B8B08UL)))
#define bM4_TMRA4_CMPAR7_CMP3                     (*((volatile unsigned int*)(0x422B8B0CUL)))
#define bM4_TMRA4_CMPAR7_CMP4                     (*((volatile unsigned int*)(0x422B8B10UL)))
#define bM4_TMRA4_CMPAR7_CMP5                     (*((volatile unsigned int*)(0x422B8B14UL)))
#define bM4_TMRA4_CMPAR7_CMP6                     (*((volatile unsigned int*)(0x422B8B18UL)))
#define bM4_TMRA4_CMPAR7_CMP7                     (*((volatile unsigned int*)(0x422B8B1CUL)))
#define bM4_TMRA4_CMPAR7_CMP8                     (*((volatile unsigned int*)(0x422B8B20UL)))
#define bM4_TMRA4_CMPAR7_CMP9                     (*((volatile unsigned int*)(0x422B8B24UL)))
#define bM4_TMRA4_CMPAR7_CMP10                    (*((volatile unsigned int*)(0x422B8B28UL)))
#define bM4_TMRA4_CMPAR7_CMP11                    (*((volatile unsigned int*)(0x422B8B2CUL)))
#define bM4_TMRA4_CMPAR7_CMP12                    (*((volatile unsigned int*)(0x422B8B30UL)))
#define bM4_TMRA4_CMPAR7_CMP13                    (*((volatile unsigned int*)(0x422B8B34UL)))
#define bM4_TMRA4_CMPAR7_CMP14                    (*((volatile unsigned int*)(0x422B8B38UL)))
#define bM4_TMRA4_CMPAR7_CMP15                    (*((volatile unsigned int*)(0x422B8B3CUL)))
#define bM4_TMRA4_CMPAR8_CMP0                     (*((volatile unsigned int*)(0x422B8B80UL)))
#define bM4_TMRA4_CMPAR8_CMP1                     (*((volatile unsigned int*)(0x422B8B84UL)))
#define bM4_TMRA4_CMPAR8_CMP2                     (*((volatile unsigned int*)(0x422B8B88UL)))
#define bM4_TMRA4_CMPAR8_CMP3                     (*((volatile unsigned int*)(0x422B8B8CUL)))
#define bM4_TMRA4_CMPAR8_CMP4                     (*((volatile unsigned int*)(0x422B8B90UL)))
#define bM4_TMRA4_CMPAR8_CMP5                     (*((volatile unsigned int*)(0x422B8B94UL)))
#define bM4_TMRA4_CMPAR8_CMP6                     (*((volatile unsigned int*)(0x422B8B98UL)))
#define bM4_TMRA4_CMPAR8_CMP7                     (*((volatile unsigned int*)(0x422B8B9CUL)))
#define bM4_TMRA4_CMPAR8_CMP8                     (*((volatile unsigned int*)(0x422B8BA0UL)))
#define bM4_TMRA4_CMPAR8_CMP9                     (*((volatile unsigned int*)(0x422B8BA4UL)))
#define bM4_TMRA4_CMPAR8_CMP10                    (*((volatile unsigned int*)(0x422B8BA8UL)))
#define bM4_TMRA4_CMPAR8_CMP11                    (*((volatile unsigned int*)(0x422B8BACUL)))
#define bM4_TMRA4_CMPAR8_CMP12                    (*((volatile unsigned int*)(0x422B8BB0UL)))
#define bM4_TMRA4_CMPAR8_CMP13                    (*((volatile unsigned int*)(0x422B8BB4UL)))
#define bM4_TMRA4_CMPAR8_CMP14                    (*((volatile unsigned int*)(0x422B8BB8UL)))
#define bM4_TMRA4_CMPAR8_CMP15                    (*((volatile unsigned int*)(0x422B8BBCUL)))
#define bM4_TMRA4_BCSTR_START                     (*((volatile unsigned int*)(0x422B9000UL)))
#define bM4_TMRA4_BCSTR_DIR                       (*((volatile unsigned int*)(0x422B9004UL)))
#define bM4_TMRA4_BCSTR_MODE                      (*((volatile unsigned int*)(0x422B9008UL)))
#define bM4_TMRA4_BCSTR_SYNST                     (*((volatile unsigned int*)(0x422B900CUL)))
#define bM4_TMRA4_BCSTR_CKDIV0                    (*((volatile unsigned int*)(0x422B9010UL)))
#define bM4_TMRA4_BCSTR_CKDIV1                    (*((volatile unsigned int*)(0x422B9014UL)))
#define bM4_TMRA4_BCSTR_CKDIV2                    (*((volatile unsigned int*)(0x422B9018UL)))
#define bM4_TMRA4_BCSTR_CKDIV3                    (*((volatile unsigned int*)(0x422B901CUL)))
#define bM4_TMRA4_BCSTR_ITENOVF                   (*((volatile unsigned int*)(0x422B9030UL)))
#define bM4_TMRA4_BCSTR_ITENUDF                   (*((volatile unsigned int*)(0x422B9034UL)))
#define bM4_TMRA4_BCSTR_OVFF                      (*((volatile unsigned int*)(0x422B9038UL)))
#define bM4_TMRA4_BCSTR_UDFF                      (*((volatile unsigned int*)(0x422B903CUL)))
#define bM4_TMRA4_HCONR_HSTA0                     (*((volatile unsigned int*)(0x422B9080UL)))
#define bM4_TMRA4_HCONR_HSTA1                     (*((volatile unsigned int*)(0x422B9084UL)))
#define bM4_TMRA4_HCONR_HSTA2                     (*((volatile unsigned int*)(0x422B9088UL)))
#define bM4_TMRA4_HCONR_HSTP0                     (*((volatile unsigned int*)(0x422B9090UL)))
#define bM4_TMRA4_HCONR_HSTP1                     (*((volatile unsigned int*)(0x422B9094UL)))
#define bM4_TMRA4_HCONR_HSTP2                     (*((volatile unsigned int*)(0x422B9098UL)))
#define bM4_TMRA4_HCONR_HCLE0                     (*((volatile unsigned int*)(0x422B90A0UL)))
#define bM4_TMRA4_HCONR_HCLE1                     (*((volatile unsigned int*)(0x422B90A4UL)))
#define bM4_TMRA4_HCONR_HCLE2                     (*((volatile unsigned int*)(0x422B90A8UL)))
#define bM4_TMRA4_HCONR_HCLE3                     (*((volatile unsigned int*)(0x422B90B0UL)))
#define bM4_TMRA4_HCONR_HCLE4                     (*((volatile unsigned int*)(0x422B90B4UL)))
#define bM4_TMRA4_HCONR_HCLE5                     (*((volatile unsigned int*)(0x422B90B8UL)))
#define bM4_TMRA4_HCONR_HCLE6                     (*((volatile unsigned int*)(0x422B90BCUL)))
#define bM4_TMRA4_HCUPR_HCUP0                     (*((volatile unsigned int*)(0x422B9100UL)))
#define bM4_TMRA4_HCUPR_HCUP1                     (*((volatile unsigned int*)(0x422B9104UL)))
#define bM4_TMRA4_HCUPR_HCUP2                     (*((volatile unsigned int*)(0x422B9108UL)))
#define bM4_TMRA4_HCUPR_HCUP3                     (*((volatile unsigned int*)(0x422B910CUL)))
#define bM4_TMRA4_HCUPR_HCUP4                     (*((volatile unsigned int*)(0x422B9110UL)))
#define bM4_TMRA4_HCUPR_HCUP5                     (*((volatile unsigned int*)(0x422B9114UL)))
#define bM4_TMRA4_HCUPR_HCUP6                     (*((volatile unsigned int*)(0x422B9118UL)))
#define bM4_TMRA4_HCUPR_HCUP7                     (*((volatile unsigned int*)(0x422B911CUL)))
#define bM4_TMRA4_HCUPR_HCUP8                     (*((volatile unsigned int*)(0x422B9120UL)))
#define bM4_TMRA4_HCUPR_HCUP9                     (*((volatile unsigned int*)(0x422B9124UL)))
#define bM4_TMRA4_HCUPR_HCUP10                    (*((volatile unsigned int*)(0x422B9128UL)))
#define bM4_TMRA4_HCUPR_HCUP11                    (*((volatile unsigned int*)(0x422B912CUL)))
#define bM4_TMRA4_HCUPR_HCUP12                    (*((volatile unsigned int*)(0x422B9130UL)))
#define bM4_TMRA4_HCDOR_HCDO0                     (*((volatile unsigned int*)(0x422B9180UL)))
#define bM4_TMRA4_HCDOR_HCDO1                     (*((volatile unsigned int*)(0x422B9184UL)))
#define bM4_TMRA4_HCDOR_HCDO2                     (*((volatile unsigned int*)(0x422B9188UL)))
#define bM4_TMRA4_HCDOR_HCDO3                     (*((volatile unsigned int*)(0x422B918CUL)))
#define bM4_TMRA4_HCDOR_HCDO4                     (*((volatile unsigned int*)(0x422B9190UL)))
#define bM4_TMRA4_HCDOR_HCDO5                     (*((volatile unsigned int*)(0x422B9194UL)))
#define bM4_TMRA4_HCDOR_HCDO6                     (*((volatile unsigned int*)(0x422B9198UL)))
#define bM4_TMRA4_HCDOR_HCDO7                     (*((volatile unsigned int*)(0x422B919CUL)))
#define bM4_TMRA4_HCDOR_HCDO8                     (*((volatile unsigned int*)(0x422B91A0UL)))
#define bM4_TMRA4_HCDOR_HCDO9                     (*((volatile unsigned int*)(0x422B91A4UL)))
#define bM4_TMRA4_HCDOR_HCDO10                    (*((volatile unsigned int*)(0x422B91A8UL)))
#define bM4_TMRA4_HCDOR_HCDO11                    (*((volatile unsigned int*)(0x422B91ACUL)))
#define bM4_TMRA4_HCDOR_HCDO12                    (*((volatile unsigned int*)(0x422B91B0UL)))
#define bM4_TMRA4_ICONR_ITEN1                     (*((volatile unsigned int*)(0x422B9200UL)))
#define bM4_TMRA4_ICONR_ITEN2                     (*((volatile unsigned int*)(0x422B9204UL)))
#define bM4_TMRA4_ICONR_ITEN3                     (*((volatile unsigned int*)(0x422B9208UL)))
#define bM4_TMRA4_ICONR_ITEN4                     (*((volatile unsigned int*)(0x422B920CUL)))
#define bM4_TMRA4_ICONR_ITEN5                     (*((volatile unsigned int*)(0x422B9210UL)))
#define bM4_TMRA4_ICONR_ITEN6                     (*((volatile unsigned int*)(0x422B9214UL)))
#define bM4_TMRA4_ICONR_ITEN7                     (*((volatile unsigned int*)(0x422B9218UL)))
#define bM4_TMRA4_ICONR_ITEN8                     (*((volatile unsigned int*)(0x422B921CUL)))
#define bM4_TMRA4_ECONR_ETEN1                     (*((volatile unsigned int*)(0x422B9280UL)))
#define bM4_TMRA4_ECONR_ETEN2                     (*((volatile unsigned int*)(0x422B9284UL)))
#define bM4_TMRA4_ECONR_ETEN3                     (*((volatile unsigned int*)(0x422B9288UL)))
#define bM4_TMRA4_ECONR_ETEN4                     (*((volatile unsigned int*)(0x422B928CUL)))
#define bM4_TMRA4_ECONR_ETEN5                     (*((volatile unsigned int*)(0x422B9290UL)))
#define bM4_TMRA4_ECONR_ETEN6                     (*((volatile unsigned int*)(0x422B9294UL)))
#define bM4_TMRA4_ECONR_ETEN7                     (*((volatile unsigned int*)(0x422B9298UL)))
#define bM4_TMRA4_ECONR_ETEN8                     (*((volatile unsigned int*)(0x422B929CUL)))
#define bM4_TMRA4_FCONR_NOFIENTG                  (*((volatile unsigned int*)(0x422B9300UL)))
#define bM4_TMRA4_FCONR_NOFICKTG0                 (*((volatile unsigned int*)(0x422B9304UL)))
#define bM4_TMRA4_FCONR_NOFICKTG1                 (*((volatile unsigned int*)(0x422B9308UL)))
#define bM4_TMRA4_FCONR_NOFIENCA                  (*((volatile unsigned int*)(0x422B9320UL)))
#define bM4_TMRA4_FCONR_NOFICKCA0                 (*((volatile unsigned int*)(0x422B9324UL)))
#define bM4_TMRA4_FCONR_NOFICKCA1                 (*((volatile unsigned int*)(0x422B9328UL)))
#define bM4_TMRA4_FCONR_NOFIENCB                  (*((volatile unsigned int*)(0x422B9330UL)))
#define bM4_TMRA4_FCONR_NOFICKCB0                 (*((volatile unsigned int*)(0x422B9334UL)))
#define bM4_TMRA4_FCONR_NOFICKCB1                 (*((volatile unsigned int*)(0x422B9338UL)))
#define bM4_TMRA4_STFLR_CMPF1                     (*((volatile unsigned int*)(0x422B9380UL)))
#define bM4_TMRA4_STFLR_CMPF2                     (*((volatile unsigned int*)(0x422B9384UL)))
#define bM4_TMRA4_STFLR_CMPF3                     (*((volatile unsigned int*)(0x422B9388UL)))
#define bM4_TMRA4_STFLR_CMPF4                     (*((volatile unsigned int*)(0x422B938CUL)))
#define bM4_TMRA4_STFLR_CMPF5                     (*((volatile unsigned int*)(0x422B9390UL)))
#define bM4_TMRA4_STFLR_CMPF6                     (*((volatile unsigned int*)(0x422B9394UL)))
#define bM4_TMRA4_STFLR_CMPF7                     (*((volatile unsigned int*)(0x422B9398UL)))
#define bM4_TMRA4_STFLR_CMPF8                     (*((volatile unsigned int*)(0x422B939CUL)))
#define bM4_TMRA4_BCONR1_BEN                      (*((volatile unsigned int*)(0x422B9800UL)))
#define bM4_TMRA4_BCONR1_BSE0                     (*((volatile unsigned int*)(0x422B9804UL)))
#define bM4_TMRA4_BCONR1_BSE1                     (*((volatile unsigned int*)(0x422B9808UL)))
#define bM4_TMRA4_BCONR2_BEN                      (*((volatile unsigned int*)(0x422B9900UL)))
#define bM4_TMRA4_BCONR2_BSE0                     (*((volatile unsigned int*)(0x422B9904UL)))
#define bM4_TMRA4_BCONR2_BSE1                     (*((volatile unsigned int*)(0x422B9908UL)))
#define bM4_TMRA4_BCONR3_BEN                      (*((volatile unsigned int*)(0x422B9A00UL)))
#define bM4_TMRA4_BCONR3_BSE0                     (*((volatile unsigned int*)(0x422B9A04UL)))
#define bM4_TMRA4_BCONR3_BSE1                     (*((volatile unsigned int*)(0x422B9A08UL)))
#define bM4_TMRA4_BCONR4_BEN                      (*((volatile unsigned int*)(0x422B9B00UL)))
#define bM4_TMRA4_BCONR4_BSE0                     (*((volatile unsigned int*)(0x422B9B04UL)))
#define bM4_TMRA4_BCONR4_BSE1                     (*((volatile unsigned int*)(0x422B9B08UL)))
#define bM4_TMRA4_CCONR1_CAPMD                    (*((volatile unsigned int*)(0x422BA000UL)))
#define bM4_TMRA4_CCONR1_HICP0                    (*((volatile unsigned int*)(0x422BA010UL)))
#define bM4_TMRA4_CCONR1_HICP1                    (*((volatile unsigned int*)(0x422BA014UL)))
#define bM4_TMRA4_CCONR1_HICP2                    (*((volatile unsigned int*)(0x422BA018UL)))
#define bM4_TMRA4_CCONR1_HICP3                    (*((volatile unsigned int*)(0x422BA020UL)))
#define bM4_TMRA4_CCONR1_HICP4                    (*((volatile unsigned int*)(0x422BA024UL)))
#define bM4_TMRA4_CCONR1_NOFIENCP                 (*((volatile unsigned int*)(0x422BA030UL)))
#define bM4_TMRA4_CCONR1_NOFICKCP0                (*((volatile unsigned int*)(0x422BA034UL)))
#define bM4_TMRA4_CCONR1_NOFICKCP1                (*((volatile unsigned int*)(0x422BA038UL)))
#define bM4_TMRA4_CCONR2_CAPMD                    (*((volatile unsigned int*)(0x422BA080UL)))
#define bM4_TMRA4_CCONR2_HICP0                    (*((volatile unsigned int*)(0x422BA090UL)))
#define bM4_TMRA4_CCONR2_HICP1                    (*((volatile unsigned int*)(0x422BA094UL)))
#define bM4_TMRA4_CCONR2_HICP2                    (*((volatile unsigned int*)(0x422BA098UL)))
#define bM4_TMRA4_CCONR2_HICP3                    (*((volatile unsigned int*)(0x422BA0A0UL)))
#define bM4_TMRA4_CCONR2_HICP4                    (*((volatile unsigned int*)(0x422BA0A4UL)))
#define bM4_TMRA4_CCONR2_NOFIENCP                 (*((volatile unsigned int*)(0x422BA0B0UL)))
#define bM4_TMRA4_CCONR2_NOFICKCP0                (*((volatile unsigned int*)(0x422BA0B4UL)))
#define bM4_TMRA4_CCONR2_NOFICKCP1                (*((volatile unsigned int*)(0x422BA0B8UL)))
#define bM4_TMRA4_CCONR3_CAPMD                    (*((volatile unsigned int*)(0x422BA100UL)))
#define bM4_TMRA4_CCONR3_HICP0                    (*((volatile unsigned int*)(0x422BA110UL)))
#define bM4_TMRA4_CCONR3_HICP1                    (*((volatile unsigned int*)(0x422BA114UL)))
#define bM4_TMRA4_CCONR3_HICP2                    (*((volatile unsigned int*)(0x422BA118UL)))
#define bM4_TMRA4_CCONR3_HICP3                    (*((volatile unsigned int*)(0x422BA120UL)))
#define bM4_TMRA4_CCONR3_HICP4                    (*((volatile unsigned int*)(0x422BA124UL)))
#define bM4_TMRA4_CCONR3_NOFIENCP                 (*((volatile unsigned int*)(0x422BA130UL)))
#define bM4_TMRA4_CCONR3_NOFICKCP0                (*((volatile unsigned int*)(0x422BA134UL)))
#define bM4_TMRA4_CCONR3_NOFICKCP1                (*((volatile unsigned int*)(0x422BA138UL)))
#define bM4_TMRA4_CCONR4_CAPMD                    (*((volatile unsigned int*)(0x422BA180UL)))
#define bM4_TMRA4_CCONR4_HICP0                    (*((volatile unsigned int*)(0x422BA190UL)))
#define bM4_TMRA4_CCONR4_HICP1                    (*((volatile unsigned int*)(0x422BA194UL)))
#define bM4_TMRA4_CCONR4_HICP2                    (*((volatile unsigned int*)(0x422BA198UL)))
#define bM4_TMRA4_CCONR4_HICP3                    (*((volatile unsigned int*)(0x422BA1A0UL)))
#define bM4_TMRA4_CCONR4_HICP4                    (*((volatile unsigned int*)(0x422BA1A4UL)))
#define bM4_TMRA4_CCONR4_NOFIENCP                 (*((volatile unsigned int*)(0x422BA1B0UL)))
#define bM4_TMRA4_CCONR4_NOFICKCP0                (*((volatile unsigned int*)(0x422BA1B4UL)))
#define bM4_TMRA4_CCONR4_NOFICKCP1                (*((volatile unsigned int*)(0x422BA1B8UL)))
#define bM4_TMRA4_CCONR5_CAPMD                    (*((volatile unsigned int*)(0x422BA200UL)))
#define bM4_TMRA4_CCONR5_HICP0                    (*((volatile unsigned int*)(0x422BA210UL)))
#define bM4_TMRA4_CCONR5_HICP1                    (*((volatile unsigned int*)(0x422BA214UL)))
#define bM4_TMRA4_CCONR5_HICP2                    (*((volatile unsigned int*)(0x422BA218UL)))
#define bM4_TMRA4_CCONR5_HICP3                    (*((volatile unsigned int*)(0x422BA220UL)))
#define bM4_TMRA4_CCONR5_HICP4                    (*((volatile unsigned int*)(0x422BA224UL)))
#define bM4_TMRA4_CCONR5_NOFIENCP                 (*((volatile unsigned int*)(0x422BA230UL)))
#define bM4_TMRA4_CCONR5_NOFICKCP0                (*((volatile unsigned int*)(0x422BA234UL)))
#define bM4_TMRA4_CCONR5_NOFICKCP1                (*((volatile unsigned int*)(0x422BA238UL)))
#define bM4_TMRA4_CCONR6_CAPMD                    (*((volatile unsigned int*)(0x422BA280UL)))
#define bM4_TMRA4_CCONR6_HICP0                    (*((volatile unsigned int*)(0x422BA290UL)))
#define bM4_TMRA4_CCONR6_HICP1                    (*((volatile unsigned int*)(0x422BA294UL)))
#define bM4_TMRA4_CCONR6_HICP2                    (*((volatile unsigned int*)(0x422BA298UL)))
#define bM4_TMRA4_CCONR6_HICP3                    (*((volatile unsigned int*)(0x422BA2A0UL)))
#define bM4_TMRA4_CCONR6_HICP4                    (*((volatile unsigned int*)(0x422BA2A4UL)))
#define bM4_TMRA4_CCONR6_NOFIENCP                 (*((volatile unsigned int*)(0x422BA2B0UL)))
#define bM4_TMRA4_CCONR6_NOFICKCP0                (*((volatile unsigned int*)(0x422BA2B4UL)))
#define bM4_TMRA4_CCONR6_NOFICKCP1                (*((volatile unsigned int*)(0x422BA2B8UL)))
#define bM4_TMRA4_CCONR7_CAPMD                    (*((volatile unsigned int*)(0x422BA300UL)))
#define bM4_TMRA4_CCONR7_HICP0                    (*((volatile unsigned int*)(0x422BA310UL)))
#define bM4_TMRA4_CCONR7_HICP1                    (*((volatile unsigned int*)(0x422BA314UL)))
#define bM4_TMRA4_CCONR7_HICP2                    (*((volatile unsigned int*)(0x422BA318UL)))
#define bM4_TMRA4_CCONR7_HICP3                    (*((volatile unsigned int*)(0x422BA320UL)))
#define bM4_TMRA4_CCONR7_HICP4                    (*((volatile unsigned int*)(0x422BA324UL)))
#define bM4_TMRA4_CCONR7_NOFIENCP                 (*((volatile unsigned int*)(0x422BA330UL)))
#define bM4_TMRA4_CCONR7_NOFICKCP0                (*((volatile unsigned int*)(0x422BA334UL)))
#define bM4_TMRA4_CCONR7_NOFICKCP1                (*((volatile unsigned int*)(0x422BA338UL)))
#define bM4_TMRA4_CCONR8_CAPMD                    (*((volatile unsigned int*)(0x422BA380UL)))
#define bM4_TMRA4_CCONR8_HICP0                    (*((volatile unsigned int*)(0x422BA390UL)))
#define bM4_TMRA4_CCONR8_HICP1                    (*((volatile unsigned int*)(0x422BA394UL)))
#define bM4_TMRA4_CCONR8_HICP2                    (*((volatile unsigned int*)(0x422BA398UL)))
#define bM4_TMRA4_CCONR8_HICP3                    (*((volatile unsigned int*)(0x422BA3A0UL)))
#define bM4_TMRA4_CCONR8_HICP4                    (*((volatile unsigned int*)(0x422BA3A4UL)))
#define bM4_TMRA4_CCONR8_NOFIENCP                 (*((volatile unsigned int*)(0x422BA3B0UL)))
#define bM4_TMRA4_CCONR8_NOFICKCP0                (*((volatile unsigned int*)(0x422BA3B4UL)))
#define bM4_TMRA4_CCONR8_NOFICKCP1                (*((volatile unsigned int*)(0x422BA3B8UL)))
#define bM4_TMRA4_PCONR1_STAC0                    (*((volatile unsigned int*)(0x422BA800UL)))
#define bM4_TMRA4_PCONR1_STAC1                    (*((volatile unsigned int*)(0x422BA804UL)))
#define bM4_TMRA4_PCONR1_STPC0                    (*((volatile unsigned int*)(0x422BA808UL)))
#define bM4_TMRA4_PCONR1_STPC1                    (*((volatile unsigned int*)(0x422BA80CUL)))
#define bM4_TMRA4_PCONR1_CMPC0                    (*((volatile unsigned int*)(0x422BA810UL)))
#define bM4_TMRA4_PCONR1_CMPC1                    (*((volatile unsigned int*)(0x422BA814UL)))
#define bM4_TMRA4_PCONR1_PERC0                    (*((volatile unsigned int*)(0x422BA818UL)))
#define bM4_TMRA4_PCONR1_PERC1                    (*((volatile unsigned int*)(0x422BA81CUL)))
#define bM4_TMRA4_PCONR1_FORC0                    (*((volatile unsigned int*)(0x422BA820UL)))
#define bM4_TMRA4_PCONR1_FORC1                    (*((volatile unsigned int*)(0x422BA824UL)))
#define bM4_TMRA4_PCONR1_OUTEN                    (*((volatile unsigned int*)(0x422BA830UL)))
#define bM4_TMRA4_PCONR2_STAC0                    (*((volatile unsigned int*)(0x422BA880UL)))
#define bM4_TMRA4_PCONR2_STAC1                    (*((volatile unsigned int*)(0x422BA884UL)))
#define bM4_TMRA4_PCONR2_STPC0                    (*((volatile unsigned int*)(0x422BA888UL)))
#define bM4_TMRA4_PCONR2_STPC1                    (*((volatile unsigned int*)(0x422BA88CUL)))
#define bM4_TMRA4_PCONR2_CMPC0                    (*((volatile unsigned int*)(0x422BA890UL)))
#define bM4_TMRA4_PCONR2_CMPC1                    (*((volatile unsigned int*)(0x422BA894UL)))
#define bM4_TMRA4_PCONR2_PERC0                    (*((volatile unsigned int*)(0x422BA898UL)))
#define bM4_TMRA4_PCONR2_PERC1                    (*((volatile unsigned int*)(0x422BA89CUL)))
#define bM4_TMRA4_PCONR2_FORC0                    (*((volatile unsigned int*)(0x422BA8A0UL)))
#define bM4_TMRA4_PCONR2_FORC1                    (*((volatile unsigned int*)(0x422BA8A4UL)))
#define bM4_TMRA4_PCONR2_OUTEN                    (*((volatile unsigned int*)(0x422BA8B0UL)))
#define bM4_TMRA4_PCONR3_STAC0                    (*((volatile unsigned int*)(0x422BA900UL)))
#define bM4_TMRA4_PCONR3_STAC1                    (*((volatile unsigned int*)(0x422BA904UL)))
#define bM4_TMRA4_PCONR3_STPC0                    (*((volatile unsigned int*)(0x422BA908UL)))
#define bM4_TMRA4_PCONR3_STPC1                    (*((volatile unsigned int*)(0x422BA90CUL)))
#define bM4_TMRA4_PCONR3_CMPC0                    (*((volatile unsigned int*)(0x422BA910UL)))
#define bM4_TMRA4_PCONR3_CMPC1                    (*((volatile unsigned int*)(0x422BA914UL)))
#define bM4_TMRA4_PCONR3_PERC0                    (*((volatile unsigned int*)(0x422BA918UL)))
#define bM4_TMRA4_PCONR3_PERC1                    (*((volatile unsigned int*)(0x422BA91CUL)))
#define bM4_TMRA4_PCONR3_FORC0                    (*((volatile unsigned int*)(0x422BA920UL)))
#define bM4_TMRA4_PCONR3_FORC1                    (*((volatile unsigned int*)(0x422BA924UL)))
#define bM4_TMRA4_PCONR3_OUTEN                    (*((volatile unsigned int*)(0x422BA930UL)))
#define bM4_TMRA4_PCONR4_STAC0                    (*((volatile unsigned int*)(0x422BA980UL)))
#define bM4_TMRA4_PCONR4_STAC1                    (*((volatile unsigned int*)(0x422BA984UL)))
#define bM4_TMRA4_PCONR4_STPC0                    (*((volatile unsigned int*)(0x422BA988UL)))
#define bM4_TMRA4_PCONR4_STPC1                    (*((volatile unsigned int*)(0x422BA98CUL)))
#define bM4_TMRA4_PCONR4_CMPC0                    (*((volatile unsigned int*)(0x422BA990UL)))
#define bM4_TMRA4_PCONR4_CMPC1                    (*((volatile unsigned int*)(0x422BA994UL)))
#define bM4_TMRA4_PCONR4_PERC0                    (*((volatile unsigned int*)(0x422BA998UL)))
#define bM4_TMRA4_PCONR4_PERC1                    (*((volatile unsigned int*)(0x422BA99CUL)))
#define bM4_TMRA4_PCONR4_FORC0                    (*((volatile unsigned int*)(0x422BA9A0UL)))
#define bM4_TMRA4_PCONR4_FORC1                    (*((volatile unsigned int*)(0x422BA9A4UL)))
#define bM4_TMRA4_PCONR4_OUTEN                    (*((volatile unsigned int*)(0x422BA9B0UL)))
#define bM4_TMRA4_PCONR5_STAC0                    (*((volatile unsigned int*)(0x422BAA00UL)))
#define bM4_TMRA4_PCONR5_STAC1                    (*((volatile unsigned int*)(0x422BAA04UL)))
#define bM4_TMRA4_PCONR5_STPC0                    (*((volatile unsigned int*)(0x422BAA08UL)))
#define bM4_TMRA4_PCONR5_STPC1                    (*((volatile unsigned int*)(0x422BAA0CUL)))
#define bM4_TMRA4_PCONR5_CMPC0                    (*((volatile unsigned int*)(0x422BAA10UL)))
