patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_USBFS_HCTSIZ8_XFRSIZ2                 (*((volatile unsigned int*)(0x4380C208UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ3                 (*((volatile unsigned int*)(0x4380C20CUL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ4                 (*((volatile unsigned int*)(0x4380C210UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ5                 (*((volatile unsigned int*)(0x4380C214UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ6                 (*((volatile unsigned int*)(0x4380C218UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ7                 (*((volatile unsigned int*)(0x4380C21CUL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ8                 (*((volatile unsigned int*)(0x4380C220UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ9                 (*((volatile unsigned int*)(0x4380C224UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ10                (*((volatile unsigned int*)(0x4380C228UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ11                (*((volatile unsigned int*)(0x4380C22CUL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ12                (*((volatile unsigned int*)(0x4380C230UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ13                (*((volatile unsigned int*)(0x4380C234UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ14                (*((volatile unsigned int*)(0x4380C238UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ15                (*((volatile unsigned int*)(0x4380C23CUL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ16                (*((volatile unsigned int*)(0x4380C240UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ17                (*((volatile unsigned int*)(0x4380C244UL)))
#define bM4_USBFS_HCTSIZ8_XFRSIZ18                (*((volatile unsigned int*)(0x4380C248UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT0                 (*((volatile unsigned int*)(0x4380C24CUL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT1                 (*((volatile unsigned int*)(0x4380C250UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT2                 (*((volatile unsigned int*)(0x4380C254UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT3                 (*((volatile unsigned int*)(0x4380C258UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT4                 (*((volatile unsigned int*)(0x4380C25CUL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT5                 (*((volatile unsigned int*)(0x4380C260UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT6                 (*((volatile unsigned int*)(0x4380C264UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT7                 (*((volatile unsigned int*)(0x4380C268UL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT8                 (*((volatile unsigned int*)(0x4380C26CUL)))
#define bM4_USBFS_HCTSIZ8_PKTCNT9                 (*((volatile unsigned int*)(0x4380C270UL)))
#define bM4_USBFS_HCTSIZ8_DPID0                   (*((volatile unsigned int*)(0x4380C274UL)))
#define bM4_USBFS_HCTSIZ8_DPID1                   (*((volatile unsigned int*)(0x4380C278UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ0                  (*((volatile unsigned int*)(0x4380C400UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ1                  (*((volatile unsigned int*)(0x4380C404UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ2                  (*((volatile unsigned int*)(0x4380C408UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ3                  (*((volatile unsigned int*)(0x4380C40CUL)))
#define bM4_USBFS_HCCHAR9_MPSIZ4                  (*((volatile unsigned int*)(0x4380C410UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ5                  (*((volatile unsigned int*)(0x4380C414UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ6                  (*((volatile unsigned int*)(0x4380C418UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ7                  (*((volatile unsigned int*)(0x4380C41CUL)))
#define bM4_USBFS_HCCHAR9_MPSIZ8                  (*((volatile unsigned int*)(0x4380C420UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ9                  (*((volatile unsigned int*)(0x4380C424UL)))
#define bM4_USBFS_HCCHAR9_MPSIZ10                 (*((volatile unsigned int*)(0x4380C428UL)))
#define bM4_USBFS_HCCHAR9_EPNUM0                  (*((volatile unsigned int*)(0x4380C42CUL)))
#define bM4_USBFS_HCCHAR9_EPNUM1                  (*((volatile unsigned int*)(0x4380C430UL)))
#define bM4_USBFS_HCCHAR9_EPNUM2                  (*((volatile unsigned int*)(0x4380C434UL)))
#define bM4_USBFS_HCCHAR9_EPNUM3                  (*((volatile unsigned int*)(0x4380C438UL)))
#define bM4_USBFS_HCCHAR9_EPDIR                   (*((volatile unsigned int*)(0x4380C43CUL)))
#define bM4_USBFS_HCCHAR9_LSDEV                   (*((volatile unsigned int*)(0x4380C444UL)))
#define bM4_USBFS_HCCHAR9_EPTYP0                  (*((volatile unsigned int*)(0x4380C448UL)))
#define bM4_USBFS_HCCHAR9_EPTYP1                  (*((volatile unsigned int*)(0x4380C44CUL)))
#define bM4_USBFS_HCCHAR9_DAD0                    (*((volatile unsigned int*)(0x4380C458UL)))
#define bM4_USBFS_HCCHAR9_DAD1                    (*((volatile unsigned int*)(0x4380C45CUL)))
#define bM4_USBFS_HCCHAR9_DAD2                    (*((volatile unsigned int*)(0x4380C460UL)))
#define bM4_USBFS_HCCHAR9_DAD3                    (*((volatile unsigned int*)(0x4380C464UL)))
#define bM4_USBFS_HCCHAR9_DAD4                    (*((volatile unsigned int*)(0x4380C468UL)))
#define bM4_USBFS_HCCHAR9_DAD5                    (*((volatile unsigned int*)(0x4380C46CUL)))
#define bM4_USBFS_HCCHAR9_DAD6                    (*((volatile unsigned int*)(0x4380C470UL)))
#define bM4_USBFS_HCCHAR9_ODDFRM                  (*((volatile unsigned int*)(0x4380C474UL)))
#define bM4_USBFS_HCCHAR9_CHDIS                   (*((volatile unsigned int*)(0x4380C478UL)))
#define bM4_USBFS_HCCHAR9_CHENA                   (*((volatile unsigned int*)(0x4380C47CUL)))
#define bM4_USBFS_HCINT9_XFRC                     (*((volatile unsigned int*)(0x4380C500UL)))
#define bM4_USBFS_HCINT9_CHH                      (*((volatile unsigned int*)(0x4380C504UL)))
#define bM4_USBFS_HCINT9_STALL                    (*((volatile unsigned int*)(0x4380C50CUL)))
#define bM4_USBFS_HCINT9_NAK                      (*((volatile unsigned int*)(0x4380C510UL)))
#define bM4_USBFS_HCINT9_ACK                      (*((volatile unsigned int*)(0x4380C514UL)))
#define bM4_USBFS_HCINT9_TXERR                    (*((volatile unsigned int*)(0x4380C51CUL)))
#define bM4_USBFS_HCINT9_BBERR                    (*((volatile unsigned int*)(0x4380C520UL)))
#define bM4_USBFS_HCINT9_FRMOR                    (*((volatile unsigned int*)(0x4380C524UL)))
#define bM4_USBFS_HCINT9_DTERR                    (*((volatile unsigned int*)(0x4380C528UL)))
#define bM4_USBFS_HCINTMSK9_XFRCM                 (*((volatile unsigned int*)(0x4380C580UL)))
#define bM4_USBFS_HCINTMSK9_CHHM                  (*((volatile unsigned int*)(0x4380C584UL)))
#define bM4_USBFS_HCINTMSK9_STALLM                (*((volatile unsigned int*)(0x4380C58CUL)))
#define bM4_USBFS_HCINTMSK9_NAKM                  (*((volatile unsigned int*)(0x4380C590UL)))
#define bM4_USBFS_HCINTMSK9_ACKM                  (*((volatile unsigned int*)(0x4380C594UL)))
#define bM4_USBFS_HCINTMSK9_TXERRM                (*((volatile unsigned int*)(0x4380C59CUL)))
#define bM4_USBFS_HCINTMSK9_BBERRM                (*((volatile unsigned int*)(0x4380C5A0UL)))
#define bM4_USBFS_HCINTMSK9_FRMORM                (*((volatile unsigned int*)(0x4380C5A4UL)))
#define bM4_USBFS_HCINTMSK9_DTERRM                (*((volatile unsigned int*)(0x4380C5A8UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ0                 (*((volatile unsigned int*)(0x4380C600UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ1                 (*((volatile unsigned int*)(0x4380C604UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ2                 (*((volatile unsigned int*)(0x4380C608UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ3                 (*((volatile unsigned int*)(0x4380C60CUL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ4                 (*((volatile unsigned int*)(0x4380C610UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ5                 (*((volatile unsigned int*)(0x4380C614UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ6                 (*((volatile unsigned int*)(0x4380C618UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ7                 (*((volatile unsigned int*)(0x4380C61CUL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ8                 (*((volatile unsigned int*)(0x4380C620UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ9                 (*((volatile unsigned int*)(0x4380C624UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ10                (*((volatile unsigned int*)(0x4380C628UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ11                (*((volatile unsigned int*)(0x4380C62CUL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ12                (*((volatile unsigned int*)(0x4380C630UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ13                (*((volatile unsigned int*)(0x4380C634UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ14                (*((volatile unsigned int*)(0x4380C638UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ15                (*((volatile unsigned int*)(0x4380C63CUL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ16                (*((volatile unsigned int*)(0x4380C640UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ17                (*((volatile unsigned int*)(0x4380C644UL)))
#define bM4_USBFS_HCTSIZ9_XFRSIZ18                (*((volatile unsigned int*)(0x4380C648UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT0                 (*((volatile unsigned int*)(0x4380C64CUL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT1                 (*((volatile unsigned int*)(0x4380C650UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT2                 (*((volatile unsigned int*)(0x4380C654UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT3                 (*((volatile unsigned int*)(0x4380C658UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT4                 (*((volatile unsigned int*)(0x4380C65CUL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT5                 (*((volatile unsigned int*)(0x4380C660UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT6                 (*((volatile unsigned int*)(0x4380C664UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT7                 (*((volatile unsigned int*)(0x4380C668UL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT8                 (*((volatile unsigned int*)(0x4380C66CUL)))
#define bM4_USBFS_HCTSIZ9_PKTCNT9                 (*((volatile unsigned int*)(0x4380C670UL)))
#define bM4_USBFS_HCTSIZ9_DPID0                   (*((volatile unsigned int*)(0x4380C674UL)))
#define bM4_USBFS_HCTSIZ9_DPID1                   (*((volatile unsigned int*)(0x4380C678UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ0                 (*((volatile unsigned int*)(0x4380C800UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ1                 (*((volatile unsigned int*)(0x4380C804UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ2                 (*((volatile unsigned int*)(0x4380C808UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ3                 (*((volatile unsigned int*)(0x4380C80CUL)))
#define bM4_USBFS_HCCHAR10_MPSIZ4                 (*((volatile unsigned int*)(0x4380C810UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ5                 (*((volatile unsigned int*)(0x4380C814UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ6                 (*((volatile unsigned int*)(0x4380C818UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ7                 (*((volatile unsigned int*)(0x4380C81CUL)))
#define bM4_USBFS_HCCHAR10_MPSIZ8                 (*((volatile unsigned int*)(0x4380C820UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ9                 (*((volatile unsigned int*)(0x4380C824UL)))
#define bM4_USBFS_HCCHAR10_MPSIZ10                (*((volatile unsigned int*)(0x4380C828UL)))
#define bM4_USBFS_HCCHAR10_EPNUM0                 (*((volatile unsigned int*)(0x4380C82CUL)))
#define bM4_USBFS_HCCHAR10_EPNUM1                 (*((volatile unsigned int*)(0x4380C830UL)))
#define bM4_USBFS_HCCHAR10_EPNUM2                 (*((volatile unsigned int*)(0x4380C834UL)))
#define bM4_USBFS_HCCHAR10_EPNUM3                 (*((volatile unsigned int*)(0x4380C838UL)))
#define bM4_USBFS_HCCHAR10_EPDIR                  (*((volatile unsigned int*)(0x4380C83CUL)))
#define bM4_USBFS_HCCHAR10_LSDEV                  (*((volatile unsigned int*)(0x4380C844UL)))
#define bM4_USBFS_HCCHAR10_EPTYP0                 (*((volatile unsigned int*)(0x4380C848UL)))
#define bM4_USBFS_HCCHAR10_EPTYP1                 (*((volatile unsigned int*)(0x4380C84CUL)))
#define bM4_USBFS_HCCHAR10_DAD0                   (*((volatile unsigned int*)(0x4380C858UL)))
#define bM4_USBFS_HCCHAR10_DAD1                   (*((volatile unsigned int*)(0x4380C85CUL)))
#define bM4_USBFS_HCCHAR10_DAD2                   (*((volatile unsigned int*)(0x4380C860UL)))
#define bM4_USBFS_HCCHAR10_DAD3                   (*((volatile unsigned int*)(0x4380C864UL)))
#define bM4_USBFS_HCCHAR10_DAD4                   (*((volatile unsigned int*)(0x4380C868UL)))
#define bM4_USBFS_HCCHAR10_DAD5                   (*((volatile unsigned int*)(0x4380C86CUL)))
#define bM4_USBFS_HCCHAR10_DAD6                   (*((volatile unsigned int*)(0x4380C870UL)))
#define bM4_USBFS_HCCHAR10_ODDFRM                 (*((volatile unsigned int*)(0x4380C874UL)))
#define bM4_USBFS_HCCHAR10_CHDIS                  (*((volatile unsigned int*)(0x4380C878UL)))
#define bM4_USBFS_HCCHAR10_CHENA                  (*((volatile unsigned int*)(0x4380C87CUL)))
#define bM4_USBFS_HCINT10_XFRC                    (*((volatile unsigned int*)(0x4380C900UL)))
#define bM4_USBFS_HCINT10_CHH                     (*((volatile unsigned int*)(0x4380C904UL)))
#define bM4_USBFS_HCINT10_STALL                   (*((volatile unsigned int*)(0x4380C90CUL)))
#define bM4_USBFS_HCINT10_NAK                     (*((volatile unsigned int*)(0x4380C910UL)))
#define bM4_USBFS_HCINT10_ACK                     (*((volatile unsigned int*)(0x4380C914UL)))
#define bM4_USBFS_HCINT10_TXERR                   (*((volatile unsigned int*)(0x4380C91CUL)))
#define bM4_USBFS_HCINT10_BBERR                   (*((volatile unsigned int*)(0x4380C920UL)))
#define bM4_USBFS_HCINT10_FRMOR                   (*((volatile unsigned int*)(0x4380C924UL)))
#define bM4_USBFS_HCINT10_DTERR                   (*((volatile unsigned int*)(0x4380C928UL)))
#define bM4_USBFS_HCINTMSK10_XFRCM                (*((volatile unsigned int*)(0x4380C980UL)))
#define bM4_USBFS_HCINTMSK10_CHHM                 (*((volatile unsigned int*)(0x4380C984UL)))
#define bM4_USBFS_HCINTMSK10_STALLM               (*((volatile unsigned int*)(0x4380C98CUL)))
#define bM4_USBFS_HCINTMSK10_NAKM                 (*((volatile unsigned int*)(0x4380C990UL)))
#define bM4_USBFS_HCINTMSK10_ACKM                 (*((volatile unsigned int*)(0x4380C994UL)))
#define bM4_USBFS_HCINTMSK10_TXERRM               (*((volatile unsigned int*)(0x4380C99CUL)))
#define bM4_USBFS_HCINTMSK10_BBERRM               (*((volatile unsigned int*)(0x4380C9A0UL)))
#define bM4_USBFS_HCINTMSK10_FRMORM               (*((volatile unsigned int*)(0x4380C9A4UL)))
#define bM4_USBFS_HCINTMSK10_DTERRM               (*((volatile unsigned int*)(0x4380C9A8UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ0                (*((volatile unsigned int*)(0x4380CA00UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ1                (*((volatile unsigned int*)(0x4380CA04UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ2                (*((volatile unsigned int*)(0x4380CA08UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ3                (*((volatile unsigned int*)(0x4380CA0CUL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ4                (*((volatile unsigned int*)(0x4380CA10UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ5                (*((volatile unsigned int*)(0x4380CA14UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ6                (*((volatile unsigned int*)(0x4380CA18UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ7                (*((volatile unsigned int*)(0x4380CA1CUL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ8                (*((volatile unsigned int*)(0x4380CA20UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ9                (*((volatile unsigned int*)(0x4380CA24UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ10               (*((volatile unsigned int*)(0x4380CA28UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ11               (*((volatile unsigned int*)(0x4380CA2CUL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ12               (*((volatile unsigned int*)(0x4380CA30UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ13               (*((volatile unsigned int*)(0x4380CA34UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ14               (*((volatile unsigned int*)(0x4380CA38UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ15               (*((volatile unsigned int*)(0x4380CA3CUL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ16               (*((volatile unsigned int*)(0x4380CA40UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ17               (*((volatile unsigned int*)(0x4380CA44UL)))
#define bM4_USBFS_HCTSIZ10_XFRSIZ18               (*((volatile unsigned int*)(0x4380CA48UL)))
#define bM4_USBFS_HCTSIZ10_PKTCNT0                (*((volatile unsigned int*)(0x4380CA4CUL)))
#define bM4_USBFS_HCTSIZ10_PKTCNT1                (*((volatile unsigned int*)(0x4380CA50UL)))
#define bM4_USBFS_HCTSIZ10_PKTCNT2                (*((volatile unsigned int*)(0x4380CA54UL)))
#define bM4_USBFS_HCTSIZ10_PKTCNT3                (*((volatile unsigned int*)(0x4380CA58UL)))
#define bM4_USBFS_HCTSIZ10_PKTCNT4                (*((volatile unsigned int*)(0x4380CA5CUL)))
#define bM4_USBFS_HCTSIZ10_PKTCNT5                (*((volatile unsigned int*)(0x4380CA60UL)))
#define bM4_USBFS_HCTSIZ10_PKTCNT6                (*((volatile unsigned int*)(0x4380CA64UL)))
#define bM4_USBFS_HCTSIZ10_PKTCNT7                (*((volatile unsigned int*)(0x4380CA68UL)))
#define bM4_USBFS_HCTSIZ10_PKTCNT8                (*((volatile unsigned int*)(0x4380CA6CUL)))
#define bM4_USBFS_HCTSIZ10_PKTCNT9                (*((volatile unsigned int*)(0x4380CA70UL)))
#define bM4_USBFS_HCTSIZ10_DPID0                  (*((volatile unsigned int*)(0x4380CA74UL)))
#define bM4_USBFS_HCTSIZ10_DPID1                  (*((volatile unsigned int*)(0x4380CA78UL)))
#define bM4_USBFS_HCCHAR11_MPSIZ0                 (*((volatile unsigned int*)(0x4380CC00UL)))
#define bM4_USBFS_HCCHAR11_MPSIZ1                 (*((volatile unsigned int*)(0x4380CC04UL)))
#define bM4_USBFS_HCCHAR11_MPSIZ2                 (*((volatile unsigned int*)(0x4380CC08UL)))
#define bM4_USBFS_HCCHAR11_MPSIZ3                 (*((volatile unsigned int*)(0x4380CC0CUL)))
#define bM4_USBFS_HCCHAR11_MPSIZ4                 (*((volatile unsigned int*)(0x4380CC10UL)))
#define bM4_USBFS_HCCHAR11_MPSIZ5                 (*((volatile unsigned int*)(0x4380CC14UL)))
#define bM4_USBFS_HCCHAR11_MPSIZ6                 (*((volatile unsigned int*)(0x4380CC18UL)))
#define bM4_USBFS_HCCHAR11_MPSIZ7                 (*((volatile unsigned int*)(0x4380CC1CUL)))
#define bM4_USBFS_HCCHAR11_MPSIZ8                 (*((volatile unsigned int*)(0x4380CC20UL)))
#define bM4_USBFS_HCCHAR11_MPSIZ9                 (*((volatile unsigned int*)(0x4380CC24UL)))
#define bM4_USBFS_HCCHAR11_MPSIZ10                (*((volatile unsigned int*)(0x4380CC28UL)))
#define bM4_USBFS_HCCHAR11_EPNUM0                 (*((volatile unsigned int*)(0x4380CC2CUL)))
#define bM4_USBFS_HCCHAR11_EPNUM1                 (*((volatile unsigned int*)(0x4380CC30UL)))
#define bM4_USBFS_HCCHAR11_EPNUM2                 (*((volatile unsigned int*)(0x4380CC34UL)))
#define bM4_USBFS_HCCHAR11_EPNUM3                 (*((volatile unsigned int*)(0x4380CC38UL)))
#define bM4_USBFS_HCCHAR11_EPDIR                  (*((volatile unsigned int*)(0x4380CC3CUL)))
#define bM4_USBFS_HCCHAR11_LSDEV                  (*((volatile unsigned int*)(0x4380CC44UL)))
#define bM4_USBFS_HCCHAR11_EPTYP0                 (*((volatile unsigned int*)(0x4380CC48UL)))
#define bM4_USBFS_HCCHAR11_EPTYP1                 (*((volatile unsigned int*)(0x4380CC4CUL)))
#define bM4_USBFS_HCCHAR11_DAD0                   (*((volatile unsigned int*)(0x4380CC58UL)))
#define bM4_USBFS_HCCHAR11_DAD1                   (*((volatile unsigned int*)(0x4380CC5CUL)))
#define bM4_USBFS_HCCHAR11_DAD2                   (*((volatile unsigned int*)(0x4380CC60UL)))
#define bM4_USBFS_HCCHAR11_DAD3                   (*((volatile unsigned int*)(0x4380CC64UL)))
#define bM4_USBFS_HCCHAR11_DAD4                   (*((volatile unsigned int*)(0x4380CC68UL)))
#define bM4_USBFS_HCCHAR11_DAD5                   (*((volatile unsigned int*)(0x4380CC6CUL)))
#define bM4_USBFS_HCCHAR11_DAD6                   (*((volatile unsigned int*)(0x4380CC70UL)))
#define bM4_USBFS_HCCHAR11_ODDFRM                 (*((volatile unsigned int*)(0x4380CC74UL)))
#define bM4_USBFS_HCCHAR11_CHDIS                  (*((volatile unsigned int*)(0x4380CC78UL)))
#define bM4_USBFS_HCCHAR11_CHENA                  (*((volatile unsigned int*)(0x4380CC7CUL)))
#define bM4_USBFS_HCINT11_XFRC                    (*((volatile unsigned int*)(0x4380CD00UL)))
#define bM4_USBFS_HCINT11_CHH                     (*((volatile unsigned int*)(0x4380CD04UL)))
#define bM4_USBFS_HCINT11_STALL                   (*((volatile unsigned int*)(0x4380CD0CUL)))
#define bM4_USBFS_HCINT11_NAK                     (*((volatile unsigned int*)(0x4380CD10UL)))
#define bM4_USBFS_HCINT11_ACK                     (*((volatile unsigned int*)(0x4380CD14UL)))
#define bM4_USBFS_HCINT11_TXERR                   (*((volatile unsigned int*)(0x4380CD1CUL)))
#define bM4_USBFS_HCINT11_BBERR                   (*((volatile unsigned int*)(0x4380CD20UL)))
#define bM4_USBFS_HCINT11_FRMOR                   (*((volatile unsigned int*)(0x4380CD24UL)))
#define bM4_USBFS_HCINT11_DTERR                   (*((volatile unsigned int*)(0x4380CD28UL)))
#define bM4_USBFS_HCINTMSK11_XFRCM                (*((volatile unsigned int*)(0x4380CD80UL)))
#define bM4_USBFS_HCINTMSK11_CHHM                 (*((volatile unsigned int*)(0x4380CD84UL)))
#define bM4_USBFS_HCINTMSK11_STALLM               (*((volatile unsigned int*)(0x4380CD8CUL)))
#define bM4_USBFS_HCINTMSK11_NAKM                 (*((volatile unsigned int*)(0x4380CD90UL)))
#define bM4_USBFS_HCINTMSK11_ACKM                 (*((volatile unsigned int*)(0x4380CD94UL)))
#define bM4_USBFS_HCINTMSK11_TXERRM               (*((volatile unsigned int*)(0x4380CD9CUL)))
#define bM4_USBFS_HCINTMSK11_BBERRM               (*((volatile unsigned int*)(0x4380CDA0UL)))
#define bM4_USBFS_HCINTMSK11_FRMORM               (*((volatile unsigned int*)(0x4380CDA4UL)))
#define bM4_USBFS_HCINTMSK11_DTERRM               (*((volatile unsigned int*)(0x4380CDA8UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ0                (*((volatile unsigned int*)(0x4380CE00UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ1                (*((volatile unsigned int*)(0x4380CE04UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ2                (*((volatile unsigned int*)(0x4380CE08UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ3                (*((volatile unsigned int*)(0x4380CE0CUL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ4                (*((volatile unsigned int*)(0x4380CE10UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ5                (*((volatile unsigned int*)(0x4380CE14UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ6                (*((volatile unsigned int*)(0x4380CE18UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ7                (*((volatile unsigned int*)(0x4380CE1CUL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ8                (*((volatile unsigned int*)(0x4380CE20UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ9                (*((volatile unsigned int*)(0x4380CE24UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ10               (*((volatile unsigned int*)(0x4380CE28UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ11               (*((volatile unsigned int*)(0x4380CE2CUL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ12               (*((volatile unsigned int*)(0x4380CE30UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ13               (*((volatile unsigned int*)(0x4380CE34UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ14               (*((volatile unsigned int*)(0x4380CE38UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ15               (*((volatile unsigned int*)(0x4380CE3CUL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ16               (*((volatile unsigned int*)(0x4380CE40UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ17               (*((volatile unsigned int*)(0x4380CE44UL)))
#define bM4_USBFS_HCTSIZ11_XFRSIZ18               (*((volatile unsigned int*)(0x4380CE48UL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT0                (*((volatile unsigned int*)(0x4380CE4CUL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT1                (*((volatile unsigned int*)(0x4380CE50UL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT2                (*((volatile unsigned int*)(0x4380CE54UL)))
#define bM4_USBFS_HCTSIZ11_PKTCNT3                (*((volatile unsigned int*)(0x4380CE58UL)))
