patagonaa/isdt-cm1620/RevEng/Ghidra/HC32F46x_fixed.h
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ12              (*((volatile unsigned int*)(0x43817230UL)))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ13              (*((volatile unsigned int*)(0x43817234UL)))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ14              (*((volatile unsigned int*)(0x43817238UL)))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ15              (*((volatile unsigned int*)(0x4381723CUL)))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ16              (*((volatile unsigned int*)(0x43817240UL)))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ17              (*((volatile unsigned int*)(0x43817244UL)))
#define bM4_USBFS_DOEPTSIZ4_XFRSIZ18              (*((volatile unsigned int*)(0x43817248UL)))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT0               (*((volatile unsigned int*)(0x4381724CUL)))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT1               (*((volatile unsigned int*)(0x43817250UL)))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT2               (*((volatile unsigned int*)(0x43817254UL)))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT3               (*((volatile unsigned int*)(0x43817258UL)))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT4               (*((volatile unsigned int*)(0x4381725CUL)))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT5               (*((volatile unsigned int*)(0x43817260UL)))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT6               (*((volatile unsigned int*)(0x43817264UL)))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT7               (*((volatile unsigned int*)(0x43817268UL)))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT8               (*((volatile unsigned int*)(0x4381726CUL)))
#define bM4_USBFS_DOEPTSIZ4_PKTCNT9               (*((volatile unsigned int*)(0x43817270UL)))
#define bM4_USBFS_DOEPCTL5_MPSIZ0                 (*((volatile unsigned int*)(0x43817400UL)))
#define bM4_USBFS_DOEPCTL5_MPSIZ1                 (*((volatile unsigned int*)(0x43817404UL)))
#define bM4_USBFS_DOEPCTL5_MPSIZ2                 (*((volatile unsigned int*)(0x43817408UL)))
#define bM4_USBFS_DOEPCTL5_MPSIZ3                 (*((volatile unsigned int*)(0x4381740CUL)))
#define bM4_USBFS_DOEPCTL5_MPSIZ4                 (*((volatile unsigned int*)(0x43817410UL)))
#define bM4_USBFS_DOEPCTL5_MPSIZ5                 (*((volatile unsigned int*)(0x43817414UL)))
#define bM4_USBFS_DOEPCTL5_MPSIZ6                 (*((volatile unsigned int*)(0x43817418UL)))
#define bM4_USBFS_DOEPCTL5_MPSIZ7                 (*((volatile unsigned int*)(0x4381741CUL)))
#define bM4_USBFS_DOEPCTL5_MPSIZ8                 (*((volatile unsigned int*)(0x43817420UL)))
#define bM4_USBFS_DOEPCTL5_MPSIZ9                 (*((volatile unsigned int*)(0x43817424UL)))
#define bM4_USBFS_DOEPCTL5_MPSIZ10                (*((volatile unsigned int*)(0x43817428UL)))
#define bM4_USBFS_DOEPCTL5_USBAEP                 (*((volatile unsigned int*)(0x4381743CUL)))
#define bM4_USBFS_DOEPCTL5_DPID                   (*((volatile unsigned int*)(0x43817440UL)))
#define bM4_USBFS_DOEPCTL5_NAKSTS                 (*((volatile unsigned int*)(0x43817444UL)))
#define bM4_USBFS_DOEPCTL5_EPTYP0                 (*((volatile unsigned int*)(0x43817448UL)))
#define bM4_USBFS_DOEPCTL5_EPTYP1                 (*((volatile unsigned int*)(0x4381744CUL)))
#define bM4_USBFS_DOEPCTL5_SNPM                   (*((volatile unsigned int*)(0x43817450UL)))
#define bM4_USBFS_DOEPCTL5_STALL                  (*((volatile unsigned int*)(0x43817454UL)))
#define bM4_USBFS_DOEPCTL5_CNAK                   (*((volatile unsigned int*)(0x43817468UL)))
#define bM4_USBFS_DOEPCTL5_SNAK                   (*((volatile unsigned int*)(0x4381746CUL)))
#define bM4_USBFS_DOEPCTL5_SD0PID                 (*((volatile unsigned int*)(0x43817470UL)))
#define bM4_USBFS_DOEPCTL5_SD1PID                 (*((volatile unsigned int*)(0x43817474UL)))
#define bM4_USBFS_DOEPCTL5_EPDIS                  (*((volatile unsigned int*)(0x43817478UL)))
#define bM4_USBFS_DOEPCTL5_EPENA                  (*((volatile unsigned int*)(0x4381747CUL)))
#define bM4_USBFS_DOEPINT5_XFRC                   (*((volatile unsigned int*)(0x43817500UL)))
#define bM4_USBFS_DOEPINT5_EPDISD                 (*((volatile unsigned int*)(0x43817504UL)))
#define bM4_USBFS_DOEPINT5_STUP                   (*((volatile unsigned int*)(0x4381750CUL)))
#define bM4_USBFS_DOEPINT5_OTEPDIS                (*((volatile unsigned int*)(0x43817510UL)))
#define bM4_USBFS_DOEPINT5_B2BSTUP                (*((volatile unsigned int*)(0x43817518UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ0               (*((volatile unsigned int*)(0x43817600UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ1               (*((volatile unsigned int*)(0x43817604UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ2               (*((volatile unsigned int*)(0x43817608UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ3               (*((volatile unsigned int*)(0x4381760CUL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ4               (*((volatile unsigned int*)(0x43817610UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ5               (*((volatile unsigned int*)(0x43817614UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ6               (*((volatile unsigned int*)(0x43817618UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ7               (*((volatile unsigned int*)(0x4381761CUL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ8               (*((volatile unsigned int*)(0x43817620UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ9               (*((volatile unsigned int*)(0x43817624UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ10              (*((volatile unsigned int*)(0x43817628UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ11              (*((volatile unsigned int*)(0x4381762CUL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ12              (*((volatile unsigned int*)(0x43817630UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ13              (*((volatile unsigned int*)(0x43817634UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ14              (*((volatile unsigned int*)(0x43817638UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ15              (*((volatile unsigned int*)(0x4381763CUL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ16              (*((volatile unsigned int*)(0x43817640UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ17              (*((volatile unsigned int*)(0x43817644UL)))
#define bM4_USBFS_DOEPTSIZ5_XFRSIZ18              (*((volatile unsigned int*)(0x43817648UL)))
#define bM4_USBFS_DOEPTSIZ5_PKTCNT0               (*((volatile unsigned int*)(0x4381764CUL)))
#define bM4_USBFS_DOEPTSIZ5_PKTCNT1               (*((volatile unsigned int*)(0x43817650UL)))
#define bM4_USBFS_DOEPTSIZ5_PKTCNT2               (*((volatile unsigned int*)(0x43817654UL)))
#define bM4_USBFS_DOEPTSIZ5_PKTCNT3               (*((volatile unsigned int*)(0x43817658UL)))
#define bM4_USBFS_DOEPTSIZ5_PKTCNT4               (*((volatile unsigned int*)(0x4381765CUL)))
#define bM4_USBFS_DOEPTSIZ5_PKTCNT5               (*((volatile unsigned int*)(0x43817660UL)))
#define bM4_USBFS_DOEPTSIZ5_PKTCNT6               (*((volatile unsigned int*)(0x43817664UL)))
#define bM4_USBFS_DOEPTSIZ5_PKTCNT7               (*((volatile unsigned int*)(0x43817668UL)))
#define bM4_USBFS_DOEPTSIZ5_PKTCNT8               (*((volatile unsigned int*)(0x4381766CUL)))
#define bM4_USBFS_DOEPTSIZ5_PKTCNT9               (*((volatile unsigned int*)(0x43817670UL)))
#define bM4_USBFS_PCGCCTL_STPPCLK                 (*((volatile unsigned int*)(0x4381C000UL)))
#define bM4_USBFS_PCGCCTL_GATEHCLK                (*((volatile unsigned int*)(0x4381C004UL)))
#define bM4_WDT_CR_PERI0                          (*((volatile unsigned int*)(0x42920000UL)))
#define bM4_WDT_CR_PERI1                          (*((volatile unsigned int*)(0x42920004UL)))
#define bM4_WDT_CR_CKS0                           (*((volatile unsigned int*)(0x42920010UL)))
#define bM4_WDT_CR_CKS1                           (*((volatile unsigned int*)(0x42920014UL)))
#define bM4_WDT_CR_CKS2                           (*((volatile unsigned int*)(0x42920018UL)))
#define bM4_WDT_CR_CKS3                           (*((volatile unsigned int*)(0x4292001CUL)))
#define bM4_WDT_CR_WDPT0                          (*((volatile unsigned int*)(0x42920020UL)))
#define bM4_WDT_CR_WDPT1                          (*((volatile unsigned int*)(0x42920024UL)))
#define bM4_WDT_CR_WDPT2                          (*((volatile unsigned int*)(0x42920028UL)))
#define bM4_WDT_CR_WDPT3                          (*((volatile unsigned int*)(0x4292002CUL)))
#define bM4_WDT_CR_SLPOFF                         (*((volatile unsigned int*)(0x42920040UL)))
#define bM4_WDT_CR_ITS                            (*((volatile unsigned int*)(0x4292007CUL)))
#define bM4_WDT_SR_CNT0                           (*((volatile unsigned int*)(0x42920080UL)))
#define bM4_WDT_SR_CNT1                           (*((volatile unsigned int*)(0x42920084UL)))
#define bM4_WDT_SR_CNT2                           (*((volatile unsigned int*)(0x42920088UL)))
#define bM4_WDT_SR_CNT3                           (*((volatile unsigned int*)(0x4292008CUL)))
#define bM4_WDT_SR_CNT4                           (*((volatile unsigned int*)(0x42920090UL)))
#define bM4_WDT_SR_CNT5                           (*((volatile unsigned int*)(0x42920094UL)))
#define bM4_WDT_SR_CNT6                           (*((volatile unsigned int*)(0x42920098UL)))
#define bM4_WDT_SR_CNT7                           (*((volatile unsigned int*)(0x4292009CUL)))
#define bM4_WDT_SR_CNT8                           (*((volatile unsigned int*)(0x429200A0UL)))
#define bM4_WDT_SR_CNT9                           (*((volatile unsigned int*)(0x429200A4UL)))
#define bM4_WDT_SR_CNT10                          (*((volatile unsigned int*)(0x429200A8UL)))
#define bM4_WDT_SR_CNT11                          (*((volatile unsigned int*)(0x429200ACUL)))
#define bM4_WDT_SR_CNT12                          (*((volatile unsigned int*)(0x429200B0UL)))
#define bM4_WDT_SR_CNT13                          (*((volatile unsigned int*)(0x429200B4UL)))
#define bM4_WDT_SR_CNT14                          (*((volatile unsigned int*)(0x429200B8UL)))
#define bM4_WDT_SR_CNT15                          (*((volatile unsigned int*)(0x429200BCUL)))
#define bM4_WDT_SR_UDF                            (*((volatile unsigned int*)(0x429200C0UL)))
#define bM4_WDT_SR_REF                            (*((volatile unsigned int*)(0x429200C4UL)))
#define bM4_WDT_RR_RF0                            (*((volatile unsigned int*)(0x42920100UL)))
#define bM4_WDT_RR_RF1                            (*((volatile unsigned int*)(0x42920104UL)))
#define bM4_WDT_RR_RF2                            (*((volatile unsigned int*)(0x42920108UL)))
#define bM4_WDT_RR_RF3                            (*((volatile unsigned int*)(0x4292010CUL)))
#define bM4_WDT_RR_RF4                            (*((volatile unsigned int*)(0x42920110UL)))
#define bM4_WDT_RR_RF5                            (*((volatile unsigned int*)(0x42920114UL)))
#define bM4_WDT_RR_RF6                            (*((volatile unsigned int*)(0x42920118UL)))
#define bM4_WDT_RR_RF7                            (*((volatile unsigned int*)(0x4292011CUL)))
#define bM4_WDT_RR_RF8                            (*((volatile unsigned int*)(0x42920120UL)))
#define bM4_WDT_RR_RF9                            (*((volatile unsigned int*)(0x42920124UL)))
#define bM4_WDT_RR_RF10                           (*((volatile unsigned int*)(0x42920128UL)))
#define bM4_WDT_RR_RF11                           (*((volatile unsigned int*)(0x4292012CUL)))
#define bM4_WDT_RR_RF12                           (*((volatile unsigned int*)(0x42920130UL)))
#define bM4_WDT_RR_RF13                           (*((volatile unsigned int*)(0x42920134UL)))
#define bM4_WDT_RR_RF14                           (*((volatile unsigned int*)(0x42920138UL)))
#define bM4_WDT_RR_RF15                           (*((volatile unsigned int*)(0x4292013CUL)))
#define bM4_WKTM_CR_WKTMCMP0                      (*((volatile unsigned int*)(0x42988000UL)))
#define bM4_WKTM_CR_WKTMCMP1                      (*((volatile unsigned int*)(0x42988004UL)))
#define bM4_WKTM_CR_WKTMCMP2                      (*((volatile unsigned int*)(0x42988008UL)))
#define bM4_WKTM_CR_WKTMCMP3                      (*((volatile unsigned int*)(0x4298800CUL)))
#define bM4_WKTM_CR_WKTMCMP4                      (*((volatile unsigned int*)(0x42988010UL)))
#define bM4_WKTM_CR_WKTMCMP5                      (*((volatile unsigned int*)(0x42988014UL)))
#define bM4_WKTM_CR_WKTMCMP6                      (*((volatile unsigned int*)(0x42988018UL)))
#define bM4_WKTM_CR_WKTMCMP7                      (*((volatile unsigned int*)(0x4298801CUL)))
#define bM4_WKTM_CR_WKTMCMP8                      (*((volatile unsigned int*)(0x42988020UL)))
#define bM4_WKTM_CR_WKTMCMP9                      (*((volatile unsigned int*)(0x42988024UL)))
#define bM4_WKTM_CR_WKTMCMP10                     (*((volatile unsigned int*)(0x42988028UL)))
#define bM4_WKTM_CR_WKTMCMP11                     (*((volatile unsigned int*)(0x4298802CUL)))
#define bM4_WKTM_CR_WKOVF                         (*((volatile unsigned int*)(0x42988030UL)))
#define bM4_WKTM_CR_WKCKS0                        (*((volatile unsigned int*)(0x42988034UL)))
#define bM4_WKTM_CR_WKCKS1                        (*((volatile unsigned int*)(0x42988038UL)))
#define bM4_WKTM_CR_WKTCE                         (*((volatile unsigned int*)(0x4298803CUL)))


#ifdef __cplusplus
}
#endif

#endif /* __HC32F46X_H__ */

